{
  "meta": {
    "title": "【日本語対応】SAP on AWS | Real Exam Questions 98% coverage",
    "description": "SAP on AWSにほとんどそのまま出る問題集です。\n日本語に翻訳し、解説も追加しています。\n\n> Udemy: [PAS-C01: SAP on AWS | Real Exam Questions 98% coverage](https://www.udemy.com/course/practice-exam98-coverage-aws-pas-c01-exam-sap-on-aws/)",
    "text_type": "markdown",
    "author": {
      "name": "みちのすけ",
      "icon_url": "https://qiita-image-store.s3.amazonaws.com/0/227791/profile-images/1550453410"
    }
  },
  "problems": [
    {
      "statement": {
        "en": [
          "A global enterprise is running SAP ERP Central Component (SAP ECC) workloads on Oracle in an on-premises environment. The enterprise plans to migrate to SAP S/4HANA on AWS.The enterprise recently acquired two other companies. One of the acquired companies is running SAP ECC on Oracle as its ERP system. The other acquired company is running an ERP system that is not from SAP. The enterprise wants to consolidate the three ERP systems into one ERP system on SAP S/4HANA on AWS. Not all the data from the acquired companies needs to be migrated to the final ERP system. The enterprise needs to complete this migration with a solution that minimizes cost and maximizes operational efficiency.Which solution will meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "あるグローバル企業は、オンプレミス環境で Oracle 上で SAP ERP Central Component (SAP ECC) ワークロードを実行しています。\nこの企業は、SAP S/4HANA on AWS への移行を計画しています。\n\n最近、この企業は2つの他社を買収しました。\n買収した1社は、ERP システムとして Oracle 上で SAP ECC を実行しています。\nもう1社は、SAP 以外の ERP システムを実行しています。\n\nこの企業は、SAP S/4HANA on AWS 上の1つの ERP システムに3つの ERP システムを統合したいと考えています。\n買収した企業からすべてのデータを最終的な ERP システムに移行する必要はありません。\nこの移行を、コストを最小限に抑え、オペレーション効率を最大化するソリューションで完了する必要があります。\n\nこれらの要件を満たすソリューションはどれですか？"
      },
      "choices": [
        {
          "en": "Perform a lift-and-shift migration of all the systems to AWS. Migrate the ERP system that is not from SAP to SAP ECC. Convert all three systems to SAP S/4HANA by using SAP Software Update Manager (SUM) Database Migration Option (DMO). Consolidate all three SAP S/4HANA systems into a final SAP S/4HANA system. Decommission the other systems.",
          "isTranslating": false,
          "ja": "すべてのシステムをAWSにリフト&シフト移行します。\nSAP以外のERPシステムをSAP ECCに移行します。\nSAP Software Update Manager（SUM）Database Migration Option（DMO）を使用して、3つのシステムをすべてSAP S/4HANAに変換します。\n最終的に、3つのSAP S/4HANAシステムを1つに統合してください。\nその他のシステムは廃止してください。"
        },
        {
          "en": "Perform a lift-and-shift migration of all the systems to AWS. Migrate the enterprise's initial system to SAP HANA, and then perform a conversion to SAP S/4HANA. Consolidate the two systems from the acquired companies with this SAP S/4HANA system by using the Selective Data Transition approach with SAP Data Management and Landscape Transformation (DMLT).",
          "isTranslating": false,
          "ja": "全てのシステムをAWSへ持ち込むために、リフト&シフトの移行を実施します。\n企業の最初のシステムをSAP HANAへ移行し、その後SAP S/4HANAへの変換を実行します。\nさらに、SAPのデータ管理とランドスケープ変換（DMLT）を用いて、選択的データ移行アプローチを利用して、2つの買収企業のシステムをSAP S/4HANAシステムと統合します。"
        },
        {
          "en": "Use SAP Software Update Manager (SUM) Database Migration Option (DMO) with System Move to re-architect the enterprise’s initial system to SAP S/4HANA and to change the platform to AWS. Consolidate the two systems from the acquired companies with this SAP S/4HANA system by using the Selective Data Transition approach with SAP Data Management and Landscape Transformation (DMLT).",
          "isTranslating": false,
          "ja": "SAP Software Update Manager（SUM）Database Migration Option（DMO）with System Moveを使用して、企業の初期システムをSAP S/4HANAに再構築し、プラットフォームをAWSに変更します。\nSAPデータ管理＆ランドスケープトランスフォーメーション（DMLT）を使用して、買収した企業の2つのシステムをこのSAP S/4HANAシステムと統合します。\nこの統合には選択的データ移行手法が採用されます。"
        },
        {
          "en": "Use SAP Software Update Manager (SUM) Database Migration Option (DMO) with System Move to re-architect all the systems to SAP S/4HANA and to change the platform to AWS. Consolidate all three SAP S/4HANA systems into a final SAP S/4HANA system. Decommission the other systems.",
          "isTranslating": false,
          "ja": "SAP ソフトウェア・アップデート・マネージャ (SUM) のデータベース移行オプション (DMO) を使用し、システムを SAP S/4HANA に再構築し、プラットフォームをAWSに変更します。\nさらに、すべての３つの SAP S/4HANA システムを最終的な SAP S/4HANA システムに統合し、他のシステムを廃止してください。"
        }
      ],
      "explanation": {
        "en": [
          "The enterprise should use SAP Software Update Manager (SUM) Database Migration Option (DMO) with System Move to re-architect the enterprise initial system to SAP S4HANA and change the platform to AWS. Consolidate the two systems from the acquired companies with this SAP S4HANA system by using the Selective Data Transition approach with SAP Data Management and Landscape Transformation (DMLT).\n\nThis solution meets the enterprise's requirements of minimizing cost and maximizing operational efficiency by using an automated approach to re-architect the initial system and consolidate the acquired systems. The selective data transition approach also allows the enterprise to only migrate the data that is required, further reducing cost and increasing efficiency. Furthermore, moving to the cloud-native platform AWS allows the enterprise to take advantage of the cost savings and scalability that the cloud offers."
        ],
        "isTranslating": false,
        "ja": "企業は、SAP Software Update Manager (SUM) Database Migration Option (DMO)とSystem Moveを使用して、初期のシステムをSAP S4HANAに再設計し、プラットフォームをAWSに変更する必要があります。SAP Data Management and Landscape Transformation (DMLT)を使用して、買収した2つの企業のシステムをこのSAP S4HANAシステムに統合することにより、このパッケージを活用できます。\n\nこのソリューションは、初期のシステムを再構築し、買収したシステムを統合するために自動化されたアプローチを使用することで、コストを最小限に抑え、運用効率を最大化するという企業の要件を満たしています。\n選択的データ移行アプローチにより、必要なデータのみを移行することができ、コストをさらに削減し、効率を高めることができます。\nさらに、クラウドネイティブプラットフォームのAWSへの移行により、クラウドが提供するコスト削減と拡張性を活用することができます。"
      },
      "corrects": [3],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A global retail company is running its SAP landscape on AWS. Recently, the company made changes to its SAP Web Dispatcher architecture. The company added an additional SAP Web Dispatcher for high availability with an Application Load Balancer (ALB) to balance the load between the two SAP Web Dispatchers.When users try to access SAP through the ALB, the system is reachable. However, the SAP backend system is showing an error message. An investigation reveals that the issue is related to SAP session handling and distribution of requests. The company confirmed that the system was working as expected with one SAP Web Dispatcher. The company replicated the configuration of that SAP Web Dispatcher to the new SAP Web Dispatcher.How can the company resolve the error?"
        ],
        "isTranslating": false,
        "ja": "あるグローバルな小売企業は、自社のSAP環境をAWS上で実行しています。\n最近、同社はSAP Web Dispatcherのアーキテクチャに変更を加えました。\n同社は、高可用性のために追加のSAP Web Dispatcherを搭載し、2つのSAP Web Dispatcherの負荷を分散するためにApplication Load Balancer（ALB）を導入しました。\n\nユーザーがALBを介してSAPにアクセスしようとすると、システムはアクセス可能ですが、SAPバックエンドシステムはエラーメッセージを表示します。\n調査の結果、この問題はSAPセッションの処理と要求の分配に関連していることがわかりました。\n同社は、1つのSAP Web Dispatcherで動作していたことを確認しました。\n同社はそのSAP Web Dispatcherの設定を新しいSAP Web Dispatcherに複製しました。\n\nこの問題を解決するために、同社はどのようにすればよいでしょうか？"
      },
      "choices": [
        {
          "en": "Maintain persistence by using session cookies. Enable session stickiness (session affinity) on the SAP Web Dispatchers by setting the wdisp/HTTP/esid_support parameter to True.",
          "isTranslating": false,
          "ja": "セッションクッキーを使用して永続性を維持します。\n`wdisp/HTTP/esid_support` パラメータを `True` に設定して、SAP Web Dispatchersでセッションスティッキネス（セッションアフィニティ）を有効にします。"
        },
        {
          "en": "Maintain persistence by using session cookies. Enable session stickiness (session affinity) on the ALB.",
          "isTranslating": false,
          "ja": "セッションクッキーを利用して永続性を維持します。\nALB でセッションスティッキネス（セッションアフィニティ）を有効にします。"
        },
        {
          "en": "Turn on host-based routing on the ALB to route traffic between the SAP Web Dispatchers.",
          "isTranslating": false,
          "ja": "SAP Web Dispatchers 間のトラフィックをルーティングするために、ALB 上でホストベースのルーティングを有効化します。"
        },
        {
          "en": "Turn on URL-based routing on the ALB to route traffic to the application based on URL.",
          "isTranslating": false,
          "ja": "ALB 上の URL ベースのルーティングを有効化し、URL に基づいてトラフィックをアプリケーションにルーティングします。"
        }
      ],
      "explanation": {
        "en": [
          "SAP Web Dispatcher is a component in SAP landscape that provides load balancing and security features. To ensure that the session handling and distribution of requests are properly managed in a high availability setup with multiple SAP Web Dispatchers, it is important to maintain persistence by using session cookies and enable session stickiness (session affinity). Session stickiness ensures that all requests from a particular user session are sent to the same SAP Web Dispatcher, thus avoiding any issues related to session handling. The wdisp/HTTP/esid support parameter in SAP Web Dispatcher configuration can be set to True to enable session stickiness.\n\nThe other options (B, C, and D) are not relevant to resolving the error related to SAP session handling and distribution of requests. Option B is not applicable as it is related to the ALB and not the SAP Web Dispatchers. Option C and D are related to routing traffic between different targets in an ALB, but do not address the issue of session handling and distribution of requests in SAP.\n\nhttps://help.sap.com/doc/saphelp_nw74/7.4.16/en-us/48/957c9194cc73eae10000000a42189b/content.htm?no_cache=true"
        ],
        "isTranslating": false,
        "ja": "SAP Web Dispatcherは、SAPランドスケープ内でロードバランシングとセキュリティ機能を提供するコンポーネントです。\n複数のSAP Web Dispatcherを使用する高可用性設定で、セッションの処理やリクエストの配布が適切に管理されるようにするためには、セッションクッキーを使用して永続性を維持し、セッションスティッキネス（セッションアフィニティ）を有効にすることが重要です。\n\nセッションスティッキネスにより、特定のユーザーセッションからのすべてのリクエストが同じSAP Web Dispatcherに送信されるため、セッション処理に関連する問題を回避できます。\nSAP Web Dispatcherの構成で `wdisp/HTTP/esid` サポートパラメータを `True` に設定することで、セッションスティッキネスを有効にできます。\n\nオプションB、C、Dは、SAPセッション処理とリクエストの配布に関連するエラーの解決には関係ありません。\nオプションBはALBに関連しており、SAP Web Dispatcherに関連していません。\nオプションCとDは、ALB内の異なるターゲット間のトラフィックルーティングに関連していますが、SAPにおけるセッション処理とリクエストの配布の問題を解決することはできません。"
      },
      "corrects": [1],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company hosts its SAP NetWeaver workload on SAP HANA in the AWS Cloud. The SAP NetWeaver application is protected by a cluster solution that uses Red Hat Enterprise Linux. High Availability Add-On. The cluster solution uses an overlay IP address to ensure that the high availability cluster is still accessible during failover scenarios.An SAP solutions architect needs to facilitate the network connection to this overlay IP address from multiple locations. These locations include more than 25 VPCs, other AWS Regions, and the on-premises environment. The company already has set up an AWS Direct Connect connection between the on-premises environment and AWS.What should the SAP solutions architect do to meet these requirements in the MOST scalable manner?"
        ],
        "isTranslating": false,
        "ja": "企業は、SAP NetWeaver アプリケーションを Red Hat Enterprise Linux High Availability Add-On を使用して保護しているクラスターで、SAP HANA でAWSクラウド上でホストしています。\nクラスターソリューションでは、オーバーレイIPアドレスを使用して、高可用性クラスターがフェイルオーバーする場面においてもアクセス可能であるようにしています。\n\nSAPソリューションアーキテクトは、このオーバーレイIPアドレスへのネットワーク接続を複数の場所から可能にする必要があります。\nこれらの場所には25以上のVPC、他のAWSリージョン、オンプレミス環境が含まれます。\n企業はすでにオンプレミス環境とAWS間にAWS Direct Connect接続を設定しています。\n\nSAPソリューションアーキテクトは、これらの要件を最もスケーラブルな方法で満たすために何をすべきでしょうか？"
      },
      "choices": [
        {
          "en": "Use VPC peering between the VPCs to route traffic between them.",
          "isTranslating": false,
          "ja": "VPC間のトラフィックをルーティングするために、VPCピアリングを使用します。"
        },
        {
          "en": "Use AWS Transit Gateway to connect the VPCs and on-premises networks together.",
          "isTranslating": false,
          "ja": "VPCとオンプレミスネットワークを結びつけるために、AWS Transit Gateway を使用します。"
        },
        {
          "en": "Use a Network Load Balancer to route connections to various targets within VPCs.",
          "isTranslating": false,
          "ja": "VPC内の様々なターゲットへの接続をルーティングするために、ネットワークロードバランサーを使用します。"
        },
        {
          "en": "Deploy a Direct Connect gateway to connect the Direct Connect connection over a private VIF to one or more VPCs in any accounts.",
          "isTranslating": false,
          "ja": "別のアカウントの一つまたは複数のVPCに、プライベートVIF経由でDirect Connect接続を接続するために、Direct Connectゲートウェイを展開します。"
        }
      ],
      "explanation": {
        "en": [
          "AWS Transit Gateway provides a centralized, scalable and highly available solution to connect VPCs and on-premises networks to the AWS Cloud. It acts as a hub that routes traffic between multiple VPCs, on-premises networks, and AWS accounts. Using a single AWS Transit Gateway, the SAP solutions architect can connect multiple VPCs and on-premises networks together in a scalable manner, making it possible to route network traffic to the overlay IP address of the high availability cluster. Additionally, Transit Gateway supports Direct Connect integration, making it possible to use the company's existing Direct Connect connection to route traffic to and from the on-premises environment.\n\nThe other options, VPC peering and Network Load Balancer, are not as scalable as Transit Gateway and might not be suitable for the company's requirements of connecting multiple VPCs and on-premises networks together. Option D. Deploying a Direct Connect gateway would only allow for connection to a single VPC, not multiple VPCs."
        ],
        "isTranslating": false,
        "ja": "AWS Transit Gatewayは、VPCやオンプレミスネットワークをAWSクラウドに接続するための集中的で拡張性が高く、高可用性のあるソリューションを提供します。\n複数のVPC、オンプレミスネットワーク、およびAWSアカウント間のトラフィックをルーティングするハブとして機能します。\n\n単一のAWS Transit Gatewayを使用することで、SAPソリューションアーキテクトは、スケーラブルな方法で複数のVPCとオンプレミスネットワークを接続できます。\nこれにより、ハイアベイラビリティクラスタのオーバーレイIPアドレスにネットワークトラフィックをルーティングすることが可能になります。また、Transit GatewayはDirect Connect統合をサポートしており、既存のDirect Connect接続を使用してオンプレミス環境とのトラフィックのルーティングが可能になります。\n\n他のオプションであるVPCピアリングやネットワークロードバランサーは、Transit Gatewayほど拡張性が高くなく、複数のVPCとオンプレミスネットワークを接続するための会社の要件には適していない可能性があります。\n\nDのオプションであるDirect Connectゲートウェイの展開は、単一のVPCにしか接続できず、複数のVPCに接続することはできません。"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is implementing SAP HANA on AWS. According to the company’s security policy, SAP backups must be encrypted. Only authorized team members can have the ability to decrypt the SAP backups.What is the MOST operationally efficient solution that meets these requirements?"
        ],
        "isTranslating": false,
        "ja": "ある会社は、AWS 上で SAP HANA を実装しています。\n同社のセキュリティポリシーにより、SAP バックアップは暗号化する必要があります。\nSAPバックアップを復号する能力を持つのは、許可されたチームメンバーのみとされています。\nこれらの要件を満たすために、最も効率的な操作方法は何ですか？"
      },
      "choices": [
        {
          "en": "Configure AWS Backint Agent for SAP HANA to create SAP backups in an Amazon S3 bucket. After a backup is created, encrypt the backup by using client-side encryption. Share the encryption key with authorized team members only.",
          "isTranslating": false,
          "ja": "AWS Backint Agent for SAP HANA を設定することで、Amazon S3 バケットに SAP のバックアップを作成できます。\nバックアップが作成された後、クライアントサイド暗号化を使用してバックアップを暗号化します。暗号化キーは、認可されたチームメンバーのみに共有してください。"
        },
        {
          "en": "Configure AWS Backint Agent for SAP HANA to use AWS Key Management Service (AWS KMS) for SAP backups. Create a key policy to grant decryption permission to authorized team members only.",
          "isTranslating": false,
          "ja": "AWS KMS を使用した SAP バックアップのために、AWS Backint エージェントを設定します。\n承認されたチームメンバーのみに復号化権限を付与するための鍵ポリシーを作成します。"
        },
        {
          "en": "Configure AWS Storage Gateway to transfer SAP backups from a file system to an Amazon S3 bucket. Use an S3 bucket policy to grant decryption permission to authorized team members only.",
          "isTranslating": false,
          "ja": "AWS Storage Gateway を設定し、ファイルシステムから Amazon S3 バケットに SAP のバックアップを転送します。\n認可されたチームメンバーのみに復号の権限を付与する S3 バケットポリシーを使用します。"
        },
        {
          "en": "Configure AWS Backint Agent for SAP HANA to use AWS Key Management Service (AWS KMS) for SAP backups. Grant object ACL decryption permission to authorized team members only.",
          "isTranslating": false,
          "ja": "AWS KMS を使用して、SAP HANA 用の AWS Backint Agent を構成し、SAPバックアップに使用してください。\nオブジェクト ACL の復号化権限は、認可されたチームメンバーのみに与えられます。"
        }
      ],
      "explanation": {
        "en": [
          "AWS Key Management Service (AWS KMS) is a managed service that makes it easy for you to create, control, rotate, and use encryption keys. By using AWS KMS for SAP backups, the company can ensure that the backups are encrypted and can be decrypted only by authorized team members. The company can create a key policy in AWS KMS that specifies the authorized team members and their decryption permissions, which ensures that the security policy is met. This option is operationally efficient because AWS KMS provides a secure and managed way to manage encryption keys and to enforce access controls."
        ],
        "isTranslating": false,
        "ja": "AWS Key Management Service（AWS KMS）は、暗号化キーを作成し、制御、ローテーション、使用することが簡単にできるサービスです。\nSAP のバックアップに AWS KMS を使用することで、企業はバックアップが暗号化され、許可されたチームメンバーのみが複合化できることを確認できます。\n企業はAWS KMSでキーポリシーを作成でき、承認されたチームメンバーとその複合化権限を指定し、セキュリティポリシーが満たされることを保証できます。\nこのオプションは、AWS KMSが暗号化キーを管理し、アクセス制御を遵守するための安全で管理された方法を提供するため、運用的に効率的です。"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A data analysis company has two SAP landscapes that consist of sandbox, development, QA, pre-production, and production servers. One landscape is on Windows, and the other landscape is on Red Hat Enterprise Linux. The servers reside in a room in a building that other tenants share.An SAP solutions architect proposes to migrate the SAP applications to AWS. The SAP solutions architect wants to move the production backups to AWS and wants to make the backups highly available to restore in case of unavailability of an on-premises server.Which solution will meet these requirements MOST cost-effectively?"
        ],
        "isTranslating": false,
        "ja": "データ解析会社は、サンドボックス、開発、QA、プレプロダクション、およびプロダクションサーバーから構成される2つの SAP ランドスケープを持っています。\n1つは Windows 上にあり、もう1つは Red Hat Enterprise Linux 上にあります。\nこれらのサーバーは、他のテナントが共有する建物の部屋にあります。\n\nSAP ソリューションアーキテクトは、SAP アプリケーションを AWS に移行することを提案しています。\nSAPソリューションアーキテクトは、プロダクションバックアップを AWS に移動し、オンプレミスサーバーが利用できない場合に復元するためにバックアップを高可用性にしたいと考えています。\n\nこれらの要件を最もコスト効果の高い方法で満たす解決策は何ですか？"
      },
      "choices": [
        {
          "en": "Take a backup of the production servers. Implement an AWS Storage Gateway Volume Gateway. Create file shares by using the Storage Gateway Volume Gateway. Copy the backup files to the file shares through NFS and SMB.",
          "isTranslating": false,
          "ja": "本番環境サーバーのバックアップを取得します。\nAWS Storage Gateway Volume Gateway を実装します。\nAWS Storage Gateway Volume Gateway を使用してファイル共有を作成します。\nNFSとSMBを介してバックアップファイルをファイル共有にコピーします。"
        },
        {
          "en": "Take a backup of the production servers. Send those backups to tape drives. Implement an AWS Storage Gateway Tape Gateway. Send the backups to Amazon S3 Standard-Infrequent Access (S3 Standard-IA) through the S3 console. Move the backups immediately to S3 Glacier Deep Archive.",
          "isTranslating": false,
          "ja": "プロダクションサーバーのバックアップを取得し、テープドライブに送ります。\nAWS Storage Gateway Tape Gateway を使用して、バックアップを Amazon S3 Standard-Infrequent Access (S3 Standard-IA) に送信します。\n即座に、S3コンソールを経由して、バックアップを Amazon S3 Glacier Deep Archive に移動します。"
        },
        {
          "en": "Implement a third-party tool to take images of the SAP application servers and database server. Take regular snapshots at 1-hour intervals. Send the snapshots to Amazon S3 Glacier directly through the S3 Glacier console. Store the same images in different S3 buckets in different AWS Regions.",
          "isTranslating": false,
          "ja": "SAPアプリケーションサーバーとデータベースサーバーのイメージを取得するためのサードパーティー製ツールを導入します。\n1時間ごとに定期的なスナップショットを取得し、S3 Glacier コンソールから直接 Amazon S3 Glacier に送信します。\n同じイメージを異なる AWS リージョンの異なるS3バケットに保存します。"
        },
        {
          "en": "Take a backup of the production servers. Implement an Amazon S3 File Gateway. Create file shares by using the S3 File Gateway. Copy the backup files to the file shares through NFS and SMB. Map backup files directly to Amazon S3. Configure an S3 Lifecycle policy to send the backup files to S3 Glacier based on the company’s data retention policy.",
          "isTranslating": false,
          "ja": "本番サーバーのバックアップを取ります。\nAmazon S3 File Gateway を展開し、ファイル共有を Amazon S3 File Gateway を使って作成します。NFS および SMB を使用してバックアップファイルをファイル共有にコピーします。\nバックアップファイルを直接Amazon S3にマッピングします。\n企業のデータ保持ポリシーに基づいて、S3ライフサイクルポリシーを設定し、バックアップファイルを S3 Glacier に送信します。"
        }
      ],
      "explanation": {
        "en": [
          "This solution meets the requirements for having the production backups highly available and stored in AWS in the most cost-effective manner. The S3 File Gateway provides a file-based interface to S3, allowing backup files to be stored and managed in S3 directly. The NFS and SMB file shares provide a familiar interface for accessing the backups, while the S3 Lifecycle policy provides a convenient way to store backups in S3 Glacier, a low-cost storage class, based on the company's data retention policy."
        ],
        "isTranslating": false,
        "ja": "この解決策は、プロダクションのバックアップを高可用性で、かつ AWS 内で最もコスト効率の高い方法で保存できる要件を満たしています。\nS3 ファイルゲートウェイは、S3 に直接バックアップファイルを格納し、管理できるファイルベースのインターフェースを提供しています。\nNFS と SMB のファイル共有は、バックアップにアクセスするために使い慣れたインターフェースを提供しします。\nS3 ライフサイクルポリシーは、データ保持ポリシーに基づいて、低コストなストレージクラスである S3 Glacier にバックアップを保存する便利な方法を提供しています。"
      },
      "corrects": [4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company’s SAP basis team is responsible for database backups in Amazon S3. The company frequently needs to restore the last 3 months of backups into the pre-production SAP system to perform tests and analyze performance. Previously, an employee accidentally deleted backup files from the S3 bucket. The SAP basis team wants to prevent accidental deletion of backup files in the future.Which solution will meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "ある企業の SAP 基盤チームは、Amazon S3 でのデータベースのバックアップを管理しています。\n同社は、頻繁に直近 3 ヶ月間のバックアップをプレプロダクション SAP システムに復元し、テストや性能解析を実行する必要があります。\n\n以前に、従業員がS3バケットから誤ってバックアップファイルを削除してしまったことがありました。\nSAP基盤チームは、将来的なバックアップファイルの誤削除を防止する必要があります。\n\nどのようなソリューションが要件を満たすでしょうか？"
      },
      "choices": [
        {
          "en": "Create a new resource-based policy that prevents deletion of the S3 bucket.",
          "isTranslating": false,
          "ja": "S3バケットの削除を防止する新しいリソースベースのポリシーを作成してください。"
        },
        {
          "en": "Enable versioning and multi-factor authentication (MFA) on the S3 bucket.",
          "isTranslating": false,
          "ja": "S3バケットのバージョニングとマルチファクタ認証(MFA)を有効にしてください。"
        },
        {
          "en": "Create signed cookies for the backup files in the S3 bucket. Provide the signed cookies to authorized users only.",
          "isTranslating": false,
          "ja": "S3バケット内のバックアップファイルに署名付きCookieを作成し、認可されたユーザーのみに署名付きCookieを提供してください。"
        },
        {
          "en": "Apply an S3 Lifecycle policy to move the backup files immediately to S3 Glacier.",
          "isTranslating": false,
          "ja": "バックアップファイルをすぐにS3 Glacierに移動するように、S3ライフサイクルポリシーを適用してください。"
        }
      ],
      "explanation": {
        "en": [
          "Enabling versioning on the S3 bucket ensures that all versions of the objects are stored, including previous versions and deletions. This allows the team to recover previous versions of the backup files in case they are accidentally deleted."
        ],
        "isTranslating": false,
        "ja": "S3 バケットのバージョン管理を有効にすると、オブジェクトのすべてのバージョンが保存され、以前のバージョンや削除も含まれます。\nこれにより、チームはバックアップファイルの以前のバージョンを復元することができ、誤って削除された場合でも安心です。"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company wants to run SAP HANA on AWS in the eu-central-1 Region. The company must make the SAP HANA system highly available by using SAP HANA system replication. In addition, the company must create a disaster recovery (DR) solution that uses SAP HANA system replication in the eu-west-1 Region. As prerequisites, the company has confirmed that Inter-AZ latency is less than 1 ms and that Inter-Region latency is greater than 1 ms.Which solutions will meet these requirements? (Choose two.)"
        ],
        "isTranslating": false,
        "ja": "ある企業は、AWS の `eu-central-1` リージョンで SAP HANA を実行したいと考えています。\n\nこの企業は、SAP HANA システムレプリケーションを使用して SAP HANA システムを高可用性にする必要があります。\n\nさらに、同社は `eu-west-1` リージョンで SAP HANA システムレプリケーションを使用する災害復旧（DR）ソリューションを作成する必要があります。\n\n同社は、Inter-AZ のレイテンシが 1 ミリ秒未満であり、`Inter-Region` のレイテンシが 1 ミリ秒以上であることを前提条件として確認しました。\n\nこれらの要件を満たすために、どのソリューションを使用すればよいでしょうか？ "
      },
      "choices": [
        {
          "en": "Install the tier 1 primary system and the tier 2 secondary system in eu-central-1. Configure the tier 1 system in Availability Zone 1. Configure the tier 2 system in Availability Zone 2. Configure SAP HANA system replication between tier 1 and tier 2 by using ASYNC replication mode. Install the DR tier 3 secondary system in eu-west-1 by using SYNC replication mode.",
          "isTranslating": false,
          "ja": "`eu-central-1` に Tier 1 のプライマリシステム及び Tier 2 のセカンダリシステムをインストールし、Tier 1 システムをアベイラビリティゾーン 1 に設定します。\nTier 2 システムはアベイラビリティゾーン 2 に設定します。\n\nTier 1 と Tier 2 間の SAP HANA システム複製には ASYNC 複製モードを使用します。\nまた、`eu-west-1` に DR Tier 3 のセカンダリシステムを SYNC 複製モードでインストールします。"
        },
        {
          "en": "Install the tier 1 primary system and the tier 2 secondary system in eu-central-1. Configure the tier 1 system in Availability Zone 1. Configure the tier 2 system in Availability Zone 2. Configure SAP HANA system replication between tier 1 and tier 2 by using SYNC replication mode. Install the DR tier 3 secondary system in eu-west-1 by using ASYNC replication mode.",
          "isTranslating": false,
          "ja": "`eu-central-1` にて Tier 1 プライマリーシステムと Tier 2 セカンダリーシステムをインストールし、Tier 1 システムをアベイラビリティーゾーン1で構成します。\nTier 2 システムをアベイラビリティーゾーン2で構成します。\n\nSYNC レプリケーションモードを使用して Tier 1 と Tier 2の SAP HANA システムレプリケーションを構成します。\n`eu-west-1` にて DR Tier 3 セカンダリーシステムを ASYNC レプリケーションモードを使用してインストールします。"
        },
        {
          "en": "Install the tier 1 primary system and the tier 2 secondary system in eu-central-1. Configure the tier 1 system in Availability Zone 1. Configure the tier 2 system in Availability Zone 2. Configure SAP HANA system replication between tier 1 and tier 2 by using SYNC replication mode. Install the DR tier 3 secondary system in eu-west-1. Store daily backups from tier 1 in an Amazon S3 bucket in eu-central-1. Use S3 Cross-Region Replication to copy the daily backups to eu-west-1, where they can be restored if needed.",
          "isTranslating": false,
          "ja": "`eu-central-1` に、Tier 1 のプライマリシステムと Tier 2 のセカンダリシステムをインストールします。\nTier 1 システムをアベイラビリティーゾーン 1 に、Tier 2 システムをアベイラビリティーゾーン 2 に設定します。\n\nSYNC レプリケーションモードを使用して、Tier 1 と Tier 2 の間に SAP HANA システムのレプリケーションを構成します。\n`eu-west-1` に DR 用の Tier 3 セカンダリシステムをインストールします。\n\nTier 1 の日次バックアップを `eu-central-1` の Amazon S3 バケットに保存します。\n必要に応じてリストアができるよう、S3 クロスリージョンレプリケーションを使用して日次バックアップを `eu-west-1` にコピーします。"
        },
        {
          "en": "Install the tier 1 primary system in eu-central-1. Install the tier 2 secondary system and the DR tier 3 secondary system in eu-west-1. Configure the tier 2 system in Availability Zone 1. Configure the tier 3 system in Availability Zone 2. Configure SAP HANA system replication between all tiers by using ASYNC replication mode.",
          "isTranslating": false,
          "ja": "Tier 1 のプライマリシステムを `eu-central-1` にインストールします。\nTier 2 のセカンダリシステムと DR Tier 3 のセカンダリシステムを `eu-west-1` にインストールします。\n\nTier 2 システムは、アベイラビリティーゾーン 1 に、Tier 3 システムはアベイラビリティーゾーン 2 に設定します。\nまた、全ての階層間で ASYNC レプリケーションモードを使用して SAP HANA システムのレプリケーションを構成します。"
        },
        {
          "en": "Install the tier 1 primary system and the tier 2 secondary system in eu-central-1. Configure the tier 1 system in Availability Zone 1. Configure the tier 2 system in Availability Zone 2. Configure SAP HANA system replication between tier 1 and tier 2 by using SYNCMEM replication mode. Install the DR tier 3 secondary system in eu-west-1 by using ASYNC replication mode.",
          "isTranslating": false,
          "ja": "`eu-central-1` に Tier 1 のプライマリーシステムと Tier 2のセカンダリーシステムをインストールし、Tier 1 システムをアベイラビリティゾーン1に構成します。\nTier 2 システムをアベイラビリティゾーン2に構成します。\n\nSYNCMEM レプリケーションモードを使用して、Tier 1と Tier 2 間で SAP HANA システムのレプリケーションを構成します。\nそして、`eu-west-1` に DR Tier 3 のセカンダリーシステムを ASYNC レプリケーションモードを使用してインストールします。"
        }
      ],
      "explanation": {
        "en": [
          "The problem statement says that HANA system replication is used for both high availability and DR. Therefore, for High Availability, it would be SYNC replication mode or SYNCMEM replication mode, and for DR, it would be ASYNC replication mode. So, the answer is B and E.\n\nhttps://docs.aws.amazon.com/sap/latest/sap-hana/hana-ops-patterns-multi.html\n\nhttps://docs.aws.amazon.com/sap/latest/sap-hana/sap-hana-on-aws-aws-infrastructure-operating-system-setup-and-hana-installation.html"
        ],
        "isTranslating": false,
        "ja": "問題文には、HANA システム複製が高可用性と DR の両方で使用されていることが記載されています。\nしたがって、高可用性の場合は SYNC 複製モードまたは SYNCMEM 複製モードであり、DR の場合は ASYNC 複製モードであることがわかります。\n\n高可用性のための AZ 間レプリケーションには SYNC または SYNCMEM モードを、DR のためのリージョン間レプリケーションには ASYNC モードを使用している選択肢が正解です。\n\nしたがって、答えはBとEです。\n\n![レプリケーションの構成図](https://docs.aws.amazon.com/images/sap/latest/sap-hana/images/pattern6.1.png)\n\n> 参考資料\n> - https://docs.aws.amazon.com/sap/latest/sap-hana/hana-ops-patterns-multi.html\n> - https://docs.aws.amazon.com/sap/latest/sap-hana/sap-hana-on-aws-aws-infrastructure-operating-system-setup-and-hana-installation.html"
      },
      "corrects": [2, 5],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is running an SAP ERP Central Component (SAP ECC) system on an SAP HANA database that is 10 TB in size. The company is receiving notifications about long-running database backups every day. The company uses AWS Backint Agent for SAP HANA (AWS Backint agent) on an Amazon EC2 instance to back up the database. An SAP NetWeaver administrator needs to troubleshoot the problem and propose a solution.Which solution will help resolve this problem?"
        ],
        "isTranslating": false,
        "ja": "ある企業は、SAP HANA データベースのサイズが 10 TB である SAP ERP Central Component (SAP ECC) システムを稼働させています。\n\nこの企業は、毎日長時間実行されるデータベースのバックアップに関する通知を受け取っています。\n\nこの企業は、AWS Backint エージェントを使用してデータベースをバックアップするために Amazon EC2 インスタンス上で実行されています。\n\nSAP NetWeaver 管理者は、この問題をトラブルシューティングし、解決策を提案する必要があります。\n\nどの解決策がこの問題を解決するのに役立ちますか？ "
      },
      "choices": [
        {
          "en": "Ensure that AWS Backint agent is configured to send the backups to an Amazon S3 bucket over the internet. Ensure that the EC2 instance is configured to access the internet through a NAT gateway.",
          "isTranslating": false,
          "ja": "AWS Backint エージェントが、インターネット越しに Amazon S3 バケットにバックアップを送信するように設定されていることを確認します。\nまた、EC2 インスタンスが NAT ゲートウェイを介してインターネットにアクセスできるように設定します。"
        },
        {
          "en": "Check the UploadChannelSize parameter for AWS Backint agent. Increase this value in the aws-backint-agent-config.yaml configuration file based on the EC2 instance type and storage configurations.",
          "isTranslating": false,
          "ja": "AWS Backint エージェントの `UploadChannelSize` パラメーターを確認してください。\nEC2インスタンスタイプとストレージ構成に基づいて、`aws-backint-agent-config.yaml` 設定ファイルでこの値を増やしてください。"
        },
        {
          "en": "Check the MaximumConcurrentFilesForRestore parameter for AWS Backint agent. Increase the parameter from 5 to 10 by using the aws-backint-agent-config.yaml configuration file.",
          "isTranslating": false,
          "ja": "AWS Backint エージェントの `MaximumConcurrentFilesForRestore` パラメータを確認してください。\n`aws-backint-agent-config.yaml` 設定ファイルを使用して、パラメータを `5` から `10` に増やしてください。"
        },
        {
          "en": "Ensure that the backups are compressed. If necessary, configure AWS Backint agent to compress the backups and send them to an Amazon S3 bucket.",
          "isTranslating": false,
          "ja": "バックアップが圧縮されていることを確認してください。\n必要に応じて、AWS の Backint エージェントを設定し、バックアップを圧縮して Amazon S3 バケットに送信します。"
        }
      ],
      "explanation": {
        "en": [
          "The reason is that the long running database backups can be caused by limited network bandwidth between the EC2 instance and the S3 bucket. The UploadChannelSize parameter controls the maximum number of bytes that the AWS Backint agent can send to the S3 bucket in a single upload operation. By increasing the value, the administrator can increase the amount of data that can be uploaded in each transfer, which can reduce the overall backup time."
        ],
        "isTranslating": false,
        "ja": "長期間実行されるデータベースのバックアップに問題が生じる原因は、EC2インスタンスとS3バケットの間のネットワーク帯域制限にあります。\n\n`UploadChannelSize` パラメーターは、AWS Backint エージェントが単一のアップロード操作で S3 バケットに送信できる最大バイト数を制御します。\n\n値を増やすことで、管理者は一度の転送でアップロードできるデータ量を増やし、全体的なバックアップ時間を短縮することができます。"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company wants to migrate its SAP workloads to AWS from another cloud provider. The company’s landscape consists of SAP S/4HANA, SAP BW/4HANA, SAP Solution Manager, and SAP Web Dispatcher. SAP Solution Manager is running on SAP HANA.The company wants to change the operating system from SUSE Linux Enterprise Server to Red Hat Enterprise Linux as a part of this migration. The company needs a solution that results in the least possible downtime for the SAP S/4HANA and SAP BW/4HANA systems.Which migration solution will meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "ある企業は、別のクラウドプロバイダーから自社の SAP ワークロードを AWS に移行したいと考えています。\n\n同社のランドスケープは、SAP S/4HANA、SAP BW/4HANA、SAP Solution Manager、および SAP Web Dispatcherから構成されています。\nSAP Solution Manager は SAP HANA 上で実行されています。\n\nこの移行の一環として、同社はオペレーティングシステムを SUSE Linux Enterprise Server から Red Hat Enterprise Linux に変更したいと考えています。\n\nSAP S/4HANA および SAP BW/4HANA システムの稼働中断を最小限に抑える解決策が必要です。\n\nこの要件を満たす移行解決策はどれでしょうか？"
      },
      "choices": [
        {
          "en": "Use SAP Software Provisioning Manager to perform a system export/import for SAP S/4HANA, SAP BW/4HANA, SAP Solution Manager, and SAP Web Dispatcher.",
          "isTranslating": false,
          "ja": "SAP Software Provisioning Manager を利用し、SAP S/4HANA、SAP BW/4HANA、SAP Solution Manager、SAP Web Dispatcher のシステムのエクスポート/インポートを実行します。"
        },
        {
          "en": "Use backup and restore for SAP S/4HANA, SAP BW/4HANA, and SAP Solution Manager. Reinstall SAP Web Dispatcher on AWS with the necessary configuration.",
          "isTranslating": false,
          "ja": "SAP S/4HANA、SAP BW/4HANA、SAP Solution Manager には、バックアップとリストアを使用します。\n必要な設定を行った上で、AWS 上に SAP Web Dispatcher を再インストールします。"
        },
        {
          "en": "Use backup and restore for SAP S/4HANA and SAP BW/4HANA. Use SAP Software Provisioning Manager to perform a system export/import for SAP Solution Manager. Reinstall SAP Web Dispatcher on AWS with the necessary configuration.",
          "isTranslating": false,
          "ja": "SAP S/4HANA と SAP BW/4HANA についてはバックアップとリストアを使用します。\nSAP Solution Manager のシステムエクスポート/インポートを実行するために、SAP Software Provisioning Manager を使用します。\n必要な設定で AWS 上に SAP Web Dispatcher を再インストールします。"
        },
        {
          "en": "Use SAP HANA system replication to replicate the data between the source system and the target AWS system for SAP S/4HANA and SAP BW/4HANA. Use SAP Software Provisioning Manager to perform a system export/import for SAP Solution Manager. Reinstall SAP Web Dispatcher on AWS with the necessary configuration.",
          "isTranslating": false,
          "ja": "SAP S/4HANA と SAP BW/4HANA のソースシステムとターゲット AWS システム間でデータをレプリケーションするために、SAP HANA システムレプリケーションを使用します。\nSAP Solution Manager のシステムエクスポート/インポートを実行するために、SAP Software Provisioning Manager を使用します。\n必要な構成で AWS に SAP Web Dispatcher を再インストールします。"
        }
      ],
      "explanation": {
        "en": [
          "Use SAP HANA system replication to replicate the data between the source system and the target AWS system for SAP S4HANA and SAP BW 4HANA. Use SAP Software Provisioning Manager to perform a system export/import for SAP Solution Manager. Reinstall SAP Web Dispatcher on AWS with the necessary configuration.\n\nSAP HANA system replication is a disaster recovery solution that enables real-time data replication between two SAP HANA systems. By using this method for SAP S4HANA and SAP BW 4HANA, the company can minimize downtime during the migration process. Furthermore, using SAP Software Provisioning Manager to perform a system export/import for SAP Solution Manager ensures that the configuration of the system remains unchanged. Finally, reinstalling SAP Web Dispatcher on AWS with the necessary configuration will enable the company to fully migrate the SAP workloads to AWS while minimizing downtime."
        ],
        "isTranslating": false,
        "ja": "SAP HANA システムのレプリケーションは、SAP S4HANA および SAP BW 4HANA のソースシステムと、対象の AWS システム間でデータをレプリケートするために使用します。\n\nSAP ソフトウェアプロビジョニングマネージャーを使用して SAP Solution Manager のシステムエクスポート/インポートを実行することで、システムの設定が変更されずに維持されます。\n\nまた、必要な構成で AWS 上に SAP Web Dispatcher を再インストールすることで、マイグレーション中のダウンタイムを最小限に抑えます。\n\nSAP S4HANA および SAP BW 4HANA のマイグレーションプロセス中に、SAP HANA システムのレプリケーションを使用することで、ダウンタイムを最小限に抑えることができます。"
      },
      "corrects": [4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is running an SAP on Oracle system on IBM Power architecture in an on-premises data center. The company wants to migrate the SAP system to AWS. The Oracle database is 15 TB in size. The company has set up a 100 Gbps AWS Direct Connect connection to AWS from the on-premises data center.Which solution should the company use to migrate the SAP system MOST quickly?"
        ],
        "isTranslating": false,
        "ja": "ある企業では、オンプレミスのデータセンターで IBM Power アーキテクチャを使用した Oracle 上で SAP を実行しています。\n\n企業は、SAP システムを AWS に移行したいと考えています。\nOracle のデータベースのサイズは 15 TB です。\n\n企業は、オンプレミスのデータセンターから AWS への 100 Gbps の AWS Direct Connect 接続を設定しています。\n\nこの状況下で SAP システムを最も迅速に移行するには、どのソリューションを利用すべきでしょうか？"
      },
      "choices": [
        {
          "en": "Before the migration window, build a new installation of the SAP system on AWS by using SAP Software Provisioning Manager. During the migration window, export a copy of the SAP system and database by using the heterogeneous system copy process and R3load. Copy the output of the SAP system files to AWS through the Direct Connect connection. Import the SAP system to the new SAP installation on AWS. Switch over to the SAP system on AWS.",
          "isTranslating": false,
          "ja": "マイグレーションウィンドウの前に、SAP Software Provisioning Manager を使用して AWS 上に SAP システムの新しいインストールを構築します。\n\nマイグレーション期間中は、異種システムコピーおよび R3load を使用して、SAP システムおよびデータベースのコピーをエクスポートします。\n\nSAP システムの出力ファイルを Direct Connect 接続を通じて AWS にコピーします。\n\nそして、SAP システムを AWS 上の新しいインストールにインポートします。\n\n最後に、AWS上のSAPシステムに切り替えます。"
        },
        {
          "en": "Before the migration window, build a new installation of the SAP system on AWS by using SAP Software Provisioning Manager. Back up the Oracle database by using native Oracle tools. Copy the backup of the Oracle database to AWS through the Direct Connect connection. Import the Oracle database to the SAP system on AWS. Configure Oracle Data Guard to begin replicating on-premises database log changes from the SAP system to the new AWS system. During the migration window, use Oracle to replicate any remaining changes to the Oracle database hosted on AWS. Switch over to the SAP system on AWS.",
          "isTranslating": false,
          "ja": "AWS 上に SAP システムの新規のインストールを行う前に、SAP Software Provisioning Manager を使用して構築します。\n\nOracle のバックアップは、ネイティブな Oracle ツールを使用して取得します。\n\nそのバックアップを Direct Connect 経由で AWS にコピーします。\n\nOracle データベースを AWS 上の SAP システムにインポートします。\n\nOracle Data Guard を構成し、オンプレミスのデータベースのログ変更を SAP システムから新しい AWS システムにコピーし始めます。\n\nマイグレーションウィンドウ中には、Oracle を使用して、AWS 上にホストされる Oracle データベースの残りの変更をレプリケートします。\n\n最後にAWS上のSAPシステムに切り替えて完了です。"
        },
        {
          "en": "Before the migration window, build a new installation of the SAP system on AWS by using SAP Software Provisioning Manager. Create a staging Oracle database on premises to perform Cross Platform Transportable Tablespace (XTTS) conversion on the Oracle database. Take a backup of the converted staging database. Copy the converted backup to AWS through the Direct Connect connection. Import the Oracle database backup to the SAP system on AWS. Take regularly scheduled incremental backups and XTTS conversions of the staging database. Transfer these backups and conversions to the AWS target database. During the migration window, perform a final incremental Oracle backup. Convert the final Oracle backup by using XTTS. Replay the logs in the target Oracle database hosted on AWS. Switch over to the SAP system on AWS.",
          "isTranslating": false,
          "ja": "AWS 上に SAP システムを新たにインストールする場合は、マイグレーションウィンドウの前に SAP Software Provisioning Manager を使用します。\n\nOracle データベースをステージング用に作成し、オンプレミスで Cross Platform Transportable Tablespace (XTTS) 変換を行ってバックアップを取得します。\n\n変換されたステージングデータベースのバックアップを Direct Connect 接続を介して AWS へコピーし、Oracle データベースのバックアップを AWS 上の SAP システムにインポートします。\n\nステージングデータベースの定期的な差分バックアップと XTTS 変換を取得し、これらのバックアップと変換を AWS ターゲットデータベースに転送します。\n\nマイグレーションウィンドウ中に、最終的な Oracle バックアップの差分バックアップを行い、XTTS を使用して変換します。\n\nAWS 上にホストされたターゲット Oracle データベースでログを再生し、AWS 上の SAP システムに切り替えます。"
        },
        {
          "en": "Before the migration window, launch an appropriately sized Amazon EC2 instance on AWS to receive the migrated SAP database. Create an AWS Server Migration Service (AWS SMS) job to take regular snapshots of the on-premises Oracle hosts. Use AWS SMS to copy the snapshot as an AMI to AWS through the Direct Connect connection. Create a new SAP on Oracle system by using the migrated AMI. During the migration window, take a final incremental SMS snapshot and copy the snapshot to AWS. Restart the SAP system by using the new up-to-date AMI. Switch over to the SAP system on AWS.",
          "isTranslating": false,
          "ja": "マイグレーションウィンドウ前に、適切なサイズの Amazon EC2 インスタンスを AWS 上に設定し、移行されるSAPのデータベースを受け取るようにします。\n\nAWS Server Migration Service（AWS SMS）のジョブを作成して、オンプレミスの Oracle ホストの正規スナップショットを取得します。\n\nAWS SMS を使用して、Direct Connect 接続を介してスナップショットを AWS に AMI としてコピーします。\n\nAMI を使用して移行された Oracle 上の新しい SAP システムを作成します。\n\nマイグレーションウィンドウ中に、最終的な増分 SMS スナップショットを取得し、AWS にスナップショットをコピーします。\n\n最新の AMI を使用して SAP システムを再起動します。\n\nAWS上のSAPシステムに切り替えてください。"
        }
      ],
      "explanation": {
        "en": [
          "https://aws.amazon.com/blogs/awsforsap/reducing-downtime-with-oracle-xtts-method-for-cross-platform-sap-migrations/"
        ],
        "isTranslating": false,
        "ja": "SAP クロスプラットフォーム移行に Oracle XTT の手法を活用し、ダウンタイムを短縮する方法について紹介している記事があります。\n\nこの記事では、Oracleデータベースで実行されているSAPアプリケーションを別のオペレーティングシステムに移行する方法について説明しています。\n\nオンプレミスのOracleデータベースを使用したSAPアプリケーションをAWSに移行する場合、異種環境移行であるため、SAPのクラシカルマイグレーション（R3load/Jload）メソッドを選択することが一般的です。\n\nしかし、Oracleのクロスプラットフォームトランスポータブルテーブルスペース（XTTS）メソッドを使用することで、長いダウンタイムを短縮することができます。\n\nこの方法では、Oracle Golden Gateを使用する方法もありますが、ライセンスに関する問題があります。\n\n記事では、Oracle XTTSメソッドを使用して、AWSへのクロスプラットフォームSAPマイグレーションを行い、ダウンタイムを短縮する方法について説明しています。\n\n具体的には、XTTSを使用してバックアップセットを転送し、AWS上でリストアすることで、ダウンタイムを短縮する方法を解説しています。\n\nまた、マイグレーションの前提条件やステップについても説明しています。\n\n![](https://d2908q01vomqb2.cloudfront.net/17ba0791499db908433b80f37c5fbc89b870084b/2020/07/10/TTS.jpg)\n\nhttps://aws.amazon.com/blogs/awsforsap/reducing-downtime-with-oracle-xtts-method-for-cross-platform-sap-migrations/"
      },
      "corrects": [3],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "An SAP solutions architect is designing an SAP HANA scale-out architecture for SAP Business Warehouse (SAP BW) on SAP HANA on AWS. The SAP solutions architect identifies the design as a three-node scale-out deployment of xte.32xiarge Amazon EC2 instances.The SAP solutions architect must ensure that the SAP HANA scale-out nodes can achieve the low-latency and high-throughput network performance that are necessary for node-to-node communication.Which combination of steps should the SAP solutions architect take to meet these requirements? (Choose two.)"
        ],
        "isTranslating": false,
        "ja": "SAP ソリューションアーキテクトは、AWS 上の SAP HANA の SAP Business Warehouse（SAP BW）のために SAP HANA スケールアウトアーキテクチャを設計しています。\n\nSAPソリューションアーキテクトは、`x1e.32xlarge` Amazon EC2 インスタンスの 3 ノードスケールアウト展開をデザインとして識別します。\n\nSAPソリューションアーキテクトは、ノード間通信に必要な低レイテンシーおよび高スループットネットワーク性能を実現できるようにする必要があります。\n\nこれらの要件を満たすために、SAPソリューションアーキテクトが取る必要がある手順の組み合わせはどれですか？"
      },
      "choices": [
        {
          "en": "Create a cluster placement group. Launch the instances into the cluster placement group.",
          "isTranslating": false,
          "ja": "クラスタ配置グループを作成し、インスタンスをそのグループに起動します。"
        },
        {
          "en": "Create a spread placement group. Launch the instances into the spread placement group.",
          "isTranslating": false,
          "ja": "Spread配置グループを作成します。\nそして、インスタンスをそのSpread配置グループに起動します。"
        },
        {
          "en": "Create a partition placement group. Launch the instances into the partition placement group.",
          "isTranslating": false,
          "ja": "パーティション配置グループを作成し、パーティション配置グループにインスタンスを起動します。"
        },
        {
          "en": "Based on the operating system version, verify that enhanced networking is enabled on all the nodes.",
          "isTranslating": false,
          "ja": "全てのノードで強化ネットワーキングが有効化されていることを、オペレーティングシステムバージョンを確認することで確認します。"
        },
        {
          "en": "Switch to a different instance family that provides network throughput that is greater than 25 Gbps.",
          "isTranslating": false,
          "ja": "ネットワークスループットが25 Gbpsを超える別のインスタンスファミリーに切り替えます。"
        }
      ],
      "explanation": {
        "en": [
          "A cluster placement group is a group of instances within a single Availability Zone that are deployed in an isolated unit. The instances in a cluster placement group have a higher network bandwidth and lower network latency compared to instances outside the placement group. This is critical for high-performance, low-latency node-to-node communication in an SAP HANA scale-out deployment.\n\nVerifying that enhanced networking is enabled on all the nodes is important because it provides higher network performance and lower latency compared to the regular network interface. This is essential for meeting the low-latency and high-throughput network performance requirements for node-to-node communication."
        ],
        "isTranslating": false,
        "ja": "クラスタ配置グループとは、単一のアベイラビリティーゾーン内に展開されたインスタンスのグループであり、隔離されたユニットとして展開されます。\n\nクラスタ配置グループ内のインスタンスは、配置グループの外のインスタンスと比較して、より高いネットワーク帯域幅と低いネットワークレイテンシーを持ちます。\n\nこれは、SAP HANAスケールアウト展開において、高性能で低レイテンシーなノード間通信に必要不可欠です。\n\nすべてのノードで強化されたネットワーキングが有効になっているかどうかを検証することは重要です。\n\nなぜなら、通常のネットワークインターフェースに比べて、強化されたネットワークはより高いネットワークパフォーマンスと低いレイテンシーを提供するため、ノード間通信の低レイテンシーおよび高スループットのネットワークパフォーマンス要件を満たすために必要だからです。\n\nパーティションプレイスメントグループは、アプリケーションに関連するハードウェア障害の頻度を軽減するために使用するので、不正解です。\n\n- [プレイスメントグループ](https://docs.aws.amazon.com/ja_jp/AWSEC2/latest/UserGuide/placement-groups.html)"
      },
      "corrects": [1, 4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company needs to migrate its critical SAP workloads from an on-premises data center to AWS. The company has a few source production databases that are 10 TB or more in size. The company wants to minimize the downtime for this migration.As part of the proof of concept, the company used a low-speed, high-latency connection between its data center and AWS. During the actual migration, the company wants to maintain a consistent connection that delivers high bandwidth and low latency. The company also wants to add a layer of connectivity resiliency. The backup connectivity does not need to be as fast as the primary connectivity.An SAP solutions architect needs to determine the optimal network configuration for data transfer. The solution must transfer the data with minimum latency.Which configuration will meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "企業には、オンプレミスデータセンターから AWS に重要な SAP ワークロードを移行する必要があります。\n\n企業には、10 TB 以上のいくつかのソースプロダクションデータベースがあります。\n\nこの移行にかかるダウンタイムを最小限に抑えたいと考えています。\n\n企業は、概念実証の一環として、データセンターと AWS の間に低速で高遅延の接続を使用しました。\n\n実際の移行では、高帯域幅かつ低遅延を提供する一貫した接続を維持することを希望しています。\n\n企業はまた、接続再生性のレイヤーを追加したいと考えています。\n\nバックアップ接続はプライマリ接続ほど速くする必要はありません。\n\nSAPのソリューションアーキテクトは、データ転送のための最適なネットワーク構成を決定する必要があります。\n\nソリューションは、最小の遅延でデータを転送する必要があります。\n\nどの構成がこれらの要件を満たしますか？"
      },
      "choices": [
        {
          "en": "Set up one AWS Direct Connect connection for connectivity between the on-premises data center and AWS. Add an AWS Site-to-Site VPN connection as a backup to the Direct Connect connection.",
          "isTranslating": false,
          "ja": "オンプレミスのデータセンターとAWS間で接続性を確保するために、AWS Direct Connect 接続を1つ設定します。\n\nさらに、Direct Connect 接続のバックアップとして AWS Site-to-Site VPN 接続を追加します。"
        },
        {
          "en": "Set up an AWS Direct Connect gateway with multiple Direct Connect connections that use a link aggregation group (LAG) between the on-premises data center and AWS.",
          "isTranslating": false,
          "ja": "オンプレミスデータセンターと AWS 間でリンク集約グループ（LAG）を使用した複数の Direct Connect 接続を備えた AWS Direct Connect ゲートウェイを設定します。"
        },
        {
          "en": "Set up Amazon Elastic File System (Amazon EFS) file system storage between the on-premises data center and AWS. Configure a cron job to copy the data into this EFS mount. Access the data in the EFS file system from the target environment.",
          "isTranslating": false,
          "ja": "オンプレミスのデータセンターと AWS 間で Amazon Elastic File System（Amazon EFS）ファイルシステムストレージを設定し、cron ジョブを構成してこの EFS マウントにデータをコピーします。\n\nターゲット環境から EFS ファイルシステムのデータにアクセスします。"
        },
        {
          "en": "Set up two redundant AWS Site-to-Site VPN connections for connectivity between the on-premises data center and AWS.",
          "isTranslating": false,
          "ja": "オンプレミス・データセンターと AWS 間の接続のために、冗長性のある AWS サイト間 VPN 接続を 2 つ設定します。\n\nこれにより、正しく稼働中の接続がある場合でも、常に接続が確立されます。"
        }
      ],
      "explanation": {
        "en": [
          "AWS Direct Connect provides a dedicated network connection from your on-premises data center to AWS. This connection bypasses the public internet and provides lower latency, higher bandwidth and more secure connectivity. By adding a backup AWS Site-to-Site VPN connection, the company can ensure connectivity resiliency in case the primary Direct Connect connection fails.\n\nOption B and D do not meet the requirement of having a low latency and high bandwidth connection as they both utilize the public internet which could be slow and less reliable.\n\nOption C - Setting up Amazon Elastic File System (Amazon EFS) file system storage between the on-premises data center and AWS, configuring a cron job to copy the data into this EFS mount and accessing the data in the EFS file system from the target environment does not guarantee the low latency and high bandwidth requirement for data transfer as EFS is not optimized for high performance data transfer."
        ],
        "isTranslating": false,
        "ja": "AWS Direct Connect は、オンプレミスのデータセンターから AWS への専用ネットワーク接続を提供します。\n\nこの接続は、パブリックインターネットをバイパスして低遅延、高帯域幅、より安全な接続を提供します。\n\nバックアップ AWS Site-to-Site VPN 接続を追加することにより、プライマリの Direct Connect 接続が失敗した場合でも、企業は接続の回復性を確保できます。\n\nオプション B と D は、両方ともパブリックインターネットを利用しているため、遅延が低く、帯域幅が高い接続という要件を満たしていません。\n\nオプション C は、オンプレミスのデータセンターと AWS の間で Amazon Elastic File System（Amazon EFS）ファイルシステムストレージを設定し、cron ジョブを構成してこれらのデータを EFS マウントにコピーし、ターゲット環境から EFS ファイルシステムのデータにアクセスするというものですが、EFS は高性能データ転送に最適化されていないため、低遅延、高帯域幅の要件を保証するわけではありません。"
      },
      "corrects": [1],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company wants to migrate its SAP ERP landscape to AWS. The company will use a highly available distributed deployment for the new architecture. Clients will access SAP systems from a local data center through an AWS Site-to-Site VPN connection that is already in place. An SAP solutions architect needs to design the network access to the SAP production environment.Which configuration approaches will meet these requirements? (Choose two.)"
        ],
        "isTranslating": false,
        "ja": "ある企業は、SAP ERPシステムをAWSに移行したいと考えています。\n\n同社は、新しいアーキテクチャには高可用性の分散展開を使用するつもりです。\n\nクライアントは、既に設定済みのAWSサイト間VPN接続を介して、ローカルのデータセンターからSAPシステムにアクセスします。\n\nSAPソリューションアーキテクトは、SAPプロダクション環境へのネットワークアクセスを設計する必要があります。\n\nこの要件を満たす構成アプローチはどれですか？"
      },
      "choices": [
        {
          "en": "For the ASCS instance, configure an overlay IP address that is within the production VPC CIDR range. Create an AWS Transit Gateway. Attach the VPN to the transit gateway. Use the transit gateway to route the communications between the local data center and the production VPC. Create a static route on the production VPC to route traffic that is directed to the overlay IP address to the ASCS instance.",
          "isTranslating": false,
          "ja": "本番 VPC CIDR の範囲内でオーバーレイ IP アドレスを設定して、ASCS インスタンスを構成します。\n\nAWS Transit Gateway を作成し、VPN を Transit Gateway にアタッチします。\n\nローカルデータセンターと 本番 VPCの間の通信を Transit Gateway を使用してルーティングします。\n\n本番 VPC に静的ルートを作成して、オーバーレイIPアドレスに送信されたトラフィックをASCSインスタンスにルーティングします。"
        },
        {
          "en": "For the ASCS instance, configure an overlay IP address that is outside the production VPC CIDR range. Create an AWS Transit Gateway. Attach the VPN to the transit gateway. Use the transit gateway to route the communications between the local data center and the production VPC. Create a static route on the production VPC to route traffic that is directed to the overlay IP address to the ASCS instance.",
          "isTranslating": false,
          "ja": "ASCS インスタンスについては、本番 VPC CIDR 範囲外のオーバーレイIPアドレスを構成します。\n\nAWS Transit Gateway を作成します。\nVPNを Transit Gateway にアタッチします。\n\nローカルデータセンターと本番VPC間の通信を Transit Gateway でルーティングできるようにします。\n\n本番VPCに静的ルートを作成して、オーバーレイIPアドレスに向けられたトラフィックをASCSインスタンスにルーティングします。"
        },
        {
          "en": "For the ASCS instance, configure an overlay IP address that is within the production VPC CIDR range. Create a target group that points to the overlay IP address. Create a Network Load Balancer, and register the target group. Create a static route on the production VPC to route traffic that is directed to the overlay IP address to the ASCS instance.",
          "isTranslating": false,
          "ja": "ASCS のインスタンスについて、VPC の本番 CIDR 範囲内にあるオーバーレイIPアドレスを設定します。\n\nオーバーレイ IP アドレスを指すターゲットグループを作成し、Network Load Balancer を作成して、ターゲットグループを登録してください。\n\n本番 VPC に静的なルートを作成して、オーバーレイ IP アドレスに向けられたトラフィックを ASCS インスタンスにルーティングするようにしてください。"
        },
        {
          "en": "For the ASCS instance, configure an overlay IP address that is outside the production VPC CIDR range. Create a target group that points to the overlay IP address. Create a Network Load Balancer, and register the target group. Create a static route on the production VPC to route traffic that is directed to the overlay IP address to the ASCS instance.",
          "isTranslating": false,
          "ja": "ASCS インスタンスに対して、本番 VPC CIDR 範囲外にオーバーレイIPアドレスを設定します。\n\nオーバーレイIPアドレスを指すターゲットグループを作成します。\nNetwork Load Balancerを作成し、ターゲットグループを登録します。\n\n本番VPCに静的ルートを作成して、オーバーレイIPアドレスに向けられたトラフィックをASCSインスタンスにルーティングします。"
        },
        {
          "en": "For the ASCS instance, configure an overlay IP address that is outside the production VPC CIDR range. Create a target group that points to the overlay IP address. Create an Application Load Balancer, and register the target group. Create a static route on the production VPC to route traffic that is directed to the overlay IP address to the ASCS instance.",
          "isTranslating": false,
          "ja": "ASCS インスタンスについて、プロダクション VPC CIDR 範囲の外側にオーバーレイ IP アドレスを構成してください。\n\nその上、オーバーレイ IP アドレスを指すターゲットグループを作成し、Application Load Balancer を作成して、ターゲットグループを登録してください。\n\n最後に、プロダクション VPC 上に静的ルートを作成して、オーバーレイ IP アドレスに向けられたトラフィックを ASCS インスタンスに転送してください。"
        }
      ],
      "explanation": {
        "en": [
          "In Option B, the ASCS instance is configured with an overlay IP address that is outside the production VPC CIDR range and a static route is created on the production VPC to route traffic to the ASCS instance. An AWS Transit Gateway is created and attached to the VPN, and it is used to route communications between the local data center and the production VPC. This option provides a scalable and highly available solution for routing traffic between the local data center and the production VPC.\n\nIn Option D, the ASCS instance is also configured with an overlay IP address that is outside the production VPC CIDR range and a static route is created on the production VPC to route traffic to the ASCS instance. An Application Load Balancer is created and a target group is created that points to the overlay IP address. The target group is registered with the load balancer, providing a highly available solution for distributing incoming traffic to the ASCS instance.\n\nBoth options B and D can provide a solution to meet the requirements, and the choice of which approach to use will depend on the specific needs and requirements of the company."
        ],
        "isTranslating": false,
        "ja": "オプションBでは、ASCSインスタンスにオーバーレイIPアドレスが設定され、プロダクションVPC CIDR範囲外にあります。\nプロダクションVPCに静的ルートが作成され、トラフィックがASCSインスタンスにルーティングされます。\nAWS Transit Gateway が作成され、VPN にアタッチされ、ローカルデータセンターとプロダクション VPC 間の通信に使用されます。\nこのオプションは、ローカルデータセンターとプロダクション VPC 間のトラフィックルーティングにスケーラブルで高可用性なソリューションを提供します。\n\nオプションDでも、ASCS インスタンスにオーバーレイ IP アドレスが設定され、プロダクション VPC CIDR 範囲外にあります。\nプロダクション VPC に静的ルートが作成され、ASCS インスタンスへトラフィックをルーティングします。\nApplication Load Balancer が作成され、オーバーレイIPアドレスをポイントするターゲットグループが作成されます。\nターゲットグループはロードバランサに登録され、着信トラフィックをASCSインスタンスに分散する高可用性のソリューションが提供されます。\n\nオプションBとDの両方が要件を満たすソリューションを提供できます。どちらのアプローチを使用するかは、企業の特定のニーズや要件に依存します。\n\n[Configuration Steps for Network Load Balancer](https://docs.aws.amazon.com/sap/latest/sap-hana/sap-oip-configuration-steps-for-network-load-balancer.html)"
      },
      "corrects": [2, 4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is running an SAP HANA database on AWS. The company is running AWS Backint Agent for SAP HANA (AWS Backint agent) on an Amazon EC2 instance. AWS Backint agent is configured to back up to an Amazon S3 bucket. The backups are failing with an AccessDenied error in the AWS Backint agent log file.What should an SAP basis administrator do to resolve this error?"
        ],
        "isTranslating": false,
        "ja": "ある企業は、AWS 上で SAP HANA データベースを稼働しています。\n\n同社は Amazon EC2 インスタンスで AWS Backint Agent for SAP HANA (AWS Backint エージェント) を実行しています。\n\nAWS Backint エージェントは、Amazon S3 バケットにバックアップするように構成されています。\n\nしかし、バックアップが AWS Backint エージェントのログファイルで AccessDenied エラーで失敗しています。\n\nSAP Basis 管理者は、このエラーを解決するために何をすべきでしょうか？"
      },
      "choices": [
        {
          "en": "Assign execute permissions at the operating system level for the AWS Backint agent binary and for AWS Backint agent.",
          "isTranslating": false,
          "ja": "AWS Backint エージェントバイナリと AWS Backint エージェントに対して、オペレーティングシステムレベルで実行権限を割り当ててください。"
        },
        {
          "en": "Assign an IAM role to an EC2 instance. Attach a policy to the IAM role to grant access to the target S3 bucket.",
          "isTranslating": false,
          "ja": "EC2 インスタンスに IAM ロールを割り当てます。\nIAM ロールにポリシーを添付して、ターゲットの S3 バケットへのアクセスを許可します。"
        },
        {
          "en": "Assign the correct Region ID for the S3BucketAwsRegion parameter in AWS Backint agent for the SAP HANA configuration file.",
          "isTranslating": false,
          "ja": "AWS Backint エージェントの SAP HANA 設定ファイルの S3BucketAwsRegion パラメータに正しいリージョン ID を割り当ててください。"
        },
        {
          "en": "Assign the value for the EnableTagging parameter in AWS Backint agent for the SAP HANA configuration file.",
          "isTranslating": false,
          "ja": "AWS Backint エージェントの SAP HANA 構成ファイルで EnableTagging パラメータの値を指定してください。"
        }
      ],
      "explanation": {
        "en": [
          "The \"AccessDenied\" error in the AWS Backint agent log file means that the EC2 instance does not have sufficient permissions to access the target S3 bucket. To resolve this issue, an SAP basis administrator should assign an IAM role to the EC2 instance, and then attach a policy to the IAM role to grant access to the target S3 bucket. This way, the EC2 instance will have the necessary permissions to write backups to the S3 bucket, and the \"AccessDenied\" error will be resolved.\n\nOptions A and C do not directly address the \"AccessDenied\" error, and option D does not relate to the error message."
        ],
        "isTranslating": false,
        "ja": "「AccessDenied」というエラーは AWS Backint エージェントログファイルで表示されるエラーで、このエラーはEC2インスタンスがターゲットのS3バケットにアクセスするための十分な権限を持っていないことを示しています。\n\nこの問題を解決するには、SAPベース管理者がEC2インスタンスにIAMロールを割り当て、次にIAMロールにポリシーを添付してターゲットのS3バケットへのアクセス権を付与する必要があります。\n\nこれにより、EC2インスタンスはS3バケットにバックアップを書き込むために必要な権限を持ち、そして「AccessDenied」エラーは解決されます。\n\nAとCは、「AccessDenied」エラーに直接対処していないため、選択肢としては不適切です。\nまた、Dはエラーメッセージに関連していないため、不適切です。"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is starting a new project to implement an SAP landscape with multiple accounts that belong to multiple teams in the us-east-2 Region. These teams include procurement, finance, sales, and human resources. An SAP solutions architect has started designing this new landscape and the AWS account structures.The company wants to use automation as much as possible. The company also wants to secure the environment, implement federated access to accounts, centralize logging, and establish cross-account security audits. In addition, the company’s management team needs to receive a top-level summary of policies that are applied to the AWS accounts.What should the SAP solutions architect do to meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "`us-east-2` リージョンに、複数のチームが所属し複数のアカウントを持つSAPランドスケープを実装するための新しいプロジェクトが始まりました。\n\nこれらのチームには、調達、財務、営業、人事が含まれます。\n\nSAPソリューションアーキテクトは、この新しいランドスケープとAWSアカウント構造の設計を開始しました。\n\n企業は、可能な限り自動化を利用し、環境のセキュリティを確保し、アカウントへのフェデレーションされたアクセスを実装し、ログの集中管理を行い、アカウント間のセキュリティ監査を確立したいと考えています。\n\nさらに、企業のマネジメントチームはAWSアカウントに適用される方針のトップレベルの要約を受け取る必要があります。\n\nこれらの要件を満たすために、SAPソリューションアーキテクトは何をすべきでしょうか？"
      },
      "choices": [
        {
          "en": "Use AWS CloudFormation StackSets to apply SCPs to multiple accounts in multiple Regions. Use an Amazon CloudWatch dashboard to check the applied policies in the accounts.",
          "isTranslating": false,
          "ja": "複数のアカウントおよび複数の地域に対して SCP を適用するには、AWS CloudFormation StackSets を使用します。\n\nアカウント内に適用されたポリシーを確認するには、Amazon CloudWatch ダッシュボードを使用してください。"
        },
        {
          "en": "Use an AWS Elastic Beanstalk blue/green deployment to create IAM policies and apply them to multiple accounts together. Use an Amazon CloudWatch dashboard to check the applied policies in the accounts.",
          "isTranslating": false,
          "ja": "複数のアカウントに IAM ポリシーを適用し、それらを同時に管理するために AWS Elastic Beanstalk のブルーグリーンデプロイメントを使用します。\n\nアカウントに適用されたポリシーを確認するために Amazon CloudWatch ダッシュボードを使用します。"
        },
        {
          "en": "Implement guardrails by using AWS CodeDeploy and AWS CodePipeline to deploy SCPs into each account. Use the CodePipeline deployment dashboard to check the applied policies in the accounts.",
          "isTranslating": false,
          "ja": "AWS CodeDeploy と AWS CodePipeline を使用して、各アカウントに SCP をデプロイすることによってガードレールを実装します。\n\nCodePipeline のデプロイメントダッシュボードを使用して、アカウントに適用されたポリシーを確認します。"
        },
        {
          "en": "Apply SCPs through AWS Control Tower. Use the AWS Control Tower integrated dashboard to check the applied policies in the accounts.",
          "isTranslating": false,
          "ja": "AWS Control Tower を介して SCP を適用してください。\n\nAWS Control Tower の統合ダッシュボードを使用して、アカウントに適用されたポリシーを確認してください。"
        }
      ],
      "explanation": {
        "en": [
          "AWS Control Tower is a service that provides a fast and secure way to set up and govern a new, secure, multi-account AWS environment based on best practices established through AWS' experience working with thousands of customers. AWS Control Tower automatically sets up and enforces policies across multiple accounts in a single AWS organization, helping to secure the environment, implement federated access to accounts, centralize logging, and establish cross-account security audits. The AWS Control Tower integrated dashboard provides a top-level summary of policies that are applied to the AWS accounts, which meets the company's management team's requirement."
        ],
        "isTranslating": false,
        "ja": "AWS Control Tower は、AWS が数千の顧客との取り組みを通じて確立されたベストプラクティスに基づいた、新しい、安全でマルチアカウントのAWS環境を迅速かつ安全に設定・管理するためのサービスです。\n\nAWS Control Tower は、1つの AWS 組織内の複数のアカウントに対して自動的にポリシーを設定し、強制することで、環境を安全に保護し、アカウントへのフェデレーションアクセスを実装し、ログを一元化し、クロスアカウントセキュリティ監査を確立します。\n\nAWS Control Tower の統合ダッシュボードは、AWS アカウントに適用されるポリシーの概要を提供し、企業のマネジメントチームの要件を満たします。"
      },
      "corrects": [4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is running its SAP workloads on premises and needs to migrate the workloads to AWS. All the workloads are running on SUSE Linux Enterprise Server and Oracle Database. The company’s landscape consists of SAP ERP Central Component (SAP ECC), SAP Business Warehouse (SAP BW), and SAP NetWeaver systems. The company has a dedicated AWS Direct Connect connection between its on-premises environment and AWS. The company needs to migrate the systems to AWS with the least possible downtime.Which migration solution will meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "ある企業が SAP ワークロードをオンプレミスで実行しており、AWS に移行する必要があります。\n\nワークロードはすべて SUSE Linux Enterprise Server と Oracle Database 上で実行されています。\n\n企業のシステムには、SAP ERP Central Component（SAP ECC）、SAP Business Warehouse（SAP BW）、SAP NetWeaver システムが含まれています。\n\n\n企業は専用の AWS Direct Connect でオンプレミス環境と AWS を接続しています。\n\n企業は、最小限のダウンタイムでシステムをAWSに移行する必要があります。\n\nこれらの要件を満たす移行ソリューションは何でしょうか？"
      },
      "choices": [
        {
          "en": "Use SAP Software Provisioning Manager to perform an export of the systems. Copy the export to Amazon S3. Use SAP Software Provisioning Manager to perform an import of the systems to SUSE Linux Enterprise Server and Oracle Database on AWS.",
          "isTranslating": false,
          "ja": "SAP Software Provisioning Manager を使用して、システムのエクスポートを実行します。エクスポートをAmazon S3にコピーします。\n\n次に、SAP Software Provisioning Manager を使用して、システムを SUSE Linux Enterprise Server およびAWS上のOracle Database にインポートします。"
        },
        {
          "en": "Use SAP Software Provisioning Manager to perform parallel export/import of the systems to migrate the systems to SUSE Linux Enterprise Server and Oracle Database on AWS.",
          "isTranslating": false,
          "ja": "システムを SUSE Linux Enterprise Server および AWS の Oracle データベースに移行するために、SAP Software Provisioning Manager を使用してシステムの並列でエクスポート/インポートを実行します。"
        },
        {
          "en": "Use SAP Software Provisioning Manager to perform parallel export/import of the systems to migrate the systems to Oracle Enterprise Linux and Oracle Database on AWS.",
          "isTranslating": false,
          "ja": "AWS 上の Oracle Enterprise Linux と Oracle Database にシステムを移行するために、SAP Software Provisioning Manager を使用してシステムを並列でエクスポート/インポートしてください。"
        },
        {
          "en": "Use SAP Software Provisioning Manager to perform an export of the systems. Copy the export to Amazon S3. Use SAP Software Provisioning Manager to perform an import of the systems to Oracle Enterprise Linux and Oracle Database on AWS.",
          "isTranslating": false,
          "ja": "SAP Software Provisioning Manager を使用してシステムのエクスポートを実行し、エクスポートを Amazon S3 にコピーします。\n\nまた、SAP Software Provisioning Manager を使用して、Oracle Enterprise Linux と AWS 上の Oracle Database にシステムをインポートします。"
        }
      ],
      "explanation": {
        "en": [
          "It is mandatory to have Oracle Enterprise Linux(OEL) as the operating system for running Oracle database for SAP.\nhttps://launchpad.support.sap.com/#/notes/1656250"
        ],
        "isTranslating": false,
        "ja": "SAPのOracleデータベースを実行するには、オペレーティングシステムにOracle Enterprise Linux（OEL）を使用することが必須となります。\n\nhttps://launchpad.support.sap.com/#/notes/1656250"
      },
      "corrects": [3],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is designing a disaster recovery (DR) strategy for an SAP HANA database that runs on an Amazon EC2 instance in a single Availability Zone. The company can tolerate a long RTO and an RPO greater than zero if it means that the company can save money on its DR process.The company has configured an Amazon CloudWatch alarm to automatically recover the EC2 instance if the instance experiences an unexpected issue. The company has set up AWS Backint Agent for SAP HANA to save the backups into Amazon S3.What is the MOST cost-effective DR option for the company's SAP HANA database?"
        ],
        "isTranslating": false,
        "ja": "ある会社が、単一の可用性ゾーンで実行されるAmazon EC2インスタンス上のSAP HANAデータベースの災害復旧（DR）戦略を設計しています。\n\n会社は、DRプロセスで費用を節約できる場合、長いRTOおよびRPOがあっても構いません。\n\n会社は、EC2インスタンスに予期しない問題が発生した場合、自動的にインスタンスを回復させるために、Amazon CloudWatchアラームを設定しています。\n\nまた、AWS Backint Agent for SAP HANAを設定して、バックアップをAmazon S3に保存しています。\n\nこの場合、会社のSAP HANAデータベースにとって最も費用対効果の高いDRオプションは何ですか？"
      },
      "choices": [
        {
          "en": "Set up AWS CloudFormation to automatically launch a new EC2 instance for the SAP HANA database in a second Availability Zone from backups that are stored in Amazon S3. When the SAP HANA database is operational, perform a database restore by using the standard SAP HANA restore process.",
          "isTranslating": false,
          "ja": "AWS CloudFormation を設定し、Amazon S3 に保存されたバックアップから SAP HANA データベース専用の新しい EC2 インスタンスを自動的に起動します。\n\nただし、別の可用性ゾーンに当該 EC2 インスタンスを起動する必要があります。\n\nSAP HANAデータベースがオンラインになったら、標準的な SAP HANA リストアプロセスでデータベースをリストアしてください。"
        },
        {
          "en": "Launch a secondary EC2 instance for the SAP HANA database on a less powerful EC2 instance type in a second Availability Zone. Configure SAP HANA system replication with the preload option turned off.",
          "isTranslating": false,
          "ja": "SAP HANA データベース用に、よりパワフルでない EC2 インスタンスタイプを使用して、第2のアベイラビリティーゾーンで2次 EC2 インスタンスを起動します。\n\nここで、SAP HANA システムレプリケーションを preload オプションをオフに設定して構成します。"
        },
        {
          "en": "Launch a secondary EC2 instance for the SAP HANA database on an equivalent EC2 instance type in a second Availability Zone. Configure SAP HANA system replication with the preload option turned on.",
          "isTranslating": false,
          "ja": "SAP HANAデータベース用の2次的な EC2 インスタンスを、別の可用性ゾーンに同等の EC2 インスタンスタイプで立ち上げます。\n\npreload オプションを有効にして、SAP HANAシステムレプリケーションを設定します。"
        },
        {
          "en": "Set up AWS CloudFormation to automatically launch a new EC2 instance for the SAP HANA database in a second Availability Zone from backups that are stored in Amazon Elastic Block Store (Amazon EBS). When the SAP HANA database is operational, perform a database restore by using the standard SAP HANA restore process.",
          "isTranslating": false,
          "ja": "AWS CloudFormation をセットアップし、Amazon Elastic Block Store（Amazon EBS）に保存されているバックアップから、SAP HANA データベース用の新しい EC2 インスタンスを自動的にセカンドアベイラビリティゾーンで起動します。 \n\nSAP HANAデータベースが動作している場合、標準の SAP HANA 復元プロセスを使用してデータベースを復元します。"
        }
      ],
      "explanation": {
        "en": [
          "https://docs.aws.amazon.com/sap/latest/sap-hana/hana-ops-ha-dr.html#backint-hana-hadr"
        ],
        "isTranslating": false,
        "ja": "AWS Backint Agent for SAP HANAは、クラウド上のAmazon EC2インスタンスで実行されるSAP HANAワークロードのバックアップとリストアのためのSAP認定バックアップとリストアアプリケーションです。AWS Backint Agentは、スタンドアロンアプリケーションとして実行され、既存のワークフローに統合され、SAP HANAデータベースをAmazon S3にバックアップし、SAP HANA Cockpit、SAP HANA Studio、SQLコマンドを使用してリストアします。AWS Backint Agentは、SAP HANAデータベースの完全、増分、差分バックアップをサポートします。また、ログファイルとカタログをAmazon S3にバックアップできます。\n\nAWS Backint Agent for SAP HANAを使用すると、SAP HANAシステムを高可用性にし、災害復旧の準備ができます。この場合、多重アベイラビリティーゾーンのAWSインフラストラクチャとAWS Backint Agentを使用して、すばやく操作を再開し、ダウンタイムコストを大幅に削減できます。バックアップおよびリストアの時間は、Amazon EC2インスタンスタイプ、Amazon EBSボリュームタイプ、およびデータベースサイズに依存します。\n\nまた、AWS Backint Agentを使用してSAP HANAシステムのバックアップをAmazon S3に格納することで、復旧ポイントオブジェクティブを低く抑えることができます。さらに、カスタムスクリプトを作成することなく、Amazon S3のバックアップファイルから迅速にリストアすることができます。\n\nAWS Backint Agentを使用する場合、リストア操作にかかる時間は、バックアップ時間の1.5〜2倍になることが通常です。バックアップの方法には、Amazon EBSスナップショットを使用する方法があります。スナップショットは、データベースサイズに関係なく高速なバックアッププロセスを提供し、Amazon S3に保存され、自動的にアベイラビリティーゾーン全体でレプリケートされます。\n\nスナップショットは、前回のスナップショット以降のデルタ変更のみを保存し、完了したI/O操作のブロックを含みます。スナップショットはAWSリージョン間でコピーしたり、他のAWSアカウントと共有することができます。\n\n### クラスターソリューション\n\nAWSでは、SAP HANAワークロードをクラスター構成で実行することも可能です。SAP HANAクラスターは、高可用性と障害耐性を提供し、クラスター内でのノード障害を回避できます。AWSは、SAP HANAクラスターの設計とデプロイをサポートするためのAWS Quick Startを提供しています。AWS Quick Startは、クラスターの自動化されたデプロイメント、VPCの構成、ロードバランシング、SAP HANAシステムの自動フェイルオーバーなどを提供します。AWSクラウドでは、SAP HANAの高可用性を実現するために、複数のAWSリージョンにまたがるクラスターソリューションもサポートされています。\n\n### まとめると\n\nAWS Backint Agent for SAP HANAは、SAP HANAのバックアップと復元に特化したアプリケーションであり、Amazon EC2インスタンス上のSAP HANAワークロードで使用できます。AWS Backint Agent for SAP HANAを使用することで、SAP HANAシステムを高可用性に設定し、災害復旧の準備を整えることができます。バックアップと復元は、AWSマルチアベイラビリティーゾーンのインフラストラクチャーと連携して行われ、スタンバイノードを使用せずに迅速にオペレーションを再開できます。また、AWS Backint Agent for SAP HANAは、Amazon S3へのバックアップストレージにより、復元ポイントの目標を下げ、迅速な復元を可能にするとともに、データ保護を確保します。さらに、AWS Quick Startを使用して、SAP HANAクラスターを構成することもできます。\n\nhttps://docs.aws.amazon.com/sap/latest/sap-hana/hana-ops-ha-dr.html#backint-hana-hadr"
      },
      "corrects": [1],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is using a multi-account strategy for SAP HANA and SAP BW/4HANA instances across development, QA, and production systems in the same AWS Region. Each system is hosted in its own VPC. The company needs to establish cross-VPC communication between the SAP systems.The company might add more SAP systems in the future. The company must create connectivity across the SAP systems and hundreds of AWS accounts. The solution must maximize scalability and reliability.Which solution will meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "同じ AWS リージョン内の開発、QA、および本番システムの SAP HANA および SAP BW / 4HANA インスタンスに対して、多数のアカウント戦略を使用しています。\n\n各システムは、それぞれ独自の VPC にホストされています。\n\nこの企業は、SAP システム間でクロス VPC 通信を確立する必要があります。\n\nこの企業は将来、さらに多くの SAP システムを追加する可能性があります。\n\nこの企業は、SAP システムおよび数百の AWS アカウント間で接続性を作成する必要があります。\n\n解決策は、スケーラビリティと信頼性を最大限に高める必要があります。\n\nこれらの要件を満たす解決策はどれですか？"
      },
      "choices": [
        {
          "en": "Create an AWS Transit Gateway in a central networking account. Attach the transit gateway to the AWS accounts. Set up routing and a network ACL to establish communication.",
          "isTranslating": false,
          "ja": "中央のネットワーキングアカウントに AWS Transit Gateway を作成します。AWS Transit Gateway を AWS アカウントにアタッチします。通信を確立するために、ルーティングとネットワーク ACL の設定を行います。"
        },
        {
          "en": "Set up VPC peering between the accounts. Configure routing in each VPC to use the VPC peering links.",
          "isTranslating": false,
          "ja": "アカウント間でVPCピアリングを設定し、各VPCでVPCピアリングリンクを使用するようにルーティングを設定します。"
        },
        {
          "en": "Create a transit VPC that uses the hub-and-spoke model. Set up routing to use the transit VPC for communication between the SAP systems.",
          "isTranslating": false,
          "ja": "SAP システム間の通信に Transit VPC を使用するハブアンドスポークモデルを利用した VPC を作成し、ルーティングを設定します。"
        },
        {
          "en": "Create a VPC link for each SAP system. Use the VPC links to connect the SAP systems.",
          "isTranslating": false,
          "ja": "各SAPシステムに対してVPCリンクを作成し、VPCリンクを使用してSAPシステムを接続してください。"
        }
      ],
      "explanation": {
        "en": [
          "A: The AWS Transit Gateway provides a scalable and centralized solution for cross-VPC communication and can support hundreds of AWS accounts. It allows creating a central hub that enables communication between multiple VPCs, providing a scalable and reliable solution for cross-VPC communication, which meets the company's requirements."
        ],
        "isTranslating": false,
        "ja": "AWS Transit Gateway は、数百の AWS アカウントをサポートし、拡張可能で中央集中型の解決策を提供します。\n\n複数のVPC間の通信を可能にする中央ハブを作成することができるため、横断的なVPC通信に対してスケーラブルで信頼性の高いソリューションを提供し、会社の要件を満たすことができます。\n\nAWS Transit GatewayはAmazon VPCの相互接続に使用できるネットワークトランジットハブです。AWS Transit Gatewayはクラウドルーターとして機能し、SAP管理AWSアカウント間の接続は一度だけ確立する必要があります。AWS Transit Gatewayを中央のコミュニケーションハブとしてデプロイすることで、複雑なピアリング設定も解決し、簡素化できます。\n\nSAP管理AWSアカウントに接続するには、自分のAWSアカウントでAWS Transit Gatewayを作成し、SAP管理AWSアカウントと共有する必要があります。その後、SAPはSAPマネージドサービス用のVPCをAWS Transit Gatewayにアタッチし、ルートテーブルのエントリを介してトラフィックフローを有効にすることができます。この設定では、AWS Transit Gatewayが自分のアカウントに存在し、管理可能なので、お客様はトラフィックのルーティングを常に制御できます。\n\nBは不正解です。VPC（Virtual Private Cloud）ピアリングは2つのVPC間のネットワーク接続で、プライベートIPv4アドレスまたはIPv6アドレスを使用したトラフィックフローを有効化します。インスタンス間では、同じネットワーク内にあるかのように通信することができます。\nVPC ピアリングはVPC 間の 1 対 1 の接続です。複数のVPCでマネージドSAPサービスに直接通信する必要がある場合は、複数のピアリング接続を設定する必要があります。AWSアカウントやVPCの数が多いと、これは複雑で管理が難しくなる可能性があるため、このようなシナリオではTransit Gatewayの利用を検討する必要があります。\n\nCは不正解です。Transit VPCを使用した方法では、Transit VPC に設置した VPN インスタンスが各 VGW に BGP でルート情報を伝播することで、Transit VPC を介して接続先同士の VPC 間通信が出来ます。このアーキテクチャは複雑で、これを解決するために生まれたのがTransit Gatewayです。Transit GatewayとTransit VPCが選択肢にある場合、Transit Gatewayを選択していいです。\nhttps://dev.classmethod.jp/articles/reinvent2018-net402-2-2/\n\nDは不正解です。VPCリンクは、API Gatewayがプライベートサブネットにアクセスするために使用されるものであり、この設問には関係ありません。\nhttps://dev.classmethod.jp/articles/http_api_with_private_integration_for_fargate/\n\nhttps://aws.amazon.com/jp/blogs/news/how-to-connect-sap-solutions-running-on-aws-with-aws-accounts-and-services/\n"
      },
      "corrects": [1],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is planning to deploy a new SAP NetWeaver ABAP system on AWS with an Oracle database that runs on an Amazon EC2 instance. The EC2 instance uses a Linux-based operating system. The company needs a database storage solution that provides flexibility to adjust the IOPS regardless of the allocated storage size.Which solution will meet these requirements MOST cost-effectively?"
        ],
        "isTranslating": false,
        "ja": "ある企業は、Amazon EC2 インスタンス上で動作する Oracle データベースを使用した AWS 上の新しい SAP NetWeaver ABAP システムを展開する計画を立てています。\n\nEC2 インスタンスは Linux ベースのオペレーティングシステムを使用しています。\n\n企業は、割り当てられたストレージサイズに関係なく IOPS を調整できるデータベースストレージソリューションが必要です。\n\nどのソリューションが最も費用効果に優れたものになりますか？"
      },
      "choices": [
        {
          "en": "General Purpose SSD (gp3) Amazon Elastic Block Store (Amazon EBS) volumes",
          "isTranslating": false,
          "ja": "Amazon Elastic Block Store (Amazon EBS) の一般的な目的の SSD（gp3）ボリューム"
        },
        {
          "en": "Amazon Elastic File System (Amazon EFS) Standard-Iinfrequent Access (Standard-IA) storage class",
          "isTranslating": false,
          "ja": "Amazon Elastic File System (Amazon EFS) のスタンダード-低頻度アクセス (Standard-IA) ストレージクラス"
        },
        {
          "en": "Amazon FSx for Windows File Server",
          "isTranslating": false,
          "ja": "Amazon FSx for Windows File Server"
        },
        {
          "en": "Provisioned IOPS SSD (io2) Amazon Elastic Block Store (Amazon EBS) volumes",
          "isTranslating": false,
          "ja": "Amazon Elastic Block Store (Amazon EBS) の Provisioned IOPS SSD (io2) ボリューム"
        }
      ],
      "explanation": {
        "en": [
          "This solution is most cost-effective because the gp3 volumes are the latest generation of General Purpose SSD storage and provide a balance between performance and cost. They offer a high level of IOPS performance and can handle a moderate level of I/O activity, making them well suited for use with an SAP NetWeaver ABAP system and an Oracle database. Additionally, the gp3 volumes are flexible, allowing the company to adjust the IOPS regardless of the allocated storage size, which will help them save costs as they scale their infrastructure in the future."
        ],
        "isTranslating": false,
        "ja": "この解決策が最もコスト効果が高いのは、gp3 ボリュームが汎用 SSD ストレージの最新世代であり、性能とコストのバランスを提供するからです。\n\n高い IOPS 性能を提供し、適度な I/O アクティビティに対応できるため、SAP NetWeaver ABAP システムやOracle データベースとの使用に適しています。\n\nまた、gp3 ボリュームは柔軟性があり、割り当てられたストレージサイズに関係なく IOPS を調整できるため、将来のインフラ拡大に伴いコストを節約できます。"
      },
      "corrects": [1],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is using SAP NetWeaver with Java on AWS. The company has updated its generation of Amazon EC2 instances to the most recent generation of EC2 instances. When the company tries to start SAP, the startup fails. The log indicates that the SAP license expired or is not valid.What is the reason for this issue?"
        ],
        "isTranslating": false,
        "ja": "ある会社は AWS 上で Java 搭載の SAP NetWeaver を使用しています。\n\n同社は Amazon EC2 インスタンスの世代を最新のものに更新しました。\n\nそして、SAPを起動しようとしたところ、起動に失敗しました。\n\nログによると、SAP のライセンスが期限切れまたは無効であるとのことです。\n\nこの問題の原因は何ですか？"
      },
      "choices": [
        {
          "en": "The instance ID changed as part of the EC2 generation change.",
          "isTranslating": false,
          "ja": "EC2 世代の変更の一環として、インスタンス ID が変更されました。"
        },
        {
          "en": "The instance’s hypervisor changed from Xen to Nitro.",
          "isTranslating": false,
          "ja": "インスタンスのハイパーバイザーが Xen から Nitro に変更されました。"
        },
        {
          "en": "The SAP Java Virtual Machine (SAP JVM) is not compatible with the new instance type.",
          "isTranslating": false,
          "ja": "SAP Java Virtual Machine (SAP JVM) は、新しいインスタンスタイプと互換性がありません。"
        },
        {
          "en": "An EC2 generation change is not supported for SAP Java-based systems.",
          "isTranslating": false,
          "ja": "SAP Java ベースのシステムに対しては、EC2 世代の変更はサポートされていません。"
        }
      ],
      "explanation": {
        "en": [
          "The instance ID does not change with EC2 generation. The change in hypervisor from Xen to Nitro may be the cause of the hardware ID change. https://docs.aws.amazon.com/sap/latest/general/overview-sap-on-aws.html#:~:text=SAP%20Note%202113263,AWS%20Hardware%20ID",
          "",
          "",
          "Also see SAP note 1656250 - SAP on AWS: Support prerequisites"
        ],
        "isTranslating": false,
        "ja": "EC2の世代によってインスタンスIDは変更されません。\n\nXenからNitroへのハイパーバイザーの変更がハードウェアIDの変更の原因である可能性があります。\n\nhttps://docs.aws.amazon.com/sap/latest/general/overview-sap-on-aws.html#:~:text=SAP%20Note%202113263,AWS%20Hardware%20ID\n\nまた、SAPノート1656250も参照してください。AWS上でのSAPをサポートするための前提条件について説明されています。"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company’s basis administrator is planning to deploy SAP on AWS in Linux. The basis administrator must set up the proper storage to store SAP HANA data and log volumes.Which storage options should the basis administrator choose to meet these requirements? (Choose two.)"
        ],
        "isTranslating": false,
        "ja": "ある企業のベース管理者は、Linux で SAP on AWS を導入することを計画しています。\n\nベース管理者は、SAP HANA データやログボリュームを格納するために適切なストレージを設定する必要があります。\n\nこれらの要件を満たすために、ベース管理者はどのストレージオプションを選択すべきでしょうか？"
      },
      "choices": [
        {
          "en": "Amazon Elastic Block Store (Amazon EBS) Throughput Optimized HDD (st1)",
          "isTranslating": false,
          "ja": "Amazon Elastic Block Store (Amazon EBS)のスループット最適化HDD（st1）"
        },
        {
          "en": "Amazon Elastic Block Store (Amazon EBS) Provisioned OPS SSD (io1, io2)",
          "isTranslating": false,
          "ja": "Amazon Elastic Block Store（Amazon EBS）のProvisioned OPS SSD（io1、io2）"
        },
        {
          "en": "Amazon S3",
          "isTranslating": false,
          "ja": "Amazon S3"
        },
        {
          "en": "Amazon Elastic File System (Amazon EFS)",
          "isTranslating": false,
          "ja": "Amazon Elastic File System（Amazon EFS）"
        },
        {
          "en": "Amazon Elastic Block Store (Amazon EBS) General Purpose SSD (gp2, gp3)",
          "isTranslating": false,
          "ja": "Amazon Elastic Block Store (Amazon EBS) の一般目的 SSD（gp2、gp3）"
        }
      ],
      "explanation": {
        "en": [
          "For high-performance, mission-critical workloads like SAP HANA, using EBS Provisioned IOPS SSD (io1) or General Purpose SSD (gp2, gp3) is recommended. These types of EBS volumes provide high performance, low latency and consistent I/O operations per second (IOPS) performance. The io1 volume type also allows you to specify a number of IOPS to be provisioned with the volume.\n\nAmazon S3 is an object storage service and not suitable for use as a storage solution for SAP HANA data and log volumes.\n\nAmazon Elastic File System (Amazon EFS) is a file storage service and also not suitable for use as a storage solution for SAP HANA data and log volumes.\n\nAmazon Elastic Block Store (Amazon EBS) Throughput Optimized HDD (st1) is a low-cost storage option for large, throughput-intensive workloads like big data and data warehousing, but it is not recommended for performance-critical applications like SAP HANA."
        ],
        "isTranslating": false,
        "ja": "SAP HANAのような高性能でミッションクリティカルなワークロードには、EBS Provisioned IOPS SSD（io1）または General Purpose SSD（gp2、gp3）を使用することが推奨されます。\nこれらのEBSボリュームは、高性能、低レイテンシー、一定のI/O操作毎秒（IOPS）パフォーマンスを提供します。\nio1ボリュームタイプでは、ボリュームにプロビジョニングされるIOPSの数を指定することもできます。\n\nAmazon S3はオブジェクトストレージサービスであり、SAP HANAのデータおよびログボリュームのストレージソリューションとしては適していません。\n\nAmazon Elastic File System（Amazon EFS）はファイルストレージサービスであり、SAP HANAのデータおよびログボリュームのストレージソリューションとしては適していません。\n\nAmazon Elastic Block Store（Amazon EBS）Throughput Optimized HDD（st1）は、ビッグデータやデータウェアハウジングなどの大規模でスループットに関するワークロードの低コストなストレージオプションであり、SAP HANAのようなパフォーマンス重視のアプリケーションには推奨されません。"
      },
      "corrects": [2, 5],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company has deployed a highly available SAP NetWeaver system on SAP HANA into a VPC. The system is distributed across multiple Availability Zones within a single AWS Region. SAP NetWeaver is running on SUSE Linux Enterprise Server for SAP. SUSE Linux Enterprise High Availability Extension is configured to protect SAP ASCS and ERS instances and uses the overlay IP address concept. The SAP shared files /sapmnt and /usr/sap/trans are hosted on an Amazon Elastic File System (Amazon EFS) file system.The company needs a solution that uses already-existing private connectivity to the VPC. The SAP NetWeaver system must be accessible through the SAP GUI client tool.Which solutions will meet these requirements? (Choose two.)"
        ],
        "isTranslating": false,
        "ja": "この企業は、SAP HANA 上の高可用性の SAP NetWeaver システムを VPC 上に展開しています。\n\nこのシステムは、単一の AWS リージョン内の複数のアベイラビリティゾーンに分散しています。\n\nSAP NetWeaver は、SAP 用の SUSE Linux Enterprise Server 上で実行されています。\n\nSUSE Linux Enterprise High Availability Extension が SAP ASCS および ERS インスタンスを保護するように構成され、オーバーレイ IP アドレスのコンセプトを使用しています。\n\nSAP 共有ファイル `/sapmnt` および `/usr/sap/trans` は、Amazon Elastic File System（Amazon EFS）ファイルシステムにホストされています。\n\n企業は、VPC への既存のプライベート接続を使用するソリューションが必要です。\n\nSAP NetWeaver システムは SAP GUI クライアントツールを介してアクセス可能である必要があります。\n\nこれらの要件を満たすソリューションはどれでしょうか？"
      },
      "choices": [
        {
          "en": "Deploy an Application Load Balancer. Configure the overlay IP address as a target.",
          "isTranslating": false,
          "ja": "Application Load Balancer をデプロイします。\nオーバーレイ IP アドレスをターゲットとして設定します。"
        },
        {
          "en": "Deploy a Network Load Balancer. Configure the overlay IP address as a target.",
          "isTranslating": false,
          "ja": "Network Load Balancer を展開します。\nオーバーレイ IP アドレスをターゲットとして構成します。"
        },
        {
          "en": "Use an Amazon Route 53 private zone. Create an A record that has the overlay IP address as a target.",
          "isTranslating": false,
          "ja": "Amazon Route 53 のプライベートゾーンを使用します。\nオーバーレイIPアドレスをターゲットとして持つ A レコードを作成します。"
        },
        {
          "en": "Use AWS Transit Gateway. Configure the overlay IP address as a static route in the transit gateway route table. Specify the VPC as a target.",
          "isTranslating": false,
          "ja": "AWS Transit Gateway を使用し、トランジットゲートウェイのルートテーブルにオーバーレイ IP アドレスを静的ルートとして設定します。\nターゲットには VPC を指定します。"
        },
        {
          "en": "Use a NAT gateway. Configure the overlay IP address as a target.",
          "isTranslating": false,
          "ja": "NAT ゲートウェイを使用します。\nオーバーレイ IP アドレスをターゲットとして設定します。"
        }
      ],
      "explanation": {
        "en": [
          "Option B: Deploying a Network Load Balancer is an appropriate solution because it provides a highly available and scalable solution for distributing incoming network traffic to the overlay IP address of the SAP NetWeaver system. The overlay IP address can be configured as a target for the Network Load Balancer, allowing the SAP GUI client tool to access the system through the load balancer.\n\nOption D: Using AWS Transit Gateway is also an appropriate solution because it provides a scalable and highly available solution for routing traffic between the company's VPC and the local network. By configuring the overlay IP address as a static route in the transit gateway route table and specifying the VPC as a target, the SAP NetWeaver system can be accessed through the SAP GUI client tool using the existing private connectivity to the VPC.\n\nBoth Network Load Balancer and AWS Transit Gateway provide a solution that uses existing private connectivity to the VPC and provides access to the SAP NetWeaver system through the SAP GUI client tool.\n\nhttps://docs.aws.amazon.com/sap/latest/sap-hana/sap-oip-sap-on-aws-high-availability-setup.html"
        ],
        "isTranslating": false,
        "ja": "### B\nネットワークロードバランサーのデプロイは、SAP NetWeaverシステムのオーバーレイIPアドレスに対して、受信ネットワークトラフィックを配布するための高可用性でスケーラブルなソリューションを提供するため、適切な解決策です。\nSAP GUI クライアントツールを介してロードバランサーを介してシステムにアクセスできるように、オーバーレイ IP アドレスをネットワークロードバランサーのターゲットとして構成することができます。\n\n### D\nAWS Transit Gateway を使用することも適切な解決策です。\nこれは、企業の VPC とローカルネットワーク間のトラフィックをルーティングするためのスケーラブルで高可用性なソリューションを提供し、トランジットゲートウェイルートテーブルにオーバーレイIPアドレスを静的ルートとして構成し、VPC をターゲットとして指定することにより、SAP GUI クライアントツールを介して SAP NetWeaver システムにアクセスすることができます。\n\nNetwork Load Balancer と AWS Transit Gateway は、VPC への既存のプライベート接続を使用し、SAP GUIクライアントツールを介した SAP NetWeaver システムへのアクセスを提供する解決策を提供します。\n\nhttps://docs.aws.amazon.com/sap/latest/sap-hana/sap-oip-sap-on-aws-high-availability-setup.html"
      },
      "corrects": [2, 4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is planning to move all its SAP applications to Amazon EC2 instances in a VPC. Recently, the company signed a multiyear contract with a payroll software-as-a-service (SaaS) provider. Integration with the payroll SaaS solution is available only through public web APIs.Corporate security guidelines state that all outbound traffic must be validated against an allow list. The payroll SaaS provider provides only fully qualified domain name (FQDN) addresses and no IP addresses or IP address ranges. Currently, an on-premises firewall appliance filters FQDNs. The company needs to connect an SAP Process Orchestration (SAP PO) system to the payroll SaaS provider.What must the company do on AWS to meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "ある企業は、すべてのSAPアプリケーションをAmazon EC2インスタンスでのVPCへ移行する計画を立てています。\n\n最近、企業は賃金ソフトウェアサービスプロバイダーとの複数年契約に署名しました。\n\n給与 SaaS ソリューションとの統合は、パブリック Web API を介してのみ利用可能です。\n\n企業のセキュリティガイドラインは、すべてのアウトバウンドトラフィックを許可リストに対して検証する必要があります。\n\n給与 SaaS プロバイダーからは、IP アドレスや IP アドレス範囲ではなく、完全修飾ドメイン名（FQDN）アドレスのみが提供されています。\n\n現在、オンプレミスのファイアウォールアプライアンスが FQDN をフィルタリングしています。\n\n企業は SAP プロセスオーケストレーション（SAP PO）システムを給与 SaaS プロバイダーに接続する必要があります。\n\n企業はAWSでどのようなことを行う必要がありますか？"
      },
      "choices": [
        {
          "en": "Add an outbound rule to the security group of the SAP PO system to allow the FQDN of the payroll SaaS provider and deny all other outbound traffic.",
          "isTranslating": false,
          "ja": "SAP PO システムのセキュリティグループに、給与 SaaS プロバイダーの FQDN を許可するアウトバウンドルールを追加し、その他のアウトバウンドトラフィックをすべて拒否してください。"
        },
        {
          "en": "Add an outbound rule to the network ACL of the subnet that contains the SAP PO system to allow the FQDN of the payroll SaaS provider and deny all other outbound traffic.",
          "isTranslating": false,
          "ja": "SAP PO システムが含まれるサブネットのネットワーク ACL に対して、給与 SaaS プロバイダーの FQDN を許可する出口ルールを追加し、その他のすべての出口トラフィックを拒否してください。"
        },
        {
          "en": "Add an AWS WAF web ACL to the VPAdd an outbound rule to allow the SAP PO system to connect to the FQDN of the payroll SaaS provider.",
          "isTranslating": false,
          "ja": "SAP PO システムが給与 SaaS プロバイダーの完全修飾ドメイン名 (FQDN) に接続できるようにするため、AWS WAF ウェブ ACL を VPC に追加し、アウトバウンドルールを追加します。"
        },
        {
          "en": "Add an AWS Network Firewall firewall to the VPC. Add an outbound rule to allow the SAP PO system to connect to the FQDN of the payroll SaaS provider.",
          "isTranslating": false,
          "ja": "VPC に AWS Network Firewall ファイアウォールを追加してください。\n\n給与 SaaS プロバイダの FQDN への SAP PO システムの接続を許可するために、アウトバウンドルールを追加してください。"
        }
      ],
      "explanation": {
        "en": [
          "FQDN filtering can be achieved only through Firewall https://aws.amazon.com/blogs/security/use-aws-network-firewall-to-filter-outbound-https-traffic-from-applications-hosted-on-amazon-eks/"
        ],
        "isTranslating": false,
        "ja": "FQDN フィルタリングは、ファイアウォールを通じてのみ実現することができます。\n\nhttps://aws.amazon.com/blogs/security/use-aws-network-firewall-to-filter-outbound-https-traffic-from-applications-hosted-on-amazon-eks/"
      },
      "corrects": [4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is planning to migrate its on-premises SAP application to AWS. The application runs on VMware vSphere. The SAP ERP Central Component (SAP ECC) server runs on an IBM Db2 database that is 2 TB in size. The company wants to migrate the database to SAP HANA.Which migration strategy will meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "ある企業は、オンプレミスの SAP アプリケーションを AWS に移行することを計画しています。アプリケーションは VMware vSphere 上で動作しています。\n\nSAP ERP Central Component（SAP ECC）サーバは、サイズが 2 TB の IBM Db2データベース上に実行されています。\n\n企業は、データベースを SAP HANA に移行したいと考えています。\n\nこれらの要件を満たす移行戦略は何でしょうか？"
      },
      "choices": [
        {
          "en": "Use AWS Application Migration Service (CloudEndure Migration).",
          "isTranslating": false,
          "ja": "AWS Application Migration Service (CloudEndure Migration)を使用します。"
        },
        {
          "en": "Use SAP Software Update Manager (SUM) Database Migration Option (DMO) with System Move.",
          "isTranslating": false,
          "ja": "システム移行に SAP Software Update Manager（SUM）Database Migration Option（DMO）を使用します。"
        },
        {
          "en": "Use AWS Server Migration Service (AWS SMS).",
          "isTranslating": false,
          "ja": "AWS Server Migration Service (AWS SMS)を使用します。"
        },
        {
          "en": "Use AWS Database Migration Service (AWS DMS).",
          "isTranslating": false,
          "ja": "AWS Database Migration Service (AWS DMS) を使用します。"
        }
      ],
      "explanation": {
        "en": [
          "SAP Software Update Manager (SUM) is a tool that provides a database migration option (DMO) to perform database migrations between different databases. The System Move option of DMO enables migrations of SAP systems between different hardware and operating system platforms, including migrations from VMware vSphere to SAP HANA on AWS. This migration strategy will allow the company to migrate their on-premises SAP ECC database to SAP HANA in AWS while ensuring compatibility and data consistency, meeting the requirements of the company."
        ],
        "isTranslating": false,
        "ja": "SAPソフトウェアアップデートマネージャー（SUM）は、異なるデータベース間のデータベース移行を実行するためのデータベース移行オプション（DMO）を提供するツールです。\nDMOのSystem Moveオプションは、異なるハードウェアおよびオペレーティングシステムプラットフォーム間のSAPシステムの移行を可能にします。これには、VMware vSphereからAWS上のSAP HANAへの移行も含まれます。\nこの移行戦略により、企業は、互換性とデータの整合性を確保しながら、オンプレミスのSAP ECCデータベースをAWS上のSAP HANAに移行することができ、企業の要件を満たすことができます。\n\n[Michinosuke Memo]\n正解はA。\nAWS Application Migration Service（以下、MGN） は、ソースサーバーを物理インフラストラクチャ、仮想インフラストラクチャ、およびクラウドインフラストラクチャから AWS でネイティブに実行するように自動的に変換することにより、時間のかかる、エラーが発生しやすい手動プロセスを最小限に抑えます。\nまた、移行検証期間中は、 移行元のソースサーバーを継続的にレプリケートするため、パフォーマンスへの影響はほとんどないか、まったくありません。また、通常通りの本番稼働をしたままで問題ありません。 レプリケートされた環境で、十分な動作検証が終わると、本番環境を切り替えして、移行元のソースサーバを停止しましょう。\nAWS MGN は、CloudEndure Migration と同様の機能を提供しますが、AWS マネジメントコンソールで利用できます。そのため、AWS CloudTrail、Amazon CloudWatch、AWS Identity and Access Management (IAM) など他の AWS サービスと統合的に利用できます。\n・サーバにエージェントをインストールできない、またはシステム要件にてインストールしたくない場合⇒AWS Server Migration Service (AWS SMS) の利用を検討お願いします。\n・ご希望の利用リージョンや、移行対象のOSがMGNでサポート対象外の場合⇒CloudEndure Migrationの利用を検討お願いします。\nhttps://www.sunnycloud.jp/column/20210524-01/\n\nBは不正解です。SUM DMOは、AnyDBデータベースからAWS上のSAP HANAに移行する機能です。AnyDBとは、SAP社がサポートするSAP HANA以外のソース・データベース(DB2、Oracle、SQL Serverなど)を指します。設問のIBM Db2はサポート対象であり、AnyDBでは無いため、間違いです。\nCは不正解です。AWS SMSは、2022年3月31日に終了予定です。その後は AWS MGN を使用推奨とされています。SMSが選択肢になるのは、サーバにエージェントをインストールできない時です。\nDは不正解です。AWS DMSは、SAP HANAをサポートしていません。SAP Adaptive Server Enterprise (ASE)はサポートされています。"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company hosts multiple SAP applications on Amazon EC2 instances in a VPC. While monitoring the environment, the company notices that multiple port scans are attempting to connect to SAP portals inside the VPC. These port scans are originating from the same IP address block. The company must deny access to the VPC from all the offending IP addresses for the next 24 hours.Which solution will meet this requirement?"
        ],
        "isTranslating": false,
        "ja": "ある会社は、Amazon EC2インスタンス内のVPCに複数のSAPアプリケーションをホストしています。\n\n環境を監視していると、同じIPアドレスブロックから発信された複数のポートスキャンがVPC内のSAPポータルに接続しようとしていることに気付きました。\n\n会社は、次の24時間、問題のIPアドレスからVPCへのアクセスを拒否する必要があります。\n\nこの要件を満たすためには、どのような解決策を導入すればよいですか？"
      },
      "choices": [
        {
          "en": "Modify network ACLs that are associated with all public subnets in the VPC to deny access from the IP address block.",
          "isTranslating": false,
          "ja": "VPC に関連するすべてのパブリックサブネットに関連するネットワーク ACL を修正し、IP アドレスブロックからのアクセスを拒否します。"
        },
        {
          "en": "Add a rule in the security group of the EC2 instances to deny access from the IP address block.",
          "isTranslating": false,
          "ja": "EC2 インスタンスのセキュリティグループに、特定の IP アドレスからのアクセスを拒否するルールを追加してください。"
        },
        {
          "en": "Create a policy in AWS Identity and Access Management (IAM) to deny access from the IP address block.",
          "isTranslating": false,
          "ja": "AWS Identity and Access Management（IAM）で IP アドレスブロックからのアクセスを拒否する方針を作成してください。"
        },
        {
          "en": "Configure the firewall in the operating system of the EC2 instances to deny access from the IP address block.",
          "isTranslating": false,
          "ja": "EC2 インスタンスのオペレーティングシステムでファイアウォールを設定し、IP アドレスブロックからのアクセスを拒否するようにしてください。"
        }
      ],
      "explanation": {
        "en": [
          "A Network Access Control List (ACL) is a stateful firewall that controls traffic at the subnet level. By modifying the network ACLs that are associated with all the public subnets in the VPC, the company can deny access to the VPC from the IP address block. This will help protect the SAP portals inside the VPC.\n\nA security group acts as a firewall at the instance level. By adding a rule to the security group of the EC2 instances, the company can control inbound traffic to the instances and deny access from the IP address block. This will prevent unauthorized access to the SAP applications hosted on the instances."
        ],
        "isTranslating": false,
        "ja": "ネットワークアクセス制御リスト（ACL）は、サブネットレベルでトラフィックを制御するステートフルファイアウォールです。 \n\nVPCのすべてのパブリックサブネットに関連付けられているネットワークACLを変更することにより、企業は IP アドレスブロックから VPC へのアクセスを拒否できます。これにより、VPC 内の SAP ポータルを保護することができます。\n\nセキュリティグループはインスタンスレベルでファイアウォールとして機能します。 \n\nEC2 インスタンスのセキュリティグループにルールを追加することで、企業はインスタンスへのインバウンドトラフィックを制御し、IP アドレスブロックからのアクセスを拒否できます。\n\nこれにより、インスタンス上でホストされているSAPアプリケーションへの不正アクセスを防止できます。"
      },
      "corrects": [1],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company has deployed SAP workloads on AWS. The AWS Data Provider for SAP is installed on the Amazon EC2 instance where the SAP application is running. An SAP solutions architect has attached an IAM role to the EC2 instance with the following policy:",
          "",
          "",
          "The AWS Data Provider for SAP is not returning any metrics to the SAP application.Which change should the SAP solutions architect make to the IAM permissions to resolve this issue?"
        ],
        "isTranslating": false,
        "ja": "ある企業は、SAP ワークロードを AWS 上に展開しています。\n\nSAP アプリケーションが実行されている Amazon EC2 インスタンスには、AWS Data Provider for SAP がインストールされています。\n\nSAP ソリューションアーキテクトは、EC2 インスタンスに IAM ロールをアタッチし、次のポリシーを設定しました。\n\n```json\n{\n  \"Version\":\"2012-10-17\",\n  \"Statement\":[\n    {\n      \"Effect\":\"Allow\",\n      \"Action\":[\n        \"cloudwatch:PutMetricData\"\n      ],\n      \"Resource\":\"*\"\n    }\n  ]\n}\n```\n\nしかし、AWS Data Provider for SAPは、SAPアプリケーションにメトリクスを返していません。\n\nSAPソリューションアーキテクトは、この問題を解決するために、IAM権限にどのような変更を加えるべきでしょうか？"
      },
      "choices": [
        {
          "en": "Add the cloudwatch:ListMetrics action to the policy statement with Sid AWSDataProvider1.",
          "isTranslating": false,
          "ja": "`AWSDataProvider1` の Sid を持つポリシー文に、`cloudwatch:ListMetrics` アクションを追加します。"
        },
        {
          "en": "Add the cloudwatch:GetMetricStatistics action to the policy statement with Sid AWSDataProvider1.",
          "isTranslating": false,
          "ja": "Sid `AWSDataProvider1` を持つポリシーステートメントに、`cloudwatch:GetMetricStatistics` のアクションを追加します。"
        },
        {
          "en": "Add the cloudwatch:GetMetricStream action to the policy statement with Sid AWSDataProvider1.",
          "isTranslating": false,
          "ja": "`AWSDataProvider1` のSIDを持つポリシー文に、`cloudwatch:GetMetricStream` アクションを追加します。"
        },
        {
          "en": "Add the cloudwatch:DescribeAlarmsForMetric action to the policy statement with Sid AWSDataProvider1.",
          "isTranslating": false,
          "ja": "`AWSDataProvider1` という Sid を持つポリシー文に、`cloudwatch:DescribeAlarmsForMetric` アクションを追加してください。"
        }
      ],
      "explanation": {
        "en": [
          "The AWS Data Provider for SAP uses Amazon CloudWatch to retrieve and return metrics to the SAP application. In order to retrieve metrics, the IAM role must have the appropriate CloudWatch actions enabled in the policy. The action \"GetMetricStatistics\" is the action required to retrieve metric data from CloudWatch. By adding this action to the IAM role's policy statement with Sid \"AWSDataProvider\", the AWS Data Provider for SAP will be able to retrieve and return metrics to the SAP application, resolving the issue.\n\nhttps://docs.aws.amazon.com/sap/latest/general/data-provider-troubleshooting.html"
        ],
        "isTranslating": false,
        "ja": "SAP 用の AWS Data Provider は Amazon CloudWatch を利用して SAP アプリケーションにメトリクスを返します。\n\nしかし、それを取得するには、IAM ロールには適切な CloudWatch アクションがポリシーで有効化されている必要があります。\n\n`GetMetricStatistics` アクションは、CloudWatch からメトリックデータを取得するために必要なアクションです。\n\nこのアクションをIAMロールのポリシーの `AWSDataProvider` SID に追加することで、AWS データプロバイダーはSAPアプリケーションにメトリクスを取得および返却することができ、問題が解決されます。\n\nhttps://docs.aws.amazon.com/sap/latest/general/data-provider-troubleshooting.html"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company wants to deploy an SAP HANA database on AWS by using AWS Launch Wizard for SAP. An SAP solutions architect needs to run a custom post-deployment script on the Amazon EC2 instance that Launch Wizard provisions.Which actions can the SAP solutions architect take to provide the post-deployment script in the Launch Wizard console? (Choose two.)"
        ],
        "isTranslating": false,
        "ja": "SAP のソリューションアーキテクトは、AWS Launch Wizard for SAP を使用して AWS 上に SAP HANA データベースを展開したいと考えています。\n\nSAP のソリューションアーキテクトは、Launch Wizard によってプロビジョニングされた Amazon EC2 インスタンスでカスタムポストデプロイメントスクリプトを実行する必要があります。\n\nSAP のソリューションアーキテクトが Launch Wizard コンソールでポストデプロイメントスクリプトを提供するために取れる行動はどれですか？"
      },
      "choices": [
        {
          "en": "Provide the FTP URL of the script.",
          "isTranslating": false,
          "ja": "スクリプトの FTP URLを提供します。"
        },
        {
          "en": "Provide the HTTPS URL of the script on a web server.",
          "isTranslating": false,
          "ja": "ウェブサーバー上のスクリプトの HTTPS URL を提供します。"
        },
        {
          "en": "Provide the Amazon S3 URL of the script.",
          "isTranslating": false,
          "ja": "スクリプトの Amazon S3 の URL を提供します。"
        },
        {
          "en": "Write the script inline.",
          "isTranslating": false,
          "ja": "スクリプトをインラインに記述します。"
        },
        {
          "en": "Upload the script.",
          "isTranslating": false,
          "ja": "スクリプトをアップロードします。"
        }
      ],
      "explanation": {
        "en": [
          "S3 and upload\n\nhttps://catalog.us-east-1.prod.workshops.aws/workshops/754ba343-2704-404a-8abe-be7b21c4d9d5/en-US/800-other/802-prepostscript"
        ],
        "isTranslating": false,
        "ja": "S3とアップロード\n\nhttps://catalog.us-east-1.prod.workshops.aws/workshops/754ba343-2704-404a-8abe-be7b21c4d9d5/en-US/800-other/802-prepostscript"
      },
      "corrects": [3, 5],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is planning to move its on-premises SAP HANA database to AWS. The company needs to migrate this environment to AWS as quickly as possible. An SAP solutions architect will use AWS Launch Wizard for SAP to deploy this SAP HANA workload.Which combination of steps should the SAP solutions architect follow to start the deployment of this workload on AWS? (Choose three.)"
        ],
        "isTranslating": false,
        "ja": "ある会社は、オンプレミスの SAP HANA データベースを AWS に移行する計画を立てています。\n\nこの環境をできるだけ早く AWS に移行す必要があります。\n\nSAP ソリューションアーキテクトは、AWS Launch Wizard for SAP を使用して、この SAP HANA ワークロードを展開することになりました。\n\nSAP ソリューションアーキテクトが、このワークロードを AWS 上に展開するために、どのステップの組み合わせを実行する必要があるでしょうか？"
      },
      "choices": [
        {
          "en": "Download the SAP HANA software.",
          "isTranslating": false,
          "ja": "SAP HANA ソフトウェアをダウンロードします。"
        },
        {
          "en": "Download the AWS CloudFormation template for the SAP HANA deployment.",
          "isTranslating": false,
          "ja": "SAP HANA の展開に必要な AWS CloudFormation テンプレートをダウンロードします。"
        },
        {
          "en": "Download and extract the SAP HANA software. Upload the SAP HANA software to an FTP server that Launch Wizard can access.",
          "isTranslating": false,
          "ja": "SAP HANA ソフトウェアをダウンロードして抽出します。Launch Wizard がアクセスできる FTP サーバーに SAP HANA ソフトウェアをアップロードします。"
        },
        {
          "en": "Upload the unextracted SAP HANA software to an Amazon S3 destination bucket. Follow the S3 file path syntax for the software in accordance with Launch Wizard recommendations.",
          "isTranslating": false,
          "ja": "Launch Wizard の推奨に従い、未解凍の SAP HANA ソフトウェアを Amazon S3 の宛先バケットにアップロードしてください。ソフトウェアの S3 ファイルパス構文に従ってください。"
        },
        {
          "en": "Bring the operating system AMI by using the Bring Your Own Image (BYOI) model, or purchase the subscription for the operating system AMI from AWS Marketplace.",
          "isTranslating": false,
          "ja": "Bring Your Own Image（BYOI）モデルを使用してオペレーティングシステム AMI を持参するか、AWS Marketplace からオペレーティングシステム AMI のサブスクリプションを購入してください。"
        },
        {
          "en": "Create the SAP file system by using Amazon Elastic Block Store (Amazon EBS) before the deployment.",
          "isTranslating": false,
          "ja": "展開する前に、Amazon Elastic Block Store (Amazon EBS) を使用して SAP ファイルシステムを作成します。"
        }
      ],
      "explanation": {
        "en": [
          "https://docs.aws.amazon.com/launchwizard/latest/userguide/launch-wizard-sap-setting-up.html\nhttps://docs.aws.amazon.com/launchwizard/latest/userguide/launch-wizard-sap-structure.html"
        ],
        "isTranslating": false,
        "ja": "以下の2つのリンクはAWS Launch Wizard for SAPに関するものです。\n\nこの記事は、AWS Launch Wizardを使用してSAPアプリケーションを展開するために必要な前提条件について説明しています。以下の前提条件を満たす必要があります。\n\nAWS VPCを作成し、少なくとも2つのアベイラビリティーゾーンにあるプライベートサブネットで構成する必要があります。これらのサブネットは、アウトバウンドインターネットアクセスが必要です。\nAmazon VPC User Guideの「Amazon VPCのはじめに」を参照して、VPCを作成および設定する方法の詳細については、「Amazon VPCのはじめに」を参照してください。\nユーザーまたはロールを作成し、AmazonLaunchWizard_Fullaccessポリシーを添付する必要があります。ポリシーをユーザーまたはロールに添付する手順については、次のセクションを参照してください。\nカスタムの事前および事後構成デプロイメントスクリプトを実行するには、AmazonEC2RoleForLaunchWizardロールにAdd permissions to run custom pre- and post-deployment configuration scriptsにリストされている権限を追加する必要があります。\nSAP HANAデータベースをインストールする場合は、SAP Software Downloadページからソフトウェアをダウンロードして、Amazon S3バケットにアップロードする必要があります。ソフトウェアをダウンロードし、Amazon S3バケットにアップロードする手順については、「Make SAP HANA software available for AWS Launch Wizard to deploy a HANA database」を参照してください。\nSAP展開に使用するオペレーティングシステムバージョンに応じて、SAP Marketplaceのサブスクリプションが必要な場合があります。サポートされているすべてのオペレーティングシステムバージョンの完全なリストについては、「Operating systems」を参照してください。\n\nhttps://docs.aws.amazon.com/launchwizard/latest/userguide/launch-wizard-sap-setting-up.html\n\nhttps://docs.aws.amazon.com/launchwizard/latest/userguide/launch-wizard-sap-structure.html\n\nAWS Launch Wizardは、SAPシステムのプロビジョニングとデプロイメントを自動化するためのサービスです。上記のリンクは、AWS Launch Wizard for SAPの設定と構成に関する情報を提供します。"
      },
      "corrects": [1, 4, 5],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company wants to implement SAP HANA on AWS with the Multi-AZ deployment option by using AWS Launch Wizard for SAP. The solution will use SUSE Linux Enterprise High Availability Extension for the high availability deployment. An SAP solutions architect must ensure that all the prerequisites are met. The SAP solutions architect also must ensure that the user inputs to start the guided deployment of Launch Wizard are valid.Which combination of steps should the SAP solutions architect take to meet these requirements? (Choose two.)"
        ],
        "isTranslating": false,
        "ja": "ある企業が、AWS Launch Wizard for SAP を使用して、Multi-AZ 展開オプションを使用し、SAP HANA を AWS 上に実装したいと考えています。\n\nこの解決策には、高可用性展開のために SUSE Linux Enterprise High Availability Extension が使用されます。\n\nSAP ソリューションアーキテクトは、前提条件がすべて満たされていることを確認する必要があります。\n\nまた、SAP ソリューションアーキテクトは、Launch Wizard のガイド付き展開を開始するためのユーザー入力が有効であることを確認する必要があります。\n\nこれらの要件を満たすために、SAP ソリューションアーキテクトが実行する必要がある手順の組み合わせはどれですか？"
      },
      "choices": [
        {
          "en": "Before starting the Launch Wizard deployment, create the underlying Amazon Elastic Block Store (Amazon EBS) volume types to use for SAP HANA data and log volumes based on the performance requirements.",
          "isTranslating": false,
          "ja": "Launch Wizard デプロイメントを開始する前に、パフォーマンス要件に基づいて SAP HANA データおよびログのボリュームに使用する Amazon Elastic Block Store（Amazon EBS）ボリュームタイプを作成します。"
        },
        {
          "en": "Use a value for the PaceMakerTag parameter that is not used by any other Amazon EC2 instances in the AWS Region where the system is being deployed.",
          "isTranslating": false,
          "ja": "システムを展開する AWS リージョン内で他の Amazon EC2 インスタンスで使用されていない `PaceMakerTag` パラメータの値を使用します。"
        },
        {
          "en": "Ensure that the virtual hostname for the SAP HANA database that is used for the SUSE Linux Enterprise High Availability Extension configuration is not used in any other deployed accounts.",
          "isTranslating": false,
          "ja": "SUSE Linux Enterprise High Availability Extension の構成に使用される SAP HANA データベースの仮想ホスト名が他のデプロイ済みアカウントで使用されていないことを確認します。"
        },
        {
          "en": "Ensure that the VirtuallPAddress parameter is outside the VPC CIDR and is not being used in the route table that is associated with the subnets where primary and secondary SAP HANA instances will be deployed.",
          "isTranslating": false,
          "ja": "`VirtuallPAddress` パラメータが VPC CIDR の外部にあり、主および副の SAP HANA インスタンスが展開されるサブネットに関連するルートテーブルで使用されていないことを確認します。"
        },
        {
          "en": "Before starting the Launch Wizard deployment, set up the SUSE Linux Enterprise High Availability Extension network configuration and security group.",
          "isTranslating": false,
          "ja": "Launch Wizard の展開を開始する前に、SUSE Linux Enterprise High Availability Extension ネットワーク構成とセキュリティグループを設定します。"
        }
      ],
      "explanation": {
        "en": [
          "In the document \"SAP HANA on the AWS Cloud Quick Start Reference Deployment\" (ARCHIVED) at the below URL, page 25, under \"Requirements for Multi-AZ, Single-Node HA Scenarios,\" you will find the following\n\nhttps://links.imagerelay.com/cdn/3404/ql/8327da608b7341f4ac2216c503116387/SAP-hana-on-AWS-cloud.pdf\n\nSLES HAE and RHEL High Availability agents require that the Pacemaker tag and the overlay IP address you provide by setting deployment parameters can be uniquely identified. Therefore, you need to ensure the following:\n\n– The value you provide for the PaceMakerTag parameter isn’t being used by any other EC2 instances in your account, in the AWS Region where you are deploying the Quick Start.\n– The IP address you provide for the VirtualIPAddress parameter is outside the VPC CIDR and isn’t being used in the route table associated with the subnets where primary and secondary HANA instances will be deployed."
        ],
        "isTranslating": false,
        "ja": "以下のURLの「SAP HANA on the AWS Cloud Quick Start Reference Deployment」（ARCHIVED）というドキュメントの25ページ、「Requirements for Multi-AZ, Single-Node HA Scenarios」の下に、次の内容が記載されています。\n\nhttps://links.imagerelay.com/cdn/3404/ql/8327da608b7341f4ac2216c503116387/SAP-hana-on-AWS-cloud.pdf\n\nSLES HAE および RHEL High Availability エージェントでは、デプロイメントパラメータを設定して提供される Pacemaker タグおよびオーバーレイ IP アドレスを一意に識別できる必要があります。\n\nそのため、次のことを確認する必要があります。\n\n- PaceMakerTag パラメータに提供する値が、Quick Start を展開する AWS リージョンの別の EC2 インスタンスで使用されていないこと\n- VirtualIPAddress パラメーターに提供する IP アドレスが、VPC CIDR の範囲外にあり、主およびセカンダリの HANA インスタンスが展開されるサブネットに関連付けられたルートテーブルで使用されていないこと"
      },
      "corrects": [2, 4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company that has SAP workloads on premises plans to migrate an SAP environment to AWS. The company is new to AWS and has no prior setup. The company has the following requirements:The application server and database server must be placed in isolated network configurations.SAP systems must be accessible to the on-premises end users over the internet.The cost of communications between the application server and the database server must be minimized.Which combination of steps should an SAP solutions architect take to meet these requirements? (Choose two.)"
        ],
        "isTranslating": false,
        "ja": "オンプレミスでSAPワークロードを持つ企業は、SAP環境をAWSに移行する予定です。\n\n同社はAWSの利用が初めてであり、先行セットアップはありません。\n\n同社には以下の要件があります。\n\n- アプリケーションサーバーとデータベースサーバーは、分離されたネットワーク構成に配置する必要があります。\n- SAPシステムはオンプレミスのエンドユーザーにインターネット経由でアクセス可能である必要があります。\n- アプリケーションサーバーとデータベースサーバー間の通信コストを最小限に抑える必要があります。\n\n以上の要件を満たすために、SAPソリューションアーキテクトが取るべき手順の組み合わせはどれですか？"
      },
      "choices": [
        {
          "en": "Configure a Network Load Balancer for incoming connections from end users.",
          "isTranslating": false,
          "ja": "エンドユーザーからの入力接続のために、Network Load Balancer を構成します。"
        },
        {
          "en": "Set up an AWS Site-to-Site VPN connection between the company’s on-premises network and AWS.",
          "isTranslating": false,
          "ja": "会社のオンプレミスネットワークと AWS 間で AWS Site-to-Site VPN 接続を設定します。"
        },
        {
          "en": "Separate the application server and the database server by using different VPCs.",
          "isTranslating": false,
          "ja": "アプリケーションサーバーとデータベースサーバーを別々の VPC で分離してください。"
        },
        {
          "en": "Separate the application server and the database server by using different subnets and network security groups within the same VPC.",
          "isTranslating": false,
          "ja": "同一の VPC 内に異なるサブネットとネットワークセキュリティグループを使用して、アプリケーションサーバーとデータベースサーバーを分離してください。"
        },
        {
          "en": "Set up an AWS Direct Connect connection with a private VIF between the company’s on-premises network and AWS.",
          "isTranslating": false,
          "ja": "企業のオンプレミス・ネットワークと AWS の間にプライベートVIFを用いた AWS Direct Connect 接続を設定します。"
        }
      ],
      "explanation": {
        "en": [
          "By using a Site-to-Site VPN, the company's on-premises network and AWS environment can securely communicate and end users can access the SAP systems over the internet. By using different subnets and network security groups, the application and database servers are isolated in their own network configurations, which can minimize communication costs between the two."
        ],
        "isTranslating": false,
        "ja": "「サイト間 VPN（Virtual Private Network）」を使用することで、企業のオンプレミス（社内）ネットワークとAWS環境が安全に通信でき、エンドユーザーはインターネット経由でSAPシステムにアクセスできます。\n\nまた、異なるサブネットとネットワークセキュリティグループを使用することで、アプリケーションとデータベースサーバーはそれぞれ独自のネットワーク構成で隔離され、両方の間の通信コストを最小限に抑えることができます。"
      },
      "corrects": [2, 4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is running its SAP workload on AWS. The company’s security team has implemented the following requirements:All Amazon EC2 instances for SAP must be SAP certified instance types.Encryption must be enabled for all Amazon S3 buckets and Amazon Elastic Block Store (Amazon EBS) volumes.AWS CloudTrail must be activated.SAP system parameters must be compliant with business rules.Detailed monitoring must be enabled for all instances.The company wants to develop an automated process to review the systems for compliance with the security team’s requirements. The process also must provide notification about any deviation from these standards.Which solution will meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "ある会社は、SAPワークロードをAWS上で実行しています。同社のセキュリティチームは、以下の要件を実装しました。SAP用のすべてのAmazon EC2インスタンスは、SAP認定のインスタンスタイプである必要があります。すべてのAmazon S3バケットとAmazon Elastic Block Store (Amazon EBS)ボリュームには暗号化を有効にする必要があります。AWS CloudTrailを有効にする必要があります。SAPシステムのパラメータはビジネスルールに準拠する必要があります。すべてのインスタンスについて詳細な監視を有効にする必要があります。\n\n会社は、セキュリティチームの要件に対するシステムのコンプライアンスを自動的にレビューするプロセスを開発したいと考えています。このプロセスは、これらの基準からのどのような逸脱も通知する必要があります。どのソリューションがこれらの要件を満たすでしょうか？"
      },
      "choices": [
        {
          "en": "Use AWS AppConfig to model configuration data in an AWS Systems Manager Automation runbook. Schedule this Systems Manager Automation runbook to monitor for compliance with all the requirements. Integrate AWS AppConfig with Amazon CloudWatch for notification purposes.",
          "isTranslating": false,
          "ja": "AWS AppConfigを使用して、AWS Systems Manager Automationのランブックで構成データをモデル化してください。すべての要件の遵守を監視するために、このSystems Manager Automationのランブックをスケジュールしてください。通知の目的で、AWS AppConfigをAmazon CloudWatchと統合してください。"
        },
        {
          "en": "Use AWS Config managed rules to monitor for compliance with all the requirements. Use Amazon EventBridge (Amazon CloudWatch Events) and Amazon Simple Notification Service (Amazon SNS) for email notification when a resource is flagged as noncompliant.",
          "isTranslating": false,
          "ja": "すべての要件に準拠しているかどうかを監視するために AWS Config の管理ルールを使用します。また、Amazon EventBridge（Amazon CloudWatch Events）および Amazon Simple Notification Service（Amazon SNS）を使用して、リソースが非準拠としてフラグ付けされた場合にメール通知をお届けします。"
        },
        {
          "en": "Use AWS Trusted Advisor to monitor for compliance with all the requirements. Use Trusted Advisor preferences for email notification when a resource is flagged as noncompliant.",
          "isTranslating": false,
          "ja": "すべての要件に準拠しているかを監視するために、AWS Trusted Advisorを使用してください。リソースが非準拠としてフラグ付けされた場合には、メール通知のためにTrusted Advisorの設定を使用してください。"
        },
        {
          "en": "Use AWS Config managed rules to monitor for compliance with the requirements, except for the SAP system parameters. Create AWS Config custom rules to validate the SAP system parameters. Use Amazon EventBridge (Amazon CloudWatch Events) and Amazon Simple Notification Service (Amazon SNS) for email notification when a resource is flagged as noncompliant.",
          "isTranslating": false,
          "ja": "AWS Configに標準管理ルールを使用して、SAPシステムパラメータを除く要件に対する遵守を監視します。AWS Configカスタムルールを作成して、SAPシステムパラメータの妥当性を検証します。Amazon EventBridge（Amazon CloudWatch Events）とAmazon Simple Notification Service（Amazon SNS）を使用して、リソースが非適合としてフラグ付けされた場合のメール通知を行います。"
        }
      ],
      "explanation": {
        "en": [
          "https://aws.amazon.com/blogs/awsforsap/audit-your-sap-systems-with-aws-config-part-i/\nhttps://aws.amazon.com/blogs/awsforsap/audit-your-sap-systems-with-aws-config-part-ii/"
        ],
        "isTranslating": false,
        "ja": "AWS Configを使用してSAPシステムを監査する際のベストプラクティスについて学ぶことができる、「AWS Configを使用してSAPシステムを監査する-Part I」と「AWS Configを使用してSAPシステムを監査する-Part II」の2つの記事が、AWSの公式ブログに投稿されました。この記事は、AWS Configを使用したSAPシステムの継続的監査の方法を説明しており、SAPシステムのトラブルシューティングやセキュリティ対策に役立ちます。"
      },
      "corrects": [4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is hosting its SAP workloads on AWS. An SAP solutions architect is designing high availability architecture for the company’s production SAP S/4HANA and SAP BW/4HANA workloads. These workloads have the following requirements:Redundant SAP application servers that consist of a primary application server (PAS) and an additional application server (AAS)ASCS and ERS instances that use a failover clusterDatabase high availability with a primary DB instance and a secondary DB instanceHow should the SAP solutions architect design the architecture to meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "ある企業はAWS上にSAPのワークロードをホスティングしています。SAPソリューションアーキテクトは、同社の生産SAP S / 4HANAおよびSAP BW / 4HANAのワークロード向けの高可用性アーキテクチャを設計しています。 これらのワークロードには、次の要件があります。\n- 主要なアプリケーションサーバー（PAS）と追加のアプリケーションサーバー（AAS）から構成される冗長なSAPアプリケーションサーバー\n- フェールオーバークラスタを使用するASCSおよびERSインスタンス。\n- プライマリDBインスタンスとセカンダリDBインスタンスによるデータベースの高可用性。\n\nこれらの要件を満たすために、SAPソリューションアーキテクトはどのようにアーキテクチャを設計すべきでしょうか？"
      },
      "choices": [
        {
          "en": "Deploy ASCS and ERS cluster nodes in different subnets within the same Availability Zone. Deploy the PAS instance and AAS instance in different subnets within the same Availability Zone. Deploy the primary DB instance and secondary DB instance in different subnets within the same Availability Zone. Deploy all the components in the same VPC.",
          "isTranslating": false,
          "ja": "同じアベイラビリティゾーン内の異なるサブネットにASCSおよびERSクラスターノードを展開します。同じアベイラビリティゾーン内の異なるサブネットにPASインスタンスとAASインスタンスを展開します。同じアベイラビリティゾーン内の異なるサブネットにプライマリDBインスタンスとセカンダリDBインスタンスを展開します。すべてのコンポーネントを同じVPC内に展開します。"
        },
        {
          "en": "Deploy ASCS and ERS cluster nodes in different subnets within the same Availability Zone. Deploy the PAS instance and AAS instance in different subnets within the same Availability Zone. Deploy the primary DB instance and secondary DB instance in different subnets within the same Availability Zone. Deploy the ASCS instance, PAS instance, and primary DB instance in one VPC. Deploy the ERS instance, AAS instance, and secondary DB instance in a different VPC.",
          "isTranslating": false,
          "ja": "同じアベイラビリティーゾーン内の異なるサブネットにASCSとERSクラスターノードを展開します。同じアベイラビリティーゾーン内の異なるサブネットにPASインスタンスとAASインスタンスを展開します。同じアベイラビリティーゾーン内の異なるサブネットにプライマリDBインスタンスとセカンダリDBインスタンスを展開します。ASCSインスタンス、PASインスタンス、およびプライマリDBインスタンスを同じVPCに展開します。ERSインスタンス、AASインスタンス、およびセカンダリDBインスタンスを別のVPCに展開します。"
        },
        {
          "en": "Deploy ASCS and ERS cluster nodes in different subnets across two Availability Zones. Deploy the PAS instance and AAS instance in different subnets across two Availability Zones. Deploy the primary DB instance and secondary DB instance in different subnets across two Availability Zones. Deploy all the components in the same VPC.",
          "isTranslating": false,
          "ja": "2つのアベイラビリティーゾーンにまたがる異なるサブネットに ASCS および ERS クラスターノードをデプロイします。また、2つのアベイラビリティーゾーンにまたがる異なるサブネットに PAS インスタンスと AAS インスタンスをデプロイします。さらに、2つのアベイラビリティーゾーンにまたがる異なるサブネットにプライマリ DB インスタンスとセカンダリ DB インスタンスをデプロイします。これらすべてのコンポーネントを同じ VPC にデプロイします。"
        },
        {
          "en": "Deploy ASCS and ERS cluster nodes in different subnets across two Availability Zones. Deploy the PAS instance and AAS instance in different subnets across two Availability Zones. Deploy the primary DB instance and secondary DB instance in different subnets across two Availability Zones. Deploy the ASCS instance, PAS instance, and primary DB instance in one VPC. Deploy the ERS instance, AAS instance, and secondary DB instance in a different VPC.",
          "isTranslating": false,
          "ja": "2つのアベイラビリティーゾーンに跨って、ASCSとERSクラスターノードを異なるサブネットに展開します。PASインスタンスとAASインスタンスを2つのアベイラビリティーゾーンにまたがる異なるサブネットに展開します。プライマリDBインスタンスとセカンダリDBインスタンスを異なるサブネットに跨って、2つのアベイラビリティーゾーンに展開します。ASCSインスタンス、PASインスタンス、およびプライマリDBインスタンスを同じVPCに展開します。ERSインスタンス、AASインスタンス、およびセカンダリDBインスタンスを別のVPCに展開します。"
        }
      ],
      "explanation": {
        "en": [
          "The SAP solutions architect should choose option C as this is the most effective way to meet the high availability requirements. Deploying components across different Availability Zones helps to ensure that the workloads are highly available even in the event of an Availability Zone failure. Additionally, deploying the primary and secondary components in different subnets across different Availability Zones provides the maximum resiliency. Furthermore, deploying all the components in the same VPC makes it easier to manage network communication and security for the SAP workloads."
        ],
        "isTranslating": false,
        "ja": "SAPのソリューションアーキテクトは、高可用性要件を満たす最も効果的な方法として、選択肢Cを選択するべきです。異なるアベイラビリティーゾーンにコンポーネントを展開することで、アベイラビリティーゾーンの障害が発生した場合でも、ワークロードが高可用性を維持できるようになります。さらに、プライマリとセカンダリのコンポーネントを異なるサブネットに跨いで異なるアベイラビリティーゾーンに展開することで、最大の弾力性を確保することができます。また、SAPのワークロードのネットワーク通信とセキュリティを管理する上でも、すべてのコンポーネントを同じVPCに展開することが容易になります。"
      },
      "corrects": [3],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company has deployed SAP HANA in the AWS Cloud. The company needs its SAP HANA database to be highly available. An SAP solutions architect has deployed the SAP HANA database in separate Availability Zones in a single AWS Region. SUSE Linux Enterprise High Availability Extension is configured with an overlay IP address. The overlay IP resource agent has the following IAM policy:",
          "",
          "",
          "",
          "During a test of failover, the SAP solutions architect finds that the overlay IP address does not change to the secondary Availability Zone.Which change should the SAP solutions architect make in the policy statement for Sid oip1 to fix this error?"
        ],
        "isTranslating": false,
        "ja": "ある企業がSAP HANAをAWSクラウドに展開しました。同社はSAP HANAデータベースを高可用性にする必要があります。SAPのソリューションアーキテクトは、単一のAWSリージョン内で別々のアベイラビリティーゾーンにSAP HANAデータベースを展開しました。また、SUSE Linux Enterprise High Availability ExtensionがオーバーレイIPアドレスで設定されています。オーバーレイIPリソースエージェントには、次のIAMポリシーが設定されています。\n\nテストフェイルオーバー中に、SAPソリューションアーキテクトは、オーバーレイIPアドレスがセカンダリアベイラビリティーゾーンに切り替わらないことがわかりました。このエラーを修正するために、SAPソリューションアーキテクトがSid oip1のポリシー文を変更するべき内容は何ですか？"
      },
      "choices": [
        {
          "en": "Change the Action element to ec2:CreateRoute.",
          "isTranslating": false,
          "ja": "Action要素をec2:CreateRouteに変更してください。"
        },
        {
          "en": "Change the Action element to ec2:ReplaceRoute.",
          "isTranslating": false,
          "ja": "Action要素をec2:ReplaceRouteに変更してください。"
        },
        {
          "en": "Change the Action element to ec2:ReplaceRouteTableAssociation.",
          "isTranslating": false,
          "ja": "Action要素をec2:ReplaceRouteTableAssociationに変更します。"
        },
        {
          "en": "Change the Action element to ec2:ReplaceTransitGatewayRoute.",
          "isTranslating": false,
          "ja": "Action要素をec2:ReplaceTransitGatewayRouteに変更してください。"
        }
      ],
      "explanation": {
        "en": [
          "https://docs.aws.amazon.com/sap/latest/sap-hana/sap-hana-on-aws-cluster-configuration-prerequisites.html\nhttps://docs.aws.amazon.com/sap/latest/sap-hana/sap-hana-on-aws-oip.html"
        ],
        "isTranslating": false,
        "ja": "このページは、AWS上でSAP HANAクラスターを構成する前提条件について説明しています。また、SAP HANAをAWS上でデプロイする際に必要な手順が記載されている「AWSにおけるSAP HANAにおけるインスタンス起動プロセス」に関するドキュメントへのリンクが含まれています。"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company wants to improve the RPO and RTO for its SAP disaster recovery (DR) solution by running the DR solution on AWS. The company is running SAP ERP Central Component (SAP ECC) on SAP HANA. The company has set an RPO of 15 minutes and an RTO of 4 hours.The production SAP HANA database is running on a physical appliance that has x86 architecture. The appliance has 1 TB of memory, and the SAP HANA global allocation limit is set to 768 GB. The SAP application servers are running as VMs on VMware, and they store data on an NFS file system. The company does not want to change any existing SAP HANA parameters that are related to data and log backup for its on-premises systems.What should an SAP solutions architect do to meet the DR objectives MOST cost-effectively?"
        ],
        "isTranslating": false,
        "ja": "ある企業が、AWS上でDRを実行することで、SAPの災害復旧（DR）ソリューションのRPOおよびRTOを改善したいと考えています。企業は、SAP HANA上でSAP ERP Central Component（SAP ECC）を実行しています。企業は、RPOを15分、RTOを4時間に設定しています。本番のSAP HANAデータベースは、x86アーキテクチャを持つ物理アプライアンス上で実行されています。アプライアンスには1 TBのメモリがあり、SAP HANAグローバル割り当て制限は768 GBに設定されています。SAPアプリケーションサーバーは、VMware上でVMとして実行され、NFSファイルシステムにデータが格納されています。企業は、オンプレミスシステムに関連するデータおよびログバックアップに関連する既存のSAP HANAパラメータを変更したくありません。SAPソリューションアーキテクトは、最もコスト効果的にDRの目標を達成するためにどのような作業をすべきでしょうか。"
      },
      "choices": [
        {
          "en": "For the SAP HANA database, change the log backup frequency to 5 minutes. Move the data and log backups to Amazon S3 by using the AWS CLI or AWS DataSync. Launch the SAP HANA database. For the SAP application servers, export the VMs as AMIs by using the VM Import/Export feature from AWS. For NFS file shares /sapmnt and /usr/sap/trans, establish real-time synchronization from DataSync to Amazon Elastic File System (Amazon EFS).",
          "isTranslating": false,
          "ja": "SAP HANA データベースでは、ログバックアップの頻度を5分間に変更します。AWS CLIまたはAWS DataSyncを使用して、データおよびログのバックアップをAmazon S3に移動します。SAP HANAデータベースを起動します。SAPアプリケーションサーバーについては、VM Import/Export機能を使用してVMをAMIとしてエクスポートします。NFSファイル共有/sapmntと/usr/sap/transについて、DataSyncからAmazon Elastic File System（Amazon EFS）へのリアルタイム同期を確立します。"
        },
        {
          "en": "For the SAP HANA database, change the log backup frequency to 5 minutes. Move the data and log backups to Amazon S3 by using AWS Storage Gateway File Gateway. For the SAP application servers, export the VMs as AMIs by using the VM Import/Export feature from AWS. For NFS file shares /sapmnt and /usr/sap/trans, establish real-time synchronization from AWS DataSync to Amazon Elastic File System (Amazon EFS).",
          "isTranslating": false,
          "ja": "SAP HANA データベースの場合、ログバックアップの頻度を5分に変更します。AWS Storage Gateway File Gateway を使用して、データとログバックアップを Amazon S3 に移動します。SAPアプリケーションサーバーについては、AWSのVM Import/Export機能を使用してVMをAMIとしてエクスポートします。NFSファイル共有の/sapmntと/usr/sap/transについては、AWS DataSyncからAmazon Elastic File System（Amazon EFS）へのリアルタイム同期を確立します。"
        },
        {
          "en": "For the SAP HANA database, SAP application servers, and NFS file shares, use CloudEndure Disaster Recovery to replicate the data continuously from on premises to AWS. Use CloudEndure Disaster Recovery to launch target instances in the event of a disaster.",
          "isTranslating": false,
          "ja": "SAP HANAデータベース、SAPアプリケーションサーバー、およびNFSファイル共有については、CloudEndure Disaster Recoveryを使用して、オンプレミスからAWSにデータを継続的にレプリケートします。災害発生時にはCloudEndure Disaster Recoveryを使用して、ターゲットインスタンスを起動します。"
        },
        {
          "en": "For the SAP HANA database, use a smaller SAP certified Amazon EC2 instance. Use SAP HANA system replication with ASYNC replication mode to replicate the data continuously from on premises to AWS. For the SAP application servers, use CloudEndure Disaster Recovery for continuous data replication. For NFS file shares /sapmnt and /usr/sap/trans, establish real-time synchronization from AWS DataSync to Amazon Elastic File System (Amazon EFS).",
          "isTranslating": false,
          "ja": "SAP HANAデータベースにおいては、SAP認定Amazon EC2の小規模インスタンスを使用するようにしてください。また、SAP HANAシステムレプリケーションをASYNCレプリケーションモードで使用し、オンプレミスからAWSへとデータを継続的にレプリケートしてください。さらに、SAPアプリケーションサーバーに対しては、継続的なデータレプリケーションのためにCloudEndure Disaster Recoveryを使用してください。また、NFSファイル共有の/sapmntと/usr/sap/transについては、AWS DataSyncからAmazon Elastic File System（Amazon EFS）へのリアルタイム同期を確立してください。"
        }
      ],
      "explanation": {
        "en": ["ASYNC for HANA DB.\nDRS for App"],
        "isTranslating": false,
        "ja": "ハナDB用の非同期処理。\nアプリ用の分散リソーススケジューリング（DRS）。"
      },
      "corrects": [4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is planning to migrate its on-premises SAP applications to AWS. The applications are based on Windows operating systems. A file share stores the transport directories and third-party application data on the network-attached storage of the company’s on-premises data center. The company’s plan is to lift and shift the SAP applications and the file share to AWS. The company must follow AWS best practices for the migration.Which AWS service should the company use to host the transport directories and third-party application data on AWS?"
        ],
        "isTranslating": false,
        "ja": "ある会社が、オンプレミスのSAPアプリケーションをAWSに移行する計画を立てています。これらのアプリケーションは、Windowsオペレーティングシステムに基づいています。ファイル共有は、会社のオンプレミスデータセンターのネットワークアタッチメントストレージに輸送ディレクトリとサードパーティのアプリケーションデータを保管しています。会社の計画は、SAPアプリケーションとファイル共有をAWSにリフトアンドシフトすることです。会社は、AWSのマイグレーションのベストプラクティスに従う必要があります。会社は、AWS上で輸送ディレクトリとサードパーティのアプリケーションデータをホストするために、どのAWSサービスを使用すればよいでしょうか？"
      },
      "choices": [
        {
          "en": "Amazon Elastic Block Store (Amazon EBS)",
          "isTranslating": false,
          "ja": "Amazon Elastic Block Store（Amazon EBS）は、Amazon Web Services（AWS）の一部で、Amazon EC2インスタンスに対してブロックストレージを提供するサービスです。EBSは高可用性、高性能、スケーラビリティ、セキュリティを備えており、AWS上で仮想的なサーバー環境を構築するために必要なストレージ要件を容易に満たすことができます。また、EBSには、自動スナップショット、セキュリティ機能、データ転送、ストレージタイプの選択など、多数の機能が備わっています。"
        },
        {
          "en": "AWS Storage Gateway",
          "isTranslating": false,
          "ja": "AWS Storage Gatewayとは、AWSが提供するサービスの1つで、オンプレミスのストレージシステムとクラウドストレージをシームレスに統合することができます。このサービスを使用することで、既存のオンプレミスのストレージシステムをAWSクラウドに拡張することができます。AWS Storage Gatewayは、ファイル、ボリューム、テープの3つの異なるストレージインターフェースをサポートしており、スケーラブルで高速なストレージソリューションを提供します。また、AWS Backupと連携することもでき、データのバックアップと復元を簡単かつ迅速に行うことができます。"
        },
        {
          "en": "Amazon Elastic File System (Amazon EFS)",
          "isTranslating": false,
          "ja": "Amazon Elastic File System（Amazon EFS）は、Amazon Web Services（AWS）のマネージドネットワークファイルシステムサービスで、マルチAZアーキテクチャをベースにしたスケーラブルなストレージソリューションを提供します。EFSは、複数のEC2インスタンスに同時にフルアクセスできるファイルシステムを提供するため、複雑なアプリケーションやワークロードに最適です。また、EFSは、ストレージ容量を自動的に拡大または縮小し、必要に応じてパフォーマンスもスケーリングできます。"
        },
        {
          "en": "Amazon FSx for Windows File Server",
          "isTranslating": false,
          "ja": "Amazon FSx for Windows File Serverは、マネージド型のWindowsネイティブのファイルストレージサービスです。このサービスは、Windowsベースのアプリケーションにとって高いパフォーマンス、信頼性、およびセキュリティを提供します。また、AWSのクラウドネイティブな設計により、サービスを簡単にスケーリングでき、容量を必要に応じて追加できます。"
        }
      ],
      "explanation": {
        "en": [
          "Amazon FSx for Windows File Server is a fully managed service that provides a Windows-compatible file system, making it easy to lift and shift Windows-based file servers to the cloud. It provides a highly available and scalable file storage solution that integrates with native Windows tools, making it easy to use and manage. In addition, it offers the ability to host a file share, which is what the company needs to store transport directories and third-party application data. AWS Storage Gateway is a hybrid storage service that enables customers to securely store data in the cloud while still providing low-latency access to data from on-premises resources, making it unsuitable for this requirement. Amazon Elastic Block Store (Amazon EBS) provides block-level storage for use with Amazon EC2 instances, and is used for storing and accessing data for Amazon EC2 instances, not for file shares. Amazon Elastic File System (Amazon EFS) provides scalable network attached file storage for Amazon EC2 instances and is not a fully managed file server solution."
        ],
        "isTranslating": false,
        "ja": "Amazon FSx for Windows File Server は、Windows 互換のファイルシステムを提供するフルマネージド型サービスです。これにより、Windows ベースのファイルサーバーをクラウドに移行することが容易になります。高可用性でスケーラブルなファイルストレージソリューションを提供し、ネイティブの Windows ツールに統合されており、使いやすく管理しやすいです。さらに、ファイル共有をホストする機能も提供しており、それが会社が輸送ディレクトリとサードパーティアプリケーションのデータを保存する必要があるものです。 AWS Storage Gatewayは、ハイブリッドストレージサービスであり、クラウドで安全にデータを保存しながら、オンプレミスのリソースからデータへの低レイテンシアクセスを提供するものであり、この要件には適していません。Amazon Elastic Block Store（Amazon EBS）は、Amazon EC2 インスタンスで使用するためのブロックレベルストレージを提供し、Amazon EC2 インスタンスのデータの保存とアクセスに使用されますが、ファイル共有のためのものではありません。Amazon Elastic File System（Amazon EFS）は、Amazon EC2 インスタンス向けのスケーラブルなネットワークアタッチドファイルストレージを提供し、フルマネージドファイルサーバーソリューションではありません。"
      },
      "corrects": [4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company has an SAP environment that runs on AWS. The company wants to enhance security by restricting Amazon EC2 Instance Metadata Service (IMDS) to IMDSv2 only. The company’s current configuration option supports both IMDSv1 and IMDSv2. The security enhancement must not create an SAP outage.What should the company do before it applies the security enhancement on EC2 instances that are running the SAP environment?"
        ],
        "isTranslating": false,
        "ja": "ある企業はAWS上で動作するSAP環境を持っています。企業は、Amazon EC2インスタンスメタデータサービス（IMDS）をIMDSv2のみに制限することでセキュリティを強化したいと考えています。現在、企業の設定オプションはIMDSv1とIMDSv2の両方をサポートしています。セキュリティ強化によってSAPの停止が発生しないようにする必要があります。企業はEC2インスタンスでSAP環境を実行する前に、何をすべきでしょうか？"
      },
      "choices": [
        {
          "en": "Ensure that the SAP kernel versions are 7.45 or later.",
          "isTranslating": false,
          "ja": "SAPカーネルのバージョンが7.45以上であることを確認してください。"
        },
        {
          "en": "Ensure that the EC2 instances are Nitro based.",
          "isTranslating": false,
          "ja": "EC2インスタンスがNitroベースであることを確認してください。"
        },
        {
          "en": "Ensure that the AWS Data Provider for SAP is installed on each EC2 instance.",
          "isTranslating": false,
          "ja": "各EC2インスタンスにAWS Data Provider for SAPがインストールされていることを確認してください。"
        },
        {
          "en": "Stop the EC2 instances.",
          "isTranslating": false,
          "ja": "EC2 インスタンスを停止してください。"
        }
      ],
      "explanation": {
        "en": [
          "This is because the restriction of Amazon EC2 Instance Metadata Service (IMDS) to IMDSv2 is supported only on Nitro-based instances. By ensuring that the EC2 instances are Nitro-based, the company can restrict IMDS to IMDSv2 without causing an SAP outage. This is because the EC2 instances are designed to support this feature without affecting the performance of the SAP environment."
        ],
        "isTranslating": false,
        "ja": "これは、Amazon EC2 Instance Metadata Service（IMDS）の制限がIMDSv2に限定されているためであり、NitroベースのインスタンスにのみIMDSv2がサポートされているためです。EC2インスタンスがNitroベースであることを確認することで、企業はSAPの障害を引き起こすことなくIMDSをIMDSv2に制限することができます。これは、EC2インスタンスが、SAP環境のパフォーマンスに影響を与えることなく、この機能をサポートするように設計されているためです。"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is running an SAP HANA database on AWS. The company wants to manage historical, infrequently accessed warm data for a native SAP HANA use case. An SAP solutions architect needs to recommend a solution that can provide online data storage in extended store, available for queries and updates. The solution must be an integrated component of the SAP HANA database and must allow the storage of up to five times more data in the warm tier than in the hot tier.Which solution will meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "ある企業は、AWS上でSAP HANAデータベースを運用しています。同社では、ネイティブのSAP HANAユースケースに関する歴史的でアクセス頻度の低いウォームデータを管理したいと考えています。SAPソリューションアーキテクトは、クエリと更新が可能なオンラインデータストレージを提供できるソリューションを推奨する必要があります。このソリューションはSAP HANAデータベースの統合コンポーネントである必要があり、ウォームティアに保存できるデータはホットティアよりも最大5倍多くなければなりません。これらの要件を満たすソリューションは何でしょうか？"
      },
      "choices": [
        {
          "en": "Use Amazon Data Lifecycle Manager (Amazon DLM) with SAP Data Hub to move data in and out of the SAP HANA database to Amazon S3.",
          "isTranslating": false,
          "ja": "SAP Data HubとAmazon S3の間でデータを移動するために、Amazon Data Lifecycle Manager (Amazon DLM)を使用することができます。これにより、SAP HANAデータベース内のデータを効率的に操作することが可能になります。"
        },
        {
          "en": "Use an SAP HANA extension node.",
          "isTranslating": false,
          "ja": "SAP HANA拡張ノードを使用します。"
        },
        {
          "en": "Use SAP HANA dynamic tiering as an optional add-on to the SAP HANA database.",
          "isTranslating": false,
          "ja": "SAP HANA データベースのオプションとして、SAP HANA dynamic tiering を追加することができます。"
        },
        {
          "en": "Use Amazon Data Lifecycle Manager (Amazon DLM) with SAP HANA spark controller so that SAP HANA can access the data through the Spark SQL SDA adapter.",
          "isTranslating": false,
          "ja": "Amazon Data Lifecycle Manager（Amazon DLM）をSAP HANAスパークコントローラーと組み合わせることで、SAP HANAがSpark SQL SDAアダプターを介してデータにアクセスできるようにします。"
        }
      ],
      "explanation": {
        "en": [
          "SAP HANA dynamic tiering is an optional add-on to the SAP HANA database that enables the management of historical and infrequently accessed warm data in a cost-effective manner. It allows for the storage of up to five times more data in the warm tier than in the hot tier and is an integrated component of the SAP HANA database, providing online data storage and making it available for queries and updates. This solution meets the requirements for the company's use case of managing historical warm data for a native SAP HANA use case."
        ],
        "isTranslating": false,
        "ja": "SAP HANA ダイナミックティアリングは、費用効果的な方法で歴史的、または頻繁にアクセスされないウォームデータの管理を可能にする、SAP HANAデータベースのオプションの追加機能です。この機能により、ウォームティアにはホットティアよりも最大5倍のデータを保存でき、SAP HANAデータベースの統合コンポーネントであるため、オンラインデータストレージを提供し、クエリや更新に利用できます。このソリューションは、ネイティブのSAP HANAのユースケースにおいて、歴史的ウォームデータを管理するための要件を満たします。"
      },
      "corrects": [3],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company plans to migrate its SAP NetWeaver deployment to AWS. The deployment runs on a Microsoft SQL Server database. The company plans to change the source database from SQL Server to SAP HANA as part of this process.Which migration tools or methods should an SAP solutions architect use to meet these requirements? (Choose two.)"
        ],
        "isTranslating": false,
        "ja": "ある企業が自社のSAP NetWeaver展開をAWSに移行する計画を立てています。この展開は、Microsoft SQL Serverデータベース上で実行されています。このプロセスの一環として、企業はソースデータベースをSQL ServerからSAP HANAに変更する予定です。SAPソリューションアーキテクトがこれらの要件を満たすために使用すべき移行ツールまたは方法は何ですか？ (2つ選択してください。)"
      },
      "choices": [
        {
          "en": "SAP HANA classical migration",
          "isTranslating": false,
          "ja": "SAP HANAの古典的な移行"
        },
        {
          "en": "SAP HANA system replication",
          "isTranslating": false,
          "ja": "SAP HANAのシステムレプリケーションについて。"
        },
        {
          "en": "SAP Software Update Manager (SUM) Database Migration Option (DMO) with System Move",
          "isTranslating": false,
          "ja": "システム移行を含むSAPソフトウェアの更新マネージャー（SUM）データベースマイグレーションオプション（DMO）"
        },
        {
          "en": "SAP HANA backup and restore",
          "isTranslating": false,
          "ja": "SAP HANA バックアップとリストアします。"
        },
        {
          "en": "SAP homogeneous system copy",
          "isTranslating": false,
          "ja": "SAPホモジニアスシステムコピー"
        }
      ],
      "explanation": {
        "en": [
          "https://docs.aws.amazon.com/sap/latest/sap-hana/migrating-hana-anydb-to-hana.html"
        ],
        "isTranslating": false,
        "ja": "こちらはSAP HANA AnyDBからSAP HANAへのマイグレーションについてのAmazon Web Servicesのドキュメントです。"
      },
      "corrects": [1, 3],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company has an SAP Business One system that runs on SUSE Linux Enterprise Server 12 SP3. The company wants to migrate the system to AWS. An SAP solutions architect selects a homogeneous migration strategy that uses AWS Application Migration Service (CloudEndure Migration).After the server migration process is finished, the SAP solutions architect launches an Amazon EC2 test instance from the R5 instance family. After a few minutes, the EC2 console reports that the test instance has failed an instance status check. Network connections to the instance are refused.How can the SAP solutions architect solve this problem?"
        ],
        "isTranslating": false,
        "ja": "会社は、SUSE Linux Enterprise Server 12 SP3上で動作するSAP Business Oneシステムを持っています。会社はこのシステムをAWSに移行したいと考えており、SAPのソリューションアーキテクトは、AWS Application Migration Service（CloudEndure Migration）を使用した同種の移行戦略を選択しました。サーバー移行プロセスが完了した後、SAPソリューションアーキテクトはR5インスタンスファミリーからAmazon EC2のテストインスタンスを起動します。数分後、EC2コンソールによってテストインスタンスがインスタンスステータスチェックに失敗したことが報告されました。インスタンスへのネットワーク接続が拒否されています。SAPソリューションアーキテクトは、この問題をどのように解決できますか？\n\n【回答】\nSAPソリューションアーキテクトは、次の手順を実行して問題を解決できます。\n1. テストインスタンスがEC2インスタンスにアタッチされているセキュリティグループの設定を確認します。許可されたポートが正しいかどうかを確認します。\n2. インスタンスが正常に起動しているかどうかを確認し、CloudWatchメトリックスを使用してCPU使用率、ネットワークI/O、およびディスクI/Oなどのリソース使用状況を観察します。\n3. インスタンスがVPC内で正しいサブネットに配置されていることを確認します。\n4. インスタンスがアクセスできるようにするための必要なルートを、ルーティングテーブルとネットワークACLで確認します。\n5. Amazon EC2サービスから、テストインスタンスが正常に起動するための詳細なログを確認します。\nこれらの手順で問題が解決されない場合は、AWSテクニカルサポートに連絡し、詳細な診断を受ける必要があります。"
      },
      "choices": [
        {
          "en": "Reboot the instance to initiate instance migration to another host.",
          "isTranslating": false,
          "ja": "インスタンスの移行を別のホストに開始するには、インスタンスを再起動してください。"
        },
        {
          "en": "Request an instance limit increase for the AWS Region where the test instance is being launched.",
          "isTranslating": false,
          "ja": "テストインスタンスを起動しているAWSリージョンのインスタンス制限を増やすようにリクエストしてください。"
        },
        {
          "en": "Create a ticket for AWS Support that documents the test server instance ID. Wait for AWS to update the host of the R5 instance.",
          "isTranslating": false,
          "ja": "AWSサポートに、テストサーバーのインスタンスIDが記載されたチケットを作成してください。R5インスタンスのホストが更新されるまでお待ちください。"
        },
        {
          "en": "Install the missing drivers on the source system. Wait for the completion of migration synchronization. Launch the test instance again.",
          "isTranslating": false,
          "ja": "ソースシステムに欠落しているドライバーをインストールします。移行同期が完了するのを待ちます。その後、テストインスタンスを再起動します。"
        }
      ],
      "explanation": {
        "en": [
          "https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/troubleshooting-launch.html"
        ],
        "isTranslating": false,
        "ja": "AWS EC2 における起動トラブルシューティングのヒントを説明したユーザーガイドがあります。"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "An SAP basis architect is configuring high availability for a critical SAP system on AWS. The SAP basis architect is using an overlay IP address to route traffic to the subnets across multiple Availability Zones within an AWS Region for the system’s SAP HANA database.What should the SAP basis architect do to route the traffic to the Amazon EC2 instance of the active SAP HANA database?"
        ],
        "isTranslating": false,
        "ja": "AWS上の重要なSAPシステムに対して、SAP基盤アーキテクトが高可用性を構成しています。SAP基盤アーキテクトは、システムのSAP HANAデータベースのサブネットにある複数の利用可能ゾーン間でトラフィックをルーティングするために、オーバーレイIPアドレスを使用しています。アクティブなSAP HANAデータベースのAmazon EC2インスタンスへトラフィックをルーティングするために、SAP基盤アーキテクトは何をすべきですか？"
      },
      "choices": [
        {
          "en": "Edit the route in the route table of the VPC that includes the EC2 instance that runs SAP HANSpecify the overlay IP address as the destination. Specify the private IP address of the EC2 instance as the target.",
          "isTranslating": false,
          "ja": "SAP HANAを実行するEC2インスタンスが含まれるVPCのルートテーブルのルートを編集してください。宛先にオーバーレイIPアドレスを指定し、ターゲットにはEC2インスタンスのプライベートIPアドレスを指定してください。"
        },
        {
          "en": "Edit the inbound and outbound rules in the security group of the EC2 instance that runs SAP HANA. Allow traffic for SAP HANA specific ports from the overlay IP address.",
          "isTranslating": false,
          "ja": "SAP HANAを実行しているEC2インスタンスのセキュリティグループのインバウンドおよびアウトバウンド規則を編集し、オーバーレイIPアドレスからSAP HANA特定のポートへのトラフィックを許可してください。"
        },
        {
          "en": "Edit the network ACL of the subnet that includes the EC2 instance that runs SAP HANA. Allow traffic for SAP HANA specific ports from the overlay IP address.",
          "isTranslating": false,
          "ja": "SAP HANAを実行しているEC2インスタンスが含まれるサブネットのネットワークACLを編集し、オーバーレイIPアドレスからSAP HANA特定のポートに対するトラフィックを許可してください。"
        },
        {
          "en": "Edit the route in the route table of the VPC that includes the EC2 instance that runs SAP HANA. Specify the overlay IP address as the destination. Specify the elastic network interface of the EC2 instance as the target.",
          "isTranslating": false,
          "ja": "SAP HANAを実行するEC2インスタンスが含まれるVPCのルーテーブルのルートを編集し、オーバーレイIPアドレスを宛先として指定します。EC2インスタンスの弾性ネットワークインターフェイスをターゲットとして指定してください。"
        }
      ],
      "explanation": {
        "en": [
          "Edit the route in the route table of the VPC that includes the EC2 instance that runs SAP HANA, specify the overlay IP address as the destination, and specify the elastic network interface of the EC2 instance as the target.\n\nThis solution ensures that the traffic is correctly routed to the active EC2 instance hosting the SAP HANA database by using an overlay IP address and specifying the elastic network interface as the target in the route table. This way, when the active database is moved to a different EC2 instance in another Availability Zone, the route table will automatically update to route traffic to the new instance without manual intervention. This helps to ensure high availability and minimize downtime for the critical SAP system."
        ],
        "isTranslating": false,
        "ja": "SAP HANAを実行しているEC2インスタンスが含まれるVPCのルートテーブル内のルートを編集し、オーバーレイIPアドレスを宛先として、EC2インスタンスのエラスティックネットワークインターフェイスをターゲットとして指定します。\n\nこの対策により、オーバーレイIPアドレスを使用してトラフィックを適切にアクティブなEC2インスタンスに経路付けし、ルートテーブル内のエラスティックネットワークインターフェースをターゲットとして指定することで、別のアベイラビリティーゾーンの別のEC2インスタンスにアクティブなデータベースが移動された場合でも、手動介入なしにルートテーブルが自動的に更新され、トラフィックが新しいインスタンスに向けられます。これにより、SAPシステムの可用性が高まり、ダウンタイムが最小限に抑えられます。"
      },
      "corrects": [4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is running SAP ERP Central Component (SAP ECC) with a Microsoft SQL Server database on AWS. A solutions architect must attach an additional 1 TB Amazon Elastic Block Store (Amazon EBS) volume. The company needs to write the SQL Server database backups to this EBS volume before moving the database backups to Amazon S3 for long-term storage.Which EBS volume type will meet these requirements MOST cost-effectively?"
        ],
        "isTranslating": false,
        "ja": "ある会社は、Microsoft SQL Serverデータベースを使用したSAP ERP Central Component（SAP ECC）をAWS上で運営しています。ソリューションアーキテクトは、1 TBのAmazon Elastic Block Store（Amazon EBS）ボリュームを追加する必要があります。会社は、SQL ServerデータベースのバックアップをこのEBSボリュームに書き込み、その後、長期保管のためにAmazon S3にデータベースバックアップを移動する必要があります。この要件を最も費用対効果よく満たすEBSボリュームタイプは何ですか？"
      },
      "choices": [
        {
          "en": "Throughput Optimized HDD (st1)",
          "isTranslating": false,
          "ja": "スループット重視型HDD（st1）"
        },
        {
          "en": "Provisioned IOPS SSD (io2)",
          "isTranslating": false,
          "ja": "プロビジョニングされた IOPS SSD（io2）"
        },
        {
          "en": "General Purpose SSD (gp3)",
          "isTranslating": false,
          "ja": "一般的な用途に適したSSD (gp3)"
        },
        {
          "en": "Cold HDD (sc1)",
          "isTranslating": false,
          "ja": "「Cold HDD (sc1)」の意味は、冷却されたハードディスクドライブ（sc1）です。"
        }
      ],
      "explanation": {
        "en": [
          "The Throughput Optimized HDD (st1) EBS volume type is most cost-effective for the company's requirements. This is because it provides a balance of both performance and cost, and is well-suited for a wide range of workloads, including those that require low latency and high throughput. The SQL Server database backups are likely to have a moderate I/O demand, and the st1 volume type provides a consistent performance with a low cost per gigabyte. The st1 volume type is also a good choice for use with a SQL Server database because it supports burst performance for workloads that require sudden spikes in I/O."
        ],
        "isTranslating": false,
        "ja": "会社の要件に最も費用対効果の高いのは、スループット最適化されたHDD（st1）EBSボリュームタイプです。これは、パフォーマンスとコストの両方のバランスを提供し、低レイテンシーと高スループットを求められるさまざまなワークロードに適しています。SQL Serverデータベースのバックアップには、中程度のI/O需要が予想されますが、st1ボリュームタイプは一定のパフォーマンスと低コスト/ギガバイトを提供するため、適しています。また、急激なI/Oのスパイクを要求するワークロードに対しては、バーストパフォーマンスをサポートしているため、SQL Serverデータベースでの利用にも適しています。"
      },
      "corrects": [1],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "Business users are reporting timeouts during periods of peak query activity on an enterprise SAP HANA data mart. An SAP system administrator has discovered that at peak volume, the CPU utilization increases rapidly to 100% for extended periods on the x1.32xlarge Amazon EC2 instance where the database is installed. However, the SAP HANA database is occupying only 1,120 GiB of the available 1,952 GiB on the instance. I/O wait times are not increasing. Extensive query tuning and system tuning have not resolved this performance problem.Which solutions should the SAP system administrator use to improve the performance? (Choose two.)"
        ],
        "isTranslating": false,
        "ja": "企業向けのSAP HANAデータマートで、ピーク時のクエリ活動中にタイムアウトが報告されています。SAPシステム管理者は、データベースがインストールされているx1.32xlarge Amazon EC2インスタンスで、ピーク時にCPU使用率が急速に増加して長時間100%になることを発見しました。ただし、SAP HANAデータベースは、インスタンスの利用可能な1,952 GiBのうち1,120 GiBしか占有していません。I/O待ち時間は増加していません。クエリチューニングとシステムチューニングによるパフォーマンス問題の解決には成功していません。システム管理者がパフォーマンスを改善するために使用すべきソリューションはどれですか？ （2つ選択してください。）\n\n- Add more CPU resources to the instance to handle the peak query loads.\n- Move the SAP HANA database to an instance with more memory to avoid CPU saturation.\n- Use Amazon ElastiCache to cache frequently accessed data to reduce query times.\n- Upgrade the network connection between the SAP HANA instance and the application servers.\n- Use Amazon CloudWatch to monitor query activity and alert when timeouts are encountered. \n\n（2つ選択してください。） \n\n1.ピーク時のクエリ負荷を処理するために、インスタンスにより多くのCPUリソースを追加します。\n2.CPU飽和を回避するために、SAP HANAデータベースをメモリが多いインスタンスに移動します。\n3.頻繁にアクセスされるデータをキャッシュしてクエリ時間を短縮するためにAmazon ElastiCacheを使用します。\n4.SAP HANAインスタンスとアプリケーションサーバー間のネットワーク接続をアップグレードします。\n5.クエリアクティビティを監視し、タイムアウトが発生した場合にアラートを発信するためにAmazon CloudWatchを使用します。"
      },
      "choices": [
        {
          "en": "Reduce the global_allocation_limit parameter to 1,120 GiB.",
          "isTranslating": false,
          "ja": "グローバルアロケーション制限パラメーターを1,120 GiBに減らしてください。"
        },
        {
          "en": "Migrate the SAP HANA database to an EC2 High Memory instance with a larger number of available vCPUs.",
          "isTranslating": false,
          "ja": "SAP HANAデータベースを、使用可能なvCPUが多いEC2ハイメモリーインスタンスに移行します。"
        },
        {
          "en": "Move to a scale-out architecture for SAP HANA with at least three x1. 16xlarge instances.",
          "isTranslating": false,
          "ja": "SAP HANAのスケールアウトアーキテクチャについて、少なくとも3つのx1.16xlargeインスタンスを使用するよう移行してください。"
        },
        {
          "en": "Modify the Amazon Elastic Block Store (Amazon EBS) volume type from General Purpose to Provisioned IOPS for all SAP HANA data volumes.",
          "isTranslating": false,
          "ja": "SAP HANAの全てのデータボリュームについて、Amazon Elastic Block Store (Amazon EBS) ボリュームタイプをジェネラルパーパスからプロビジョンドIOPSに変更します。"
        },
        {
          "en": "Change to a supported compute optimized instance type for SAP HANA.",
          "isTranslating": false,
          "ja": "SAP HANA を実行するためにサポートされているコンピューティング最適化インスタンスタイプに変更してください。"
        }
      ],
      "explanation": {
        "en": [
          "The solution for the SAP system administrator should be to move to a scale-out architecture for SAP HANA with at least three x1.16xlarge instances (Option C) and to change to a supported compute optimized instance type for SAP HANA (Option 5).\n\nBy moving to a scale-out architecture, the SAP HANA database can be distributed across multiple instances, providing more CPU resources to handle peak query activity.\n\nBy changing to a compute optimized instance type for SAP HANA, the SAP system administrator can improve the performance of the system by having instances that are optimized for high-performance computing workloads.\n\nReducing the global allocation limit parameter would not necessarily improve the performance of the system.\n\nMigrating the SAP HANA database to an EC2 High Memory instance with a larger number of available vCPUs might provide additional resources, but it is not clear if it would be enough to handle the increased demand during periods of peak query activity.\n\nModifying the Amazon EBS volume type from General Purpose to Provisioned IOPS would not necessarily improve the performance of the system."
        ],
        "isTranslating": false,
        "ja": "SAPシステム管理者の解決策は、少なくとも3つのx1.16xlargeインスタンス（オプションC）を使用し、SAP HANA用にサポートされるコンピューティング最適化インスタンスタイプに変更すること（オプション5）であるスケールアウトアーキテクチャに移行することにあります。\n\nスケールアウトアーキテクチャに移行することで、SAP HANAデータベースを複数のインスタンスに分散させることができ、ピーク時のクエリアクティビティを処理するためにより多くのCPUリソースを提供することができます。\n\nSAP HANA用のコンピューティング最適化インスタンスタイプに変更することで、SAPシステム管理者は、高性能なコンピューティングワークロードに最適化されたインスタンスを使用することにより、システムのパフォーマンスを向上させることができます。\n\nグローバル割り当て制限パラメーターを減らしたとしても、システムのパフォーマンスが必ずしも改善されるわけではありません。\n\nSAP HANAデータベースをvCPU数が多いEC2 High Memoryインスタンスに移行することは、追加のリソースを提供する可能性がありますが、ピーク時のクエリアクティビティの増加に対応できるかどうかは不明です。\n\nAmazon EBSボリュームタイプを汎用からプロビジョンドIOPSに変更しても、必ずしもシステムのパフォーマンスが改善されるわけではありません。"
      },
      "corrects": [3, 5],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is moving to the AWS Cloud gradually. The company has multiple SAP landscapes on VMware. The company already has sandbox, development, and QA systems on AWS. The company’s production system is still running on premises. The company has 2 months to cut over the entire landscape to the AWS Cloud.The company has adopted a hybrid architecture for the next 2 months and needs to synchronize its shared file systems between the landscapes. These shared file systems include /trans directory mounts, /software directory mounts, and third-party integration mounts. In the on-premises landscape, the company has NFS mounts between the servers. On the AWS infrastructure side, the company is using Amazon Elastic File System (Amazon EFS) to share the common files.An SAP solutions architect needs to design a solution to schedule transfer of these shared files bidirectionally four times each day. The data transfer must be encrypted.Which solution will meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "1日に4回、共有ファイルを双方向に転送するようにスケジュールを設定する必要があるため、SAPソリューションアーキテクトは、これらの要件を満たすためのソリューションを設計する必要があります。データ転送は暗号化する必要があります。この期間中、ハイブリッドアーキテクチャが採用されているため、共有ファイルシステムをランドスケープ間で同期する必要があります。共有ファイルシステムには、/ transディレクトリマウント、/ softwareディレクトリマウント、およびサードパーティの統合マウントが含まれます。オンプレミスのランドスケープでは、会社はサーバー間で NFS マウントを使用しています。AWSのインフラストラクチャ側では、会社はAmazon Elastic File System(Amazon EFS)で共通のファイルを共有しています。以上の要件を満たすソリューションは何ですか？"
      },
      "choices": [
        {
          "en": "Write an rsync script. Schedule the script through cron for four times each day in the on-premises VMware servers to transfer the data from on premises to AWS.",
          "isTranslating": false,
          "ja": "オンプレミスのVMwareサーバからAWSへデータを転送するためのrsyncスクリプトを作成し、cronを使用して1日4回スケジュールしてください。"
        },
        {
          "en": "Install an AWS DataSync agent on the on-premises VMware platform. Use the DataSync endpoint to synchronize between the on-premises NFS server and Amazon EFS on AWS.",
          "isTranslating": false,
          "ja": "オンプレミスVMwareプラットフォームにAWS DataSyncエージェントをインストールします。DataSyncエンドポイントを使用して、オンプレミスNFSサーバーとAWSのAmazon EFSとの間で同期を取ります。"
        },
        {
          "en": "Order an AWS Snowcone device. Use the Snowcone device to transfer data between the on-premises servers and AWS.",
          "isTranslating": false,
          "ja": "AWS Snowconeデバイスをオーダーし、オンプレミスサーバーとAWSの間でデータを転送するために使用します。"
        },
        {
          "en": "Set up a separate AWS Direct Connect connection for synchronization between the on-premises servers and AWS.",
          "isTranslating": false,
          "ja": "オンプレミス・サーバーとAWS間の同期のために、別のAWS Direct Connect接続を設定してください。"
        }
      ],
      "explanation": {
        "en": [
          "Install an AWS DataSync agent on the on-premises VMware platform and use the DataSync endpoint to synchronize between the on-premises NFS server and Amazon EFS on AWS.\n\nAWS DataSync provides a fast, simple, and secure way to transfer data between on-premises and AWS storage, including Amazon EFS. By installing an AWS DataSync agent on the on-premises VMware platform and configuring the DataSync endpoint, the SAP solutions architect can use the AWS DataSync to synchronize the shared file systems between the landscapes. The data transfer can be encrypted, meeting the security requirement. DataSync is designed for bi-directional transfers and can be scheduled for four times a day to meet the requirement for frequent data transfers."
        ],
        "isTranslating": false,
        "ja": "オンプレミスのVMwareプラットフォームにAWS DataSyncエージェントをインストールし、DataSyncエンドポイントを使用してオンプレミスのNFSサーバーとAWSのAmazon EFS間で同期する方法があります。\n\nAWS DataSyncは、オンプレミスとAWSストレージ、Amazon EFSを含むストレージ間のデータ転送を迅速かつ簡単かつ安全な方法で提供します。オンプレミスのVMwareプラットフォームにAWS DataSyncエージェントをインストールし、DataSyncエンドポイントを設定することで、SAPソリューションアーキテクトは、AWS DataSyncを使用してランドスケープ間の共有ファイルシステムを同期することができます。データ転送は暗号化され、セキュリティ要件を満たすことができます。DataSyncは双方向の転送に対応しており、頻繁なデータ転送の要件を満たすために1日4回のスケジュールを設定することができます。"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is planning to move to AWS. The company wants to set up sandbox and test environments on AWS to perform proofs of concept (POCs). Development and production environments will remain on premises until the POCs are completed.At the company’s on-premises location, SAProuter is installed on the same server as SAP Solution Manager. The company uses SAP Solution Manager to monitor the entire landscape. The company uses SAProuter to connect to SAP Support. The on-premises SAP Solution Manager instance must monitor the performance and server metrics of the newly created POC systems on AWS. The existing SAProuter must be able to report any issues to SAP.What should an SAP solutions architect do to set up this hybrid infrastructure MOST cost-effectively?"
        ],
        "isTranslating": false,
        "ja": "ある企業がAWSへの移行を計画しています。同社は、概念実証（POC）を実行するためにAWS上にサンドボックスおよびテスト環境を設定することを望んでいます。POCが完了するまで、開発環境および本番環境はオンプレミスに残ります。同社のオンプレミスの場所では、SAPルータがSAP Solution Managerと同じサーバーにインストールされています。同社はSAP Solution Managerを使用して、全体像を監視しています。同社はSAPサポートに接続するためにSAProuterを使用しています。オンプレミスのSAP Solution Managerインスタンスは、AWS上に新たに作成されたPOCシステムのパフォーマンスおよびサーバーメトリックを監視する必要があります。既存のSAProuterは、SAPに問題がある場合に報告できるようにしておく必要があります。\n\nこのハイブリッドインフラストラクチャを、最も費用対効果が高く設定するために、SAPのソリューションアーキテクトは何をすべきでしょうか？"
      },
      "choices": [
        {
          "en": "Install a new SAP Solution Manager instance and a new SAProuter instance in the AWS environment. Connect the POC systems to these new instances. Use these new instances in parallel with the on-premises SAP Solution Manager instance and the on-premises SAProuter instance.",
          "isTranslating": false,
          "ja": "AWS環境に新しいSAP Solution ManagerインスタンスとSAProuterインスタンスをインストールし、POCシステムをこれらの新しいインスタンスに接続します。オンプレミスのSAP Solution ManagerインスタンスとSAProuterインスタンスと並行して、これらの新しいインスタンスを使用してください。"
        },
        {
          "en": "Install a new SAP Solution Manager instance and a new SAProuter instance in the AWS environment. Install the Amazon CloudWatch agent on all on-premises instances. Push the monitoring data to the new SAP Solution Manager instance. Connect all on-premises systems and POC systems on AWS to the new SAP Solution Manager instance and the new SAProuter instance. Remove the on-premises SAP Solution Manager instance and the on-premises SAProuter instance. Use the new instances on AWS.",
          "isTranslating": false,
          "ja": "AWS環境に新しいSAP Solution Managerインスタンスと新しいSAProuterインスタンスをインストールします。オンプレミスのすべてのインスタンスにAmazon CloudWatchエージェントをインストールします。監視データを新しいSAP Solution Managerインスタンスに送信します。オンプレミスシステムとAWS上のPOCシステムを、新しいSAP Solution Managerインスタンスと新しいSAProuterインスタンスに接続します。オンプレミスのSAP Solution ManagerインスタンスとSAProuterインスタンスを削除し、AWS上の新しいインスタンスを使用します。"
        },
        {
          "en": "Use AWS Site-to-Site VPN to connect the on-premises network to the AWS environment. Connect the POC systems on AWS to the on-premises SAP Solution Manager instance and the on-premises SAProuter instance.",
          "isTranslating": false,
          "ja": "オンプレミスネットワークとAWS環境を接続するために、AWS Site-to-Site VPNを使用してください。AWS上のPOCシステムを、オンプレミスのSAP Solution ManagerインスタンスおよびSAProuterインスタンスに接続してください。"
        },
        {
          "en": "Add the POC systems on AWS to the existing SAP Transport Management System that is configured in the on-premises SAP systems.",
          "isTranslating": false,
          "ja": "オンプレミスのSAPシステムに設定された既存のSAPトランスポート管理システムに、AWS上のPOCシステムを追加してください。"
        }
      ],
      "explanation": {
        "en": [
          "Use AWS Site-to-Site VPN to connect the on-premises network to the AWS environment Connect the POC systems on AWS to the on-premises SAP Solution Manager instance and the on-premises SAP router instance.\n\nExplanation: The company wants to monitor the newly created POC systems on AWS using the existing on-premises SAP Solution Manager instance. One cost-effective way to accomplish this is to set up a site-to-site VPN between the on-premises network and the AWS environment. This will allow the POC systems on AWS to connect to the on-premises SAP Solution Manager instance and the on-premises SAP router instance, enabling the monitoring of the performance and server metrics of the POC systems on AWS."
        ],
        "isTranslating": false,
        "ja": "AWS Site-to-Site VPNを使用して、オンプレミスのネットワークをAWS環境に接続しましょう。そして、AWS上のPOCシステムをオンプレミスのSAP Solution ManagerインスタンスとオンプレミスのSAPルーターインスタンスに接続しましょう。\n\n説明：企業は、新しく作成されたAWS上のPOCシステムを既存のオンプレミスのSAP Solution Managerインスタンスを使用して監視したいと考えています。これを実現するための費用効果の高い方法の1つは、オンプレミスネットワークとAWS環境の間にサイト間VPNを設定することです。これにより、AWS上のPOCシステムがオンプレミスのSAP Solution ManagerインスタンスとオンプレミスのSAPルーターインスタンスに接続できるようになります。これにより、AWS上のPOCシステムのパフォーマンスやサーバーメトリックの監視が可能になります。"
      },
      "corrects": [3],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "An SAP solutions architect is using AWS Systems Manager Distributor to install the AWS Data Provider for SAP on production SAP application servers and SAP HANA database servers. The SAP application servers and the SAP HANA database servers are running on Red Hat Enterprise Linux.The SAP solutions architect chooses instances manually in Systems Manager Distributor and schedules installation. The installation fails with an access and authorization error related to Amazon CloudWatch and Amazon EC2 instances. There is no error related to AWS connectivity.What should the SAP solutions architect do to resolve the error?"
        ],
        "isTranslating": false,
        "ja": "SAPソリューションアーキテクトは、AWS Systems Manager Distributorを使用して、本番SAPアプリケーションサーバーとSAP HANAデータベースサーバーにAWS Data Provider for SAPをインストールしています。SAPアプリケーションサーバーとSAP HANAデータベースサーバーはRed Hat Enterprise Linuxで動作しています。SAPソリューションアーキテクトは、Systems Manager Distributorで手動でインスタンスを選択し、インストールをスケジュールしています。インストールには、Amazon CloudWatchおよびAmazon EC2インスタンスに関連するアクセスと認証エラーが発生します。AWS接続に関連するエラーはありません。SAPソリューションアーキテクトは、エラーを解決するために何をすべきですか？"
      },
      "choices": [
        {
          "en": "Install the CloudWatch agent on the servers before installing the AWS Data Provider for SAP.",
          "isTranslating": false,
          "ja": "AWS Data Provider for SAPをインストールする前に、サーバーにCloudWatchエージェントをインストールしてください。"
        },
        {
          "en": "Download the AWS Data Provider for SAP installation package from AWS Marketplace. Use an operating system super user to install the agent manually or through a script.",
          "isTranslating": false,
          "ja": "AWS Marketplace から SAP 用の AWS データプロバイダのインストールパッケージをダウンロードしてください。オペレーティングシステムのスーパーユーザーを使用して、エージェントを手動でインストールするか、またはスクリプトを通じてインストールしてください。"
        },
        {
          "en": "Create an IAM role. Attach the appropriate policy to the role. Attach the role to the appropriate EC2 instances.",
          "isTranslating": false,
          "ja": "IAMロールを作成します。適切なポリシーをロールにアタッチします。そして、適切なEC2インスタンスにロールをアタッチします。"
        },
        {
          "en": "Wait until Systems Manager Agent is fully installed and ready to use on the EC2 instances. Use Systems Manager Patch Manager to perform the installation.",
          "isTranslating": false,
          "ja": "EC2インスタンスで、Systems Manager Agentが完全にインストールされ、使用可能になるまで待ちます。インストールは、Systems Manager Patch Managerを使用して実行してください。"
        }
      ],
      "explanation": {
        "en": [
          "Create an IAM role, attach the appropriate policy to the role, and attach the role to the appropriate EC2 instances.\n\nThis error is likely related to the instance not having the necessary permissions to interact with CloudWatch and EC2. An IAM role with the necessary policies attached to the EC2 instance will provide the instance with the necessary permissions to complete the installation of the AWS Data Provider for SAP."
        ],
        "isTranslating": false,
        "ja": "IAMロールを作成し、適切なポリシーをロールにアタッチし、EC2インスタンスにロールをアタッチします。\n\nこのエラーはおそらく、インスタンスがCloudWatchとEC2とのやり取りに必要な権限を持っていないことに関連しています。必要なポリシーがアタッチされたIAMロールをEC2インスタンスにアタッチすることで、インスタンスはAWSデータプロバイダのSAPのインストールを完了するために必要な権限を持つことができます。"
      },
      "corrects": [3],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is running its SAP applications on Oracle Database. Oracle Database is hosted on physical servers that are running SUSE Linux Enterprise Server. Because of compliance requirements, the company cannot install any additional software on its on-premises database servers. The company needs to migrate the SAP landscape to AWS and must continue to use Oracle Database.Which migration solution should the company use to meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "ある会社は、SAPアプリケーションをOracle Databaseで稼働しています。Oracle Databaseは、SUSE Linux Enterprise Serverを稼働している物理サーバー上でホストされています。規制要件のため、同社はオンプレミスのデータベースサーバーに追加のソフトウェアをインストールできません。同社はSAPランドスケープをAWSに移行する必要があり、引き続きOracle Databaseを使用する必要があります。これらの要件を満たすために、会社はどの移行ソリューションを使用すべきでしょうか？"
      },
      "choices": [
        {
          "en": "AWS Server Migration Service (AWS SMS)",
          "isTranslating": false,
          "ja": "AWS Server Migration Service（AWS SMS）"
        },
        {
          "en": "AWS Application Migration Service (CloudEndure Migration)",
          "isTranslating": false,
          "ja": "AWSのアプリケーション移行サービス（CloudEndure Migration）"
        },
        {
          "en": "SAP Software Update Manager (SUM) Database Migration Option (DMO) with System Move",
          "isTranslating": false,
          "ja": "システム移行を伴うSAPソフトウェアアップデートマネージャ（SUM）データベース移行オプション（DMO）"
        },
        {
          "en": "Oracle Database replication with Oracle Data Guard",
          "isTranslating": false,
          "ja": "Oracle Data GuardによるOracle Databaseのレプリケーション"
        }
      ],
      "explanation": {
        "en": [
          "This option allows for replicating the Oracle Database from the on-premises physical servers to the AWS cloud while continuing to use Oracle Database and still maintain compliance requirements as no additional software needs to be installed on the on-premises servers. Oracle Data Guard provides high availability, disaster recovery, and data protection solutions for Oracle Database."
        ],
        "isTranslating": false,
        "ja": "このオプションにより、オンプレミスの物理サーバーからAWSクラウドにOracle Databaseをレプリケーションすることが可能であり、引き続きOracle Databaseを使用し、オンプレミスサーバーには追加のソフトウェアをインストールする必要がないため、規制要件を維持することができます。Oracle Data Guardは、Oracle Databaseの高可用性、災害復旧、データ保護ソリューションを提供します。\n\n[Michinosuke Memo]\nAWS Application Migration Service(MGN)だとエージェントが必要、AWS Server Migration Service(SMS)だとエージェントが不要です。https://blog.usize-tech.com/aws-sap-on-aws-speciality-study4/"
      },
      "corrects": [4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is planning to migrate its SAP workloads to AWS. The company will use two VPCs. One VPC will be for production systems, and one VPC will be for non-production systems. The company will host the non-production systems and the primary node of all the production systems in the same Availability Zone.What is the MOST cost-effective way to establish a connection between the production systems and the non-production systems?"
        ],
        "isTranslating": false,
        "ja": "ある企業がSAPのワークロードをAWSに移行する計画を立てています。その際、同社は2つのVPCを使用します。1つは本番システム用のVPCであり、もう一つは非本番システム用のVPCです。同社は、非本番システムと本番システムのプライマリノードすべてを同じアベイラビリティーゾーンでホストします。その場合、最も費用効果の高い方法で本番システムと非本番システムの間に接続を確立するには、何が最適ですか？"
      },
      "choices": [
        {
          "en": "Create an AWS Transit Gateway. Attach the VPCs to the transit gateway. Add the appropriate routes in the subnet route tables.",
          "isTranslating": false,
          "ja": "AWS トランジットゲートウェイを作成し、VPC をトランジットゲートウェイにアタッチします。そして、サブネットのルートテーブルに適切なルートを追加します。"
        },
        {
          "en": "Establish a VPC peering connection between the two VPCs. Add the appropriate routes in the subnet route tables.",
          "isTranslating": false,
          "ja": "2つのVPC間にVPCピアリング接続を確立し、サブネットのルートテーブルに適切なルートを追加してください。"
        },
        {
          "en": "Create an internet gateway in each VPUse an AWS Site-to-Site VPN connection between the two VPCs. Add the appropriate routes in the subnet route tables.",
          "isTranslating": false,
          "ja": "各VPCごとにインターネットゲートウェイを作成し、2つのVPC間にAWS Site-to-Site VPN接続を設定します。サブネットのルートテーブルに正しいルートを追加してください。"
        },
        {
          "en": "Set up an AWS Direct Connect connection between the two VPCs. Add the appropriate routes in the subnet route tables.",
          "isTranslating": false,
          "ja": "2つのVPC間でAWS Direct Connect接続を設定し、サブネットルートテーブルに適切なルートを追加してください。"
        }
      ],
      "explanation": {
        "en": [
          "VPC peering is a cost-effective solution for connecting two VPCs within the same AWS Region. This way the traffic between the two VPCs will stay within the AWS network and avoid internet charges. The routing tables for the subnets in each VPC must be updated with routes to the other VPC, allowing the instances in the VPCs to communicate with each other.\n\nAWS Direct Connect is another option, but it is typically more expensive and not necessary for this scenario, as it is designed for high-bandwidth, low-latency connections between a customer's data center and AWS, while AWS Transit Gateway is designed to be used as a hub for connecting multiple VPCs, VPC peering provides a simpler, more cost-effective solution for this scenario."
        ],
        "isTranslating": false,
        "ja": "VPCピアリングは、同じAWSリージョン内の2つのVPCを接続するための費用効果の高いソリューションです。これにより、2つのVPC間のトラフィックはAWSネットワーク内で処理され、インターネット料金を回避できます。各VPCのサブネットのルーティングテーブルには、他のVPCへのルートが更新される必要があります。これにより、VPC内のインスタンス同士が通信できるようになります。\n\nAWS Direct Connectは別の選択肢ですが、一般的により高価であり、このシナリオでは必要ありません。AWS Direct Connectは、顧客のデータセンターとAWSの間で高帯域幅、低レイテンシ接続が必要なシナリオに設計されています。一方、AWS Transit Gatewayは、複数のVPCを接続するための中央ハブとして使用されるように設計されていますが、VPCピアリングはこのシナリオにはよりシンプルかつ費用対効果の高いソリューションを提供します。"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "An SAP engineer has deployed an SAP S/4HANA system on an Amazon EC2 instance that runs Linux. The SAP license key has been installed. After a while, the newly installed SAP instance presents an error that indicates that the SAP license key is not valid because the SAP system’s hardware key changed. There have been no changes to the EC2 instance or its configuration.Which solution will permanently resolve this issue?"
        ],
        "isTranslating": false,
        "ja": "SAPエンジニアが、Linuxを実行するAmazon EC2インスタンスにSAP S/4HANAシステムを展開しました。SAPライセンスキーがインストールされました。しばらくすると、新しくインストールされたSAPインスタンスがエラーを表示し、SAPシステムのハードウェアキーが変更されたため、SAPライセンスキーが無効であることが示されます。EC2インスタンスやその構成に変更はありませんでした。この問題を永久的に解決するためには、どの解決策が最適でしょうか？"
      },
      "choices": [
        {
          "en": "Perform SAP kernel patching.",
          "isTranslating": false,
          "ja": "SAPカーネルのパッチ適用を行います。"
        },
        {
          "en": "Apply a new SAP license that uses a new hardware key. Install the new key.",
          "isTranslating": false,
          "ja": "新しいハードウェアキーを利用した新しいSAPライセンスを適用してください。新しいキーをインストールしてください。"
        },
        {
          "en": "Set the SLIC_HW_VERSION Linux environment variable.",
          "isTranslating": false,
          "ja": "SLIC_HW_VERSIONというLinux環境変数を設定してください。"
        },
        {
          "en": "Reboot the EC2 instance.",
          "isTranslating": false,
          "ja": "EC2インスタンスを再起動します。"
        }
      ],
      "explanation": {
        "en": [
          "A - because simply applying a new license will result in an invalid license later on again. As said in https://docs.aws.amazon.com/sap/latest/general/overview-sap-on-aws.html you need to apply a proper kernel patch before applying the license to PERMANENTLY solve the issue. ",
          "",
          "",
          "When an SAP S/4HANA system is installed, a unique hardware key is generated that is tied to the specific hardware configuration of the system. This hardware key is used to validate the SAP license key. If the system's hardware key changes, the license key becomes invalid, and the SAP system presents an error message indicating that the license key is not valid.",
          "In the given scenario, the error message indicates that the hardware key of the SAP system has changed, even though there have been no changes to the EC2 instance or its configuration. This can happen due to various reasons, such as a kernel upgrade or a system update.",
          "Performing SAP kernel patching will ensure that the SAP system's hardware key remains the same, and the SAP license key remains valid. This is because kernel patching ensures that the SAP system's software remains unchanged, and the hardware key is tied to the specific software configuration of the system.",
          "",
          "Option B, applying a new SAP license that uses a new hardware key, is not a permanent solution because the issue will likely recur if the hardware key changes again.",
          "Option C, setting the SLIC_HW_VERSION Linux environment variable, is not a solution because this variable is used to configure the hardware key of the SAP system. If the hardware key changes, setting this variable will not resolve the issue.",
          "Option D, rebooting the EC2 instance, is not a solution because the issue is not related to the instance's uptime or memory usage. Rebooting the instance will not change the hardware key of the SAP system, which is causing the error."
        ],
        "isTranslating": false,
        "ja": "ERROR"
      },
      "corrects": [1],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "An SAP technology consultant needs to scale up a primary application server (PAS) instance. The PAS currently runs on a c5a.xlarge Amazon EC2 instance. The SAP technology consultant needs to change the instance type to c5a.2xlarge.How can the SAP technology consultant meet this requirement?"
        ],
        "isTranslating": false,
        "ja": "SAPテクノロジーコンサルタントは、プライマリアプリケーションサーバー（PAS）インスタンスのスケールアップが必要です。PASは現在、c5a.xlarge Amazon EC2インスタンスで実行されています。SAPテクノロジーコンサルタントは、インスタンスタイプをc5a.2xlargeに変更する必要があります。この要件を満たすには、どのようにすればよいですか？"
      },
      "choices": [
        {
          "en": "Stop the complete SAP system. Stop the EC2 instance. Use the AWS Management Console or the AWS CLI to change the instance type. Start the EC2 instance. Start the complete SAP system.",
          "isTranslating": false,
          "ja": "完全なSAPシステムを停止します。EC2インスタンスを停止します。インスタンスタイプを変更するには、AWSの管理コンソールまたはAWS CLIを使用します。EC2インスタンスを起動します。完全なSAPシステムを起動します。"
        },
        {
          "en": "While SAP is running, use the AWS Management Console or the AWS CLI to change the instance type without stopping the EC2 instance.",
          "isTranslating": false,
          "ja": "SAPが実行中の場合は、EC2インスタンスを停止せずにAWS Management ConsoleまたはAWS CLIを使用してインスタンスタイプを変更してください。"
        },
        {
          "en": "Stop the complete SAP system. Terminate the EC2 instance. Use the AWS Management Console or the AWS CLI to change the instance type. Start the EC2 instance. Start the complete SAP system.",
          "isTranslating": false,
          "ja": "完全なSAPシステムを停止します。 EC2インスタンスを終了します。 AWS管理コンソールまたはAWS CLIを使用してインスタンスタイプを変更します。 EC2インスタンスを起動します。 SAPシステム全体を起動します。"
        },
        {
          "en": "While SAP is running, log in to the EC2 instance. Run the following AWS CLI command: aws ec2 modify-instance-attribute --instance-id <INSTANCEID> --instance-type \"{\\\"Value\\\": \\\"c5a.2xlargel\\\"}\".",
          "isTranslating": false,
          "ja": "SAPが実行されている間に、EC2インスタンスにログインしてください。次のAWS CLIコマンドを実行してください。aws ec2 modify-instance-attribute --instance-id <INSTANCEID> --instance-type \"{\\\"Value\\\": \\\"c5a.2xlargel\\\"}\"。"
        }
      ],
      "explanation": {
        "en": [
          "Use the AWS Management Console or the AWS CLI to change the instance type, start the EC2 instance, and start the complete SAP system.\n\nTo change the instance type of an EC2 instance, it is necessary to stop the instance. The SAP system should also be stopped to avoid any potential issues during the instance change process. Once the instance type is changed, the EC2 instance and the SAP system can be restarted."
        ],
        "isTranslating": false,
        "ja": "AWS マネジメントコンソールまたは AWS CLI を使用して、EC2 インスタンスのインスタンスタイプを変更し、EC2 インスタンスと SAP システムを開始します。\n\nEC2 インスタンスのインスタンスタイプを変更するには、EC2 インスタンスを停止する必要があります。また、インスタンスの変更中に問題が発生しないように、SAP システムも停止する必要があります。インスタンスタイプが変更された後、EC2 インスタンスと SAP システムを再起動できます。"
      },
      "corrects": [1],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company has moved all of its SAP workloads to AWS. During peak business hours, end users are reporting performance issues because work processes are going into PRIV mode on an SAP S/4HANA system. An SAP support engineer indicates that SAP cannot provide support for this issue because some specific performance metrics are not available.Which combination of actions must the company perform to comply with SAP support requirements? (Choose three.)"
        ],
        "isTranslating": false,
        "ja": "ある会社はSAPの全てのワークロードをAWSに移行しました。ピークビジネス時間中、エンドユーザはパフォーマンスの問題を報告しています。理由は、SAP S/4HANA システム内でワークプロセスがPRIVモードに入っているためです。SAPのサポートエンジニアによると、特定のパフォーマンスメトリクスが利用できないため、SAPはこの問題に対してサポートを提供できません。SAPのサポート要件を満たすために、会社が実行する必要がある3つの行動の組み合わせは何ですか？（三つ選んでください。）\n\n（注意：命令形は使用しないでください。）"
      },
      "choices": [
        {
          "en": "Buy an SAP license from AWS. Ensure that the SAP license is installed.",
          "isTranslating": false,
          "ja": "AWSからSAPのライセンスを購入し、インストールされていることを確認してください。"
        },
        {
          "en": "Select only an AWS Migration Acceleration Program (MAP) certified managed service provider (MSP).",
          "isTranslating": false,
          "ja": "AWS Migration Acceleration Program (MAP) 認定を取得したマネージドサービスプロバイダー (MSP) を選択してください。"
        },
        {
          "en": "Enable detailed monitoring for Amazon CloudWatch on each Amazon EC2 instance where SAP workloads are running.",
          "isTranslating": false,
          "ja": "SAPワークロードが実行されている各Amazon EC2インスタンスで、Amazon CloudWatchの詳細モニタリングを有効にしてください。"
        },
        {
          "en": "Install, configure, and run the AWS Data Provider for SAP on each Amazon EC2 instance where SAP workloads are running.",
          "isTranslating": false,
          "ja": "AWS Data Provider for SAPを、SAPワークロードを実行している各Amazon EC2インスタンスにインストールし、構成して実行してください。"
        },
        {
          "en": "Integrate AWS Systems Manager with SAP Solution Manager to provide alerts about SAP parameter configuration drift.",
          "isTranslating": false,
          "ja": "SAP Solution ManagerとAWS Systems Managerを連携させることで、SAPパラメータ設定の変化に関するアラートを提供します。"
        },
        {
          "en": "Enable SAP enhanced monitoring through a SAPOSCOL enhanced function.",
          "isTranslating": false,
          "ja": "SAPOSCOLの拡張機能を通じて、SAPの拡張モニタリングを有効にしてください。"
        }
      ],
      "explanation": {
        "en": ["1656250 - SAP on AWS: Support prerequisites"],
        "isTranslating": false,
        "ja": "AWS上のSAP：サポートの前提条件\n\nAWS上にSAPを展開する前に、以下のサポートの前提条件があります。\n\n- SAPがAWSで公式にサポートしているAMI（Amazon Machine Image）を使用すること。\n- AWSで利用可能なすべてのSAP向けAMI上で、最新のSAP推奨カーネルとAWSの推奨パッチを適用すること。\n- インスタンスサイズがSAPのハードウェア要件に合致すること。\n- Amazon Elastic Block Store（Amazon EBS）に保存されているSAPデータのスナップショットを定期的に作成すること。\n- AWS CloudFormationを使用して、SAPシステムをデプロイ、設定、管理する場合は、AWS CloudFormationテンプレートでサポートされているSAPリリースバージョンのみを使用すること。\n\nこれらの前提条件を満たすことで、AWS上でより安定かつ高いパフォーマンスを発揮できるSAPシステムを構築・運用することができます。"
      },
      "corrects": [3, 4, 6],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company needs to implement high availability for its SAP S/4HANA system on AWS. The company will use a SUSE Linux Enterprise Server clustering solution in private subnets across two Availability Zones. An SAP solutions architect must ensure that the solution can route traffic to the active SAP instance in this clustered configuration.What should the SAP solutions architect do to meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "企業は、SAP S/4HANA システムの高可用性を AWS 上で実現する必要があります。企業は、2 つのアベイラビリティーゾーンにわたるプライベートサブネットに SUSE Linux Enterprise Server クラスタリングソリューションを使用します。SAP ソリューションアーキテクトは、クラスタ構成でアクティブな SAP インスタンスにトラフィックをルーティングできるようにする必要があります。これらの要件を満たすために、SAP ソリューションアーキテクトはどのような操作をすべきでしょうか？"
      },
      "choices": [
        {
          "en": "Implement the SAP cluster solution by using a secondary private IP address. Reassign the secondary private IP address from one network interface to another network interface in the event of any failure that affects the primary instance.",
          "isTranslating": false,
          "ja": "主要インスタンスに影響を及ぼす障害があった場合、セカンダリ プライベート IP アドレスの使用により SAP クラスタ ソリューションを実装し、セカンダリ プライベート IP アドレスを別のネットワーク インターフェイスに再割り当てします。"
        },
        {
          "en": "Implement the SAP cluster solution by using an Elastic IP address. Mask the failure of an instance or software by rapidly remapping the address to another instance in the account.",
          "isTranslating": false,
          "ja": "Elastic IPアドレスを使用してSAPクラスタソリューションを実装し、インスタンスまたはソフトウェアの障害を迅速に別のインスタンスにアドレスを再マップして、マスキングします。"
        },
        {
          "en": "Implement the SAP cluster solution by using a public IP address. Use this public IP address for communication between the instances and the internet.",
          "isTranslating": false,
          "ja": "SAPクラスター・ソリューションをパブリックIPアドレスを用いて実装してください。このパブリックIPアドレスを、インスタンス同士の通信及びインターネットとの通信に使用してください。"
        },
        {
          "en": "Implement the SAP cluster solution by using an overlay IP address that is outside the CIDR block of the VPC. Use overlay IP address routing to dynamically update the route table to point to the active node and provide external access by using a Network Load Balancer or AWS Transit Gateway.",
          "isTranslating": false,
          "ja": "VPCのCIDRブロック外にあるオーバーレイIPアドレスを使用して、SAPクラスタソリューションを実装します。オーバーレイIPアドレスのルーティングを使用して、ルートテーブルを動的に更新し、アクティブなノードを指すようにします。また、ネットワークロードバランサーやAWSトランジットゲートウェイを使用して外部からアクセスできるようにします。"
        }
      ],
      "explanation": {
        "en": [
          "Implement the SAP cluster solution by using an overlay IP address that is outside the CIDR block of the VPC.Use overlay IP address routing to dynamically update the route table to point to the active node and provide external access by using a Network Load Balancer or AWS Transit Gateway.\n\nThis solution implements an overlay IP address that is outside the CIDR block of the VPC. This helps in providing external access to the active node, which can be dynamically updated by the route table to ensure high availability. A Network Load Balancer or AWS Transit Gateway can be used to provide access to the active node. This solution provides a robust high availability solution that helps ensure the continuity of the SAP S 4HANA system on AWS."
        ],
        "isTranslating": false,
        "ja": "VPCのCIDRブロックの外側にあるオーバーレイIPアドレスを使用して、SAPクラスターソリューションを実装します。オーバーレイIPアドレスルーティングを使用して、ルートテーブルを動的に更新し、アクティブなノードを指すようにします。ネットワークロードバランサーまたはAWSトランジットゲートウェイを使用して、外部からアクセスできるようにします。\n\nこのソリューションでは、VPCのCIDRブロックの外側にあるオーバーレイIPアドレスを使用して実装されます。これにより、ノードのアクティブ化に応じてルートテーブルが動的に更新され、高可用性が確保されます。また、ネットワークロードバランサーまたはAWSトランジットゲートウェイを使用して、アクティブなノードにアクセスできるようにします。このソリューションは、SAP S/4HANAシステムの高可用性を確保する堅牢な解決策を提供します。"
      },
      "corrects": [4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is migrating its SAP workloads to AWS. The company’s IT team installs a highly available SAP S/4HANA system that uses the SAP HANA system replication cluster package on SUSE Linux Enterprise Server. The IT team deploys the system by using cluster nodes in different Availability Zones within the same AWS Region.After the initial launch of the SAP application, the application is accessible. However, after failover, the IT team cannot access the application even though the system is up and running on the secondary node. After investigation, an SAP solutions architect discovers that the virtual IP address has not been used correctly.Which combination of steps should the SAP solutions architect take to resolve this problem? (Choose two.)"
        ],
        "isTranslating": false,
        "ja": "会社はSAPワークロードをAWSに移行しています。企業のITチームは、SUSE Linux Enterprise Server上のSAP HANAシステムレプリケーションクラスターパッケージを使用する高可用性のSAP S/4HANAシステムをインストールします。ITチームは、同じAWSリージョン内の異なる可用性ゾーンのクラスターノードを使用してシステムを展開します。SAPアプリケーションの最初の起動後、アプリケーションはアクセス可能です。しかし、フェイルオーバー後、システムが二次ノードで稼働しているにもかかわらず、ITチームはアプリケーションにアクセスできません。調査の結果、SAPのソリューションアーキテクトは、仮想IPアドレスが正しく使用されていないことを発見しました。この問題を解決するために、SAPのソリューションアーキテクトが実行すべき手順の組み合わせは何ですか？(２つ選んでください。)\n\n1. Modify the SAP HANA replication parameters.\n\n2. Configure the virtual IP address as the client access point.\n\n3. Configure the resource record set (RRS) for the virtual IP address to specify health check information.\n\n4. Configure the resource record set (RRS) for the virtual IP address to specify that DNS is the routing policy.\n\n5. Modify the SAP HANA failover sequence to use the virtual IP address."
      },
      "choices": [
        {
          "en": "Use an overlay IP address as a secondary IP address with the primary node of the cluster.",
          "isTranslating": false,
          "ja": "クラスターのプライマリ・ノードでオーバーレイ IP アドレスをセカンダリ IP アドレスとして使用します。"
        },
        {
          "en": "Choose an overlay IP address within the VPC CIDR block that corresponds with the secondary node of the cluster.",
          "isTranslating": false,
          "ja": "クラスターのセカンダリノードに対応する VPC CIDR ブロック内のオーバーレイ IP アドレスを選択してください。"
        },
        {
          "en": "Use an overlay IP address as a virtual IP address.",
          "isTranslating": false,
          "ja": "バーチャル IP アドレスとしてオーバーレイ IP アドレスを使用します。"
        },
        {
          "en": "Choose an overlay IP address within the VPC CIDR block that corresponds with the primary node of the cluster.",
          "isTranslating": false,
          "ja": "クラスターのプライマリノードに対応するVPC CIDRブロック内のオーバーレイIPアドレスを選択してください。"
        },
        {
          "en": "Choose an overlay IP address outside the VPC CIDR block that hosts the application and the database.",
          "isTranslating": false,
          "ja": "アプリケーションとデータベースをホストするVPC CIDRブロックの外側にあるオーバーレイIPアドレスを選択してください。"
        }
      ],
      "explanation": {
        "en": [
          "In order to resolve the issue with virtual IP address after failover, the SAP solutions architect needs to use an overlay IP address as a virtual IP address. This will allow the virtual IP address to be used as a shared IP address that is accessible even if the primary node fails and the secondary node takes over.\n\nAdditionally, the overlay IP address should be chosen outside the VPC CIDR block that hosts the application and the database. This will ensure that the IP address is accessible from outside the VPC and the SAP application can be accessed even after failover.\n\nBy using these two steps, the SAP solutions architect can resolve the issue with the virtual IP address after failover, and ensure that the SAP application remains accessible even in the event of a failover."
        ],
        "isTranslating": false,
        "ja": "仮想 IP アドレスに関する問題を解決するためには、SAP ソリューションアーキテクトはオーバーレイ IP アドレスを仮想 IP アドレスとして使用する必要があります。これにより、仮想 IP アドレスを共有 IP アドレスとして使用でき、プライマリノードが故障しセカンダリノードが引き継いだ場合でもアクセス可能になります。\n\nさらに、オーバーレイ IP アドレスは、アプリケーションとデータベースをホストする VPC CIDR ブロックの外部から選択する必要があります。これにより、IP アドレスが VPC の外部からアクセス可能であり、フェイルオーバー後も SAP アプリケーションにアクセスできるようになります。\n\nこれらの 2 つの手順を使用することで、SAP ソリューションアーキテクトはフェイルオーバー後の仮想 IP アドレスの問題を解決し、フェイルオーバーが発生した場合でも SAP アプリケーションにアクセス可能になることを確実にすることができます。"
      },
      "corrects": [3, 5],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company wants to migrate its on-premises servers to AWS. These servers include SAP ERP Central Component (SAP ECC) on Oracle Database. The company is running SAP ECC application servers and Oracle Database servers on AIX. The company must migrate the SAP workloads to AWS with minimal changes.Which solution will meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "ある会社は、自社のオンプレミスサーバーをAWSに移行したいと考えています。これらのサーバーには、Oracle Database上のSAP ERP Central Component（SAP ECC）が含まれています。同社はAIX上でSAP ECCアプリケーションサーバーとOracle Databaseサーバーを実行しています。同社は、SAPワークロードを最小限の変更でAWSに移行する必要があります。どのソリューションがこれらの要件を満たしますか？"
      },
      "choices": [
        {
          "en": "Perform a heterogeneous migration for SAP on AWS. Specify the SAP ECC application servers to run on SUSE Linux Enterprise Server. Specify Oracle Database to run on Oracle Enterprise Linux on a Dedicated Host.",
          "isTranslating": false,
          "ja": "SAP on AWSの異種混合移行を行います。SAP ECC アプリケーションサーバをSUSE Linux Enterprise Server上で実行します。また、Oracleデータベースを専用ホスト上のOracle Enterprise Linuxで実行します。"
        },
        {
          "en": "Perform a homogeneous migration for SAP on AWS. Specify the SAP ECC application servers and Oracle Database to run on AIX.",
          "isTranslating": false,
          "ja": "SAPをAWS上に移行し、SAP ECCアプリケーションサーバとOracleデータベースをAIX上で実行します。"
        },
        {
          "en": "Perform a heterogeneous migration for SAP on AWS. Specify the SAP ECC application servers and Oracle Database to run on Oracle Enterprise Linux.",
          "isTranslating": false,
          "ja": "AWS上でSAPの異質なマイグレーションを実行してください。SAP ECCアプリケーションサーバーとOracleデータベースをOracle Enterprise Linux上で実行するように指定してください。"
        },
        {
          "en": "Perform a heterogeneous migration for SAP on AWS. Specify the SAP ECC application servers and Oracle Database to run on Windows.",
          "isTranslating": false,
          "ja": "AWS上のSAPの異種混合移行を実行してください。SAP ECCアプリケーションサーバとOracleデータベースがWindows上で実行されるように指定してください。"
        }
      ],
      "explanation": {
        "en": ["AWS only supports Oracle DB on OLE"],
        "isTranslating": false,
        "ja": "AWSはOracle DBをOLE上でのみサポートしています。"
      },
      "corrects": [3],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company has deployed its SAP applications into multiple Availability Zones in the same AWS Region. To accommodate storage of media files, database table export and import, and files dropped by third-party tools, the company has mounted Amazon Elastic File System (Amazon EFS) file systems between the SAP instances. The company needs to retrieve the files quickly for installations, updates, and system refreshes.Over time, the EFS file systems have grown exponentially to multiple terabytes. An SAP solutions architect must optimize storage cost for the files that are stored in Amazon EFS.Which solution will meet this requirement with the LEAST administrative overhead?"
        ],
        "isTranslating": false,
        "ja": "ある会社は、複数の可用性ゾーンにSAPアプリケーションを展開しました。メディアファイルの保存、データベースのテーブルのエクスポート・インポート、およびサードパーティのツールによってドロップされたファイルを格納するため、同社はSAPインスタンス間にAmazon Elastic File System（Amazon EFS）ファイルシステムをマウントしました。同社は、インストール、アップデート、およびシステムリフレッシュのためにファイルを素早く取得する必要があります。EFSファイルシステムは時間の経過とともに複数のテラバイトに成長しています。SAPソリューションアーキテクトは、Amazon EFSに保存されているファイルのストレージコストを最適化する必要があります。最小限の管理オーバーヘッドでこの要件を満たす解決策は何ですか？"
      },
      "choices": [
        {
          "en": "Scan the files manually to identify unnecessary files. Delete the unnecessary files.",
          "isTranslating": false,
          "ja": "不要なファイルを特定するために、ファイルを手動でスキャンしてください。不要なファイルを削除してください。"
        },
        {
          "en": "Move the files to Amazon S3 Glacier Deep Archive.",
          "isTranslating": false,
          "ja": "ファイルをAmazon S3 Glacier Deep Archive に移動してください。"
        },
        {
          "en": "Apply a lifecycle policy on the files in Amazon EFS to move the files to EFS Standard-Infrequent Access (Standard-IA).",
          "isTranslating": false,
          "ja": "Amazon EFSのファイルにライフサイクルポリシーを適用し、ファイルをEFSのStandard-Infrequent Access（Standard-IA）に移動します。"
        },
        {
          "en": "Move the files to Amazon S3 Glacier. Apply an S3 Glacier vault lock policy to the files.",
          "isTranslating": false,
          "ja": "ファイルをAmazon S3 Glacierに移動し、それらにS3 Glacier Vault Lockポリシーを適用してください。"
        }
      ],
      "explanation": {
        "en": [
          "Applying a lifecycle policy on the files stored in Amazon EFS to move the files to EFS Standard-Infrequent Access (Standard-IA) will optimize the storage cost for the files with the least administrative overhead. The lifecycle policy can automatically transition files to the lower-cost storage class based on the files' access patterns, reducing the cost of storing large amounts of data. The EFS Standard-IA class provides low-cost storage for infrequently accessed data, and the policy can be set to move data to this class after a specific number of days or after the data has been unmodified for a specified period. This solution allows the company to optimize storage costs with minimal manual intervention, thus reducing the administrative overhead."
        ],
        "isTranslating": false,
        "ja": "Amazon EFSに保存されたファイルにライフサイクルポリシーを適用して、ファイルをEFS Standard-Infrequent Access (Standard-IA)に移動することで、管理オーバーヘッドが最小限で、最少限度でストレージコストを最適化することができます。ライフサイクルポリシーにより、ファイルのアクセスパターンに基づいて、自動的に低コストのストレージクラスに遷移させることができ、大量のデータを格納するコストを削減することができます。EFS Standard-IAクラスは、アクセス頻度の低いデータの低コストなストレージを提供し、データが特定の日数後にこのクラスに移動するようにポリシーを設定することができます。このソリューションにより、会社は最小限の手動介入でストレージコストを最適化し、管理オーバーヘッドを削減することができます。"
      },
      "corrects": [3],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "An SAP specialist is building an SAP environment. The SAP environment contains Amazon EC2 instances that run in a private subnet in a VPC. The VPC includes a NAT gateway.The SAP specialist is setting up IBM Db2 high availability disaster recovery for the SAP cluster. After configuration of overlay IP address routing, traffic is not routing to the database EC2 instances.What should the SAP specialist do to resolve this issue?"
        ],
        "isTranslating": false,
        "ja": "SAPの専門家がSAP環境を構築しています。SAP環境には、VPC内のプライベートサブネットで実行されるAmazon EC2インスタンスが含まれています。VPCにはNATゲートウェイが含まれています。SAPの専門家は、SAPクラスターのためのIBM Db2高可用性災害復旧を設定しています。オーバーレイIPアドレスルーティングの構成後、トラフィックがデータベースEC2インスタンスにルーティングされていません。この問題を解決するには、SAPの専門家は何をすべきですか？"
      },
      "choices": [
        {
          "en": "Open a security group for SAP ports to allow traffic on port 443.",
          "isTranslating": false,
          "ja": "ポート443上のトラフィックを許可するために、SAPポートのセキュリティグループを開いてください。"
        },
        {
          "en": "Create route table entries to allow traffic from the database EC2 instances to the NAT gateway.",
          "isTranslating": false,
          "ja": "データベースEC2インスタンスからNATゲートウェイへのトラフィックを許可するためのルートテーブルエントリーを作成してください。"
        },
        {
          "en": "Turn off the source/destination check for the database EC2 instances.",
          "isTranslating": false,
          "ja": "データベースEC2インスタンスのソース/宛先チェックを無効にしてください。"
        },
        {
          "en": "Create an IAM role that has permission to access network traffic. Associate the role with the database EC2 instances.",
          "isTranslating": false,
          "ja": "ネットワークトラフィックにアクセスする権限を持つIAMロールを作成し、そのロールをデータベースEC2インスタンスに関連付けます。"
        }
      ],
      "explanation": {
        "en": [
          "https://docs.aws.amazon.com/sap/latest/sap-hana/sap-hana-on-aws-cluster-configuration-prerequisites.html"
        ],
        "isTranslating": false,
        "ja": "このページは、AWS上でSAP HANAのクラスター構成を実行する前提条件について説明しています。このドキュメントは、SAP HANAの熟練した管理者や、AWS上でSAP HANAを実行することに興味のある企業向けに作成されています。SAP HANAをクラスター構成でAWS上で実行するには、いくつかの前提条件が必要です。例えば、VPC（仮想プライベートクラウド）へのアクセス、アベイラビリティーゾーンの選択、クラウドフォーメーションスタックの構成、そして最適なEC2インスタンスタイプの選択などです。このドキュメントは、SAP HANAをAWS上ですばやく実行する手順を提供しています。"
      },
      "corrects": [3],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company uses an SAP application that runs batch jobs that are performance sensitive. The batch jobs can be restarted safely. The SAP application has six application servers. The SAP application functions reliably as long as the SAP application availability remains greater than 60%. The company wants to migrate the SAP application to AWS. The company is using a cluster with two Availability Zones.How should the company distribute the SAP application servers to maintain system reliability?"
        ],
        "isTranslating": false,
        "ja": "この会社は、パフォーマンスに敏感なバッチジョブを実行するSAPアプリケーションを使用しています。バッチジョブは安全に再起動できます。SAPアプリケーションには6つのアプリケーションサーバーがあります。SAPアプリケーションの可用性が60％以上であれば、SAPアプリケーションは信頼性を持って機能します。会社はSAPアプリケーションをAWSに移行したいと考えており、2つのアベイラビリティゾーンを持つクラスタを使用しています。\nこの場合、会社は以下のようにSAPアプリケーションサーバを分散配置することができます。\n\n- 1つのアベイラビリティゾーンに4つのアプリケーションサーバを配置します。\n- もう1つのアベイラビリティゾーンに2つのアプリケーションサーバを配置します。\n- アプリケーションサーバ間で負荷分散を行います。 \n\nこのようにすることで、バッチジョブを安全に再起動しながら、SAPアプリケーションの可用性を維持できます。また、負荷分散により、アプリケーションサーバーの性能を最大限に引き出すことができます。"
      },
      "choices": [
        {
          "en": "Distribute the SAP application servers equally across three partition placement groups.",
          "isTranslating": false,
          "ja": "SAPアプリケーションサーバを3つのパーティション配置グループに均等に配置します。"
        },
        {
          "en": "Distribute the SAP application servers equally across three Availability Zones.",
          "isTranslating": false,
          "ja": "SAPのアプリケーションサーバを3つのアベイラビリティゾーンに均等に配分します。"
        },
        {
          "en": "Distribute the SAP application servers equally across two Availability Zones.",
          "isTranslating": false,
          "ja": "SAPアプリケーションサーバを2つのアベイラビリティーゾーンに均等に配置します。"
        },
        {
          "en": "Create an Amazon EC2 Auto Scaling group across two Availability Zones. Set a minimum capacity value of 4.",
          "isTranslating": false,
          "ja": "2つのアベイラビリティーゾーンにまたがるAmazon EC2 Auto Scalingグループを作成し、最小キャパシティ値を4に設定してください。"
        }
      ],
      "explanation": {
        "en": [
          "The company wants to ensure that their SAP application remains available with a rate greater than 60%. By distributing the servers across three Availability Zones, the company can provide high availability and minimize the risk of a single point of failure. If one Availability Zone were to fail, the other two would remain available, and the overall system availability would remain above 60%. This configuration ensures that the system remains reliable and that batch jobs can be restarted safely if needed."
        ],
        "isTranslating": false,
        "ja": "企業は、SAPアプリケーションが60％を上回る利用率で利用可能であることを確保したいと考えています。サーバーを3つのアベイラビリティゾーンに分散配置することで、高可用性を提供し、単一障害点のリスクを最小限に抑えることができます。もし1つのアベイラビリティゾーンが故障した場合、残り2つのゾーンが利用可能であり、システム全体の可用性は60％を上回ったままです。この構成により、システムが信頼性があり、バッチジョブを必要に応じて安全に再開できるようになっています。"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company wants to migrate its SAP landscape from on premises to AWS.What are the MINIMUM requirements that the company must meet to ensure full support of SAP on AWS? (Choose three.)"
        ],
        "isTranslating": false,
        "ja": "AWS Support Plan\n- The company must have an active AWS Support Plan in order to receive technical support from AWS experts. \n\nSAP Support Agreement\n- The company must have a valid SAP support agreement to receive support from SAP in the event of any issues or faults with the SAP landscape on AWS. \n\nSAP-Certified Instance Types\n- The company must ensure that it is leveraging SAP-certified instance types on AWS, as these instances are specifically designed and optimized for SAP workloads. \n\nNote: These are the important minimum requirements, but there may be other specific requirements based on the company's SAP environment and needs."
      },
      "choices": [
        {
          "en": "Enable detailed monitoring for Amazon CloudWatch on each instance in the landscape.",
          "isTranslating": false,
          "ja": "ランドスケープ内の各インスタンスに対して、Amazon CloudWatch の詳細モニタリングを有効にしてください。"
        },
        {
          "en": "Deploy the infrastructure by using SAP Cloud Appliance Library.",
          "isTranslating": false,
          "ja": "SAP Cloud Appliance Libraryを使用して、インフラストラクチャを展開します。"
        },
        {
          "en": "Install, configure, and run the AWS Data Provider for SAP on each instance in the landscape.",
          "isTranslating": false,
          "ja": "ランドスケープ内の各インスタンスに、AWS データ・プロバイダー for SAP をインストール、設定し、実行します。"
        },
        {
          "en": "Protect all production instances by using Amazon EC2 automatic recovery.",
          "isTranslating": false,
          "ja": "Amazon EC2の自動回復機能を使用して、すべての本番インスタンスを保護してください。"
        },
        {
          "en": "Deploy the infrastructure for the SAP landscape by using AWS Launch Wizard for SAP.",
          "isTranslating": false,
          "ja": "SAPランドスケープのためのインフラストラクチャをAWS Launch Wizard for SAPを使用して展開します。"
        },
        {
          "en": "Deploy the SAP landscape on an AWS account that has either an AWS Business Support plan or an AWS Enterprise Support plan.",
          "isTranslating": false,
          "ja": "AWSビジネスサポートプランまたはAWSエンタープライズサポートプランがあるAWSアカウントにSAPランドスケープを展開してください。"
        }
      ],
      "explanation": {
        "en": [
          "To ensure full support of SAP on AWS, the company must:\n\nDeploy the infrastructure for the SAP landscape by using AWS Launch Wizard for SAP. This will provide a fully supported infrastructure for running SAP workloads on AWS and ensures that SAP is installed and configured correctly.\n\nInstall, configure and run the AWS Data Provider for SAP on each instance in the landscape. This provides the necessary tools and resources for running SAP on AWS and ensures that SAP data is stored, processed and managed effectively.\n\nDeploy the infrastructure on an AWS account that has either an AWS Business Support plan or an AWS Enterprise Support plan. This provides the company with access to technical support and resources needed to resolve issues and ensure SAP is running optimally on AWS."
        ],
        "isTranslating": false,
        "ja": "AWS上でのSAPの完全なサポートを確保するためには、企業は以下のことを行う必要があります。\n\n1. AWS Launch Wizard for SAPを使用して、SAPランドスケープのインフラストラクチャを展開する。これにより、SAPワークロードをAWSで実行するための完全にサポートされたインフラストラクチャが提供され、SAPが正しくインストールおよび設定されることが保証されます。\n\n2. 各インスタンスにAWS Data Provider for SAPをインストール、設定、および実行する。これにより、SAPをAWS上で実行するために必要なツールとリソースが提供され、SAPデータが効果的に保存、処理、および管理されることが保証されます。\n\n3. AWS Business SupportプランまたはAWS Enterprise Supportプランを持つAWSアカウントにインフラストラクチャを展開する。これにより、企業は問題を解決し、SAPがAWS上で最適に実行されることを保証するために必要な技術サポートとリソースへのアクセスを提供されます。"
      },
      "corrects": [1, 3, 6],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company wants to migrate its SAP S/4HANA software from on premises to AWS in a few weeks. An SAP solutions architect plans to use AWS Launch Wizard for SAP to automate the SAP deployment on AWS.Which combination of steps must the SAP solutions architect take to use Launch Wizard to meet these requirements? (Choose two.)"
        ],
        "isTranslating": false,
        "ja": "SAP ソリューションアーキテクトが要件を満たすために使用する Launch Wizard を使用するために取る必要があるステップの組み合わせは次のとおりです。 (2つ選択してください。)\n\n1. 既存の SAP 環境の要件を AWS 上の S/4HANA インスタンスに移行するために評価します。\n2. AWS アカウントで AWS Launch Wizard を実行するために必要な IAM ロールとポリシーを作成します。\n3. Launch Wizard コンソールで SAP ブループリントを選択し、必要に応じてカスタマイズします。\n4. SAP アプリケーション設定に基づいて CloudFormation スタックを自動的に生成するように Launch Wizard を構成します。\n5. CloudFormation スタックで定義された AWS リソースが SAP ワークロードに適した方法で構成されていることを確認します。"
      },
      "choices": [
        {
          "en": "Download the SAP software files from the SAP Support Portal. Upload the SAP software files to Amazon S3. Provide the S3 bucket path as an input to Launch Wizard.",
          "isTranslating": false,
          "ja": "SAPソフトウェアファイルをSAPサポートポータルからダウンロードします。SAPソフトウェアファイルをAmazon S3にアップロードします。Launch Wizardの入力として、S3バケットパスを提供します。"
        },
        {
          "en": "Provide the SAP S-user ID and password as inputs to Launch Wizard to download the software automatically.",
          "isTranslating": false,
          "ja": "Launch WizardにSAPのS-user IDおよびパスワードを入力し、ソフトウェアを自動的にダウンロードします。"
        },
        {
          "en": "Format the S3 file path syntax according to the Launch Wizard deployment recommendation.",
          "isTranslating": false,
          "ja": "Launch Wizardのデプロイ勧告に従って、S3ファイルパスの構文を整えます。"
        },
        {
          "en": "Use an AWS CloudFormation template for the automated deployment of the SAP landscape.",
          "isTranslating": false,
          "ja": "SAPランドスケープの自動展開には、AWS CloudFormationテンプレートを使用します。"
        },
        {
          "en": "Provision Amazon EC2 instances. Tag the instances to install SAP S/4HANA on them.",
          "isTranslating": false,
          "ja": "Amazon EC2インスタンスを提供し、SAP S/4HANAをインストールするためにタグ付けします。"
        }
      ],
      "explanation": {
        "en": [
          "Step A: By downloading the software files from the SAP Support Portal and uploading it to Amazon S3, the architect can ensure that the correct software version is being used for the migration. The S3 bucket path is then provided as an input to Launch Wizard, which will use the software files to automate the deployment of the SAP landscape.\n\nStep D: The use of an AWS CloudFormation template for the automated deployment of the SAP landscape is important because it provides an easy and efficient way to manage the infrastructure resources that are required for the SAP deployment. CloudFormation allows the architect to define the entire infrastructure as a single stack, and then use this stack to deploy and manage the infrastructure in a repeatable and predictable manner."
        ],
        "isTranslating": false,
        "ja": "ステップA：SAPサポートポータルからソフトウェアファイルをダウンロードしてAmazon S3にアップロードすることで、アーキテクトはマイグレーションに正しいソフトウェアバージョンが使われていることを保証できます。そして、S3バケットパスをLaunch Wizardに入力することで、Launch Wizardはソフトウェアファイルを使用してSAPランドスケープのデプロイメントを自動化します。\n\nステップD：SAPランドスケープの自動化デプロイメントにAWS CloudFormationテンプレートを使用することは重要です。なぜなら、SAPデプロイメントに必要なインフラストラクチャリソースを簡単かつ効率的に管理する方法を提供してくれるからです。CloudFormationを使用すると、アーキテクトはインフラ全体を単一のスタックとして定義し、このスタックを使用してインフラを反復可能かつ予測可能な方法でデプロイおよび管理できます。"
      },
      "corrects": [1, 4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company runs its SAP ERP 6.0 EHP 8 system on SAP HANA on AWS. The system is deployed on an r4.16xlarge Amazon EC2 instance with default tenancy. The company needs to migrate the SAP HANA database to an x2gd.16xlarge High Memory instance. After an operations engineer changes the instance type and starts the instance, the AWS Management Console shows a failed instance status check.What is the cause of this problem?"
        ],
        "isTranslating": false,
        "ja": "この会社は、SAP ERP 6.0 EHP 8システムをSAP HANA on AWSで実行しています。このシステムは、デフォルトテナントを使用してr4.16xlarge Amazon EC2インスタンスに展開されています。会社は、SAP HANAデータベースをx2gd.16xlarge High Memoryインスタンスに移行する必要があります。オペレーションエンジニアがインスタンスタイプを変更してインスタンスを起動した後、AWS Management Consoleには失敗したインスタンスステータスチェックが表示されています。問題の原因は何でしょうか？\n\nこの問題の原因は、x2gd.16xlargeインスタンスがデフォルトテナントではサポートされていないためです。つまり、別のテナントでしか使用できないため、AWS Management Consoleで失敗したステータスチェックが表示されているのです。したがって、オペレーションエンジニアがデフォルトテナント以外のテナントを使用するように指示する必要があります。"
      },
      "choices": [
        {
          "en": "The operations engineer missed the network configuration step during the post-migration activities.",
          "isTranslating": false,
          "ja": "移行後の作業中、運用エンジニアはネットワーク構成の手順を見落としてしまいました。"
        },
        {
          "en": "The operations engineer missed the Amazon CloudWatch configuration step during the post-migration activities.",
          "isTranslating": false,
          "ja": "移行後の作業中、オペレーションエンジニアがAmazon CloudWatchの設定手順を見逃してしまいました。"
        },
        {
          "en": "The operations engineer did not install Elastic Network Adapter (ENA) drivers before changing the instance type.",
          "isTranslating": false,
          "ja": "インスタンスタイプを変更する前に、オペレーションエンジニアはElastic Network Adapter (ENA)ドライバーをインストールしていなかったため、問題が発生しました。"
        },
        {
          "en": "The operations engineer did not create a new AMI from the original instance and did not launch a new instance with dedicated tenancy from the AMI.",
          "isTranslating": false,
          "ja": "オペレーションエンジニアは、元のインスタンスから新しいAMIを作成せず、AMIから専用テナンシーで新しいインスタンスを起動しませんでした。"
        }
      ],
      "explanation": {
        "en": [
          "The operations engineer did not create a new AMI from the original instance and did not launch a new instance with dedicated tenancy from the AMI.\n\nWhen migrating an SAP HANA database to a different instance type in AWS, it is important to first create an Amazon Machine Image (AMI) from the original instance. This will capture the configuration and software state of the instance and allow you to launch a new instance with the same configuration.\n\nIf you change the instance type without creating a new AMI, the instance may not be configured correctly for the new instance type, and it is possible that drivers or other software components may not work correctly.\n\nIn this case, it is likely that the operations engineer did not create a new AMI from the original instance and did not launch a new instance with dedicated tenancy from the AMI. This would have caused the instance to fail the instance status check, as the instance is not properly configured for the new instance type."
        ],
        "isTranslating": false,
        "ja": "オペレーションエンジニアは、元のインスタンスから新しいAMIを作成せず、そして、AMIから専用テナンシーを持つ新しいインスタンスを起動しませんでした。\n\nAWS上でSAP HANAデータベースを異なるインスタンスタイプに移行するときは、まず元のインスタンスからAmazon Machine Image(AMI)を作成することが重要です。これにより配置とソフトウェア状態がキャプチャされ、同じ構成を持つ新しいインスタンスを起動することができます。\n\nもし、新しいAMIを作成せずにインスタンスタイプを変更した場合、インスタンスが新しいインスタンスタイプ用に正しく構成されていない可能性があり、ドライバーや他のソフトウェアコンポーネントが正しく動作しない可能性があります。\n\nこの場合、オペレーションエンジニアは、元のインスタンスから新しいAMIを作成せず、AMIから専用テナンシーを持つ新しいインスタンスを起動しなかったと思われます。これにより、インスタンスステータスチェックに失敗した可能性があります。なぜなら、インスタンスが新しいインスタンスタイプに適切に構成されていなかったためです。"
      },
      "corrects": [4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is running SAP on anyDB at a remote location that has slow and inconsistent internet connectivity. The company wants to migrate its system to AWS and wants to convert its database to SAP HANA during this process. Because of the inconsistent internet connection, the company has not established connectivity between the remote location and the company’s VPC in the AWS Cloud.How should the company perform this migration?"
        ],
        "isTranslating": false,
        "ja": "インターネットの接続が遅く不安定なリモート場所で、ある企業がanyDB上でSAPを稼働させています。この企業は、システムをAWSに移行し、この過程でデータベースをSAP HANAに変換したいと考えています。しかしながら、不安定なインターネット接続のため、企業はリモート場所とAWSクラウド上の企業のVPCの間に接続を確立していません。この移行をどのように行うべきでしょうか？"
      },
      "choices": [
        {
          "en": "Migrate by using SAP HANA system replication over the internet connection. Specify a public IP address on the target system.",
          "isTranslating": false,
          "ja": "インターネット接続を介してSAP HANAシステム複製を使用して移行します。ターゲットシステムに公開IPアドレスを指定してください。"
        },
        {
          "en": "Migrate by using SAP Software Update Manager (SUM) Database Migration Option (DMO) with System Move. Use an AWS Snowball Edge Storage Optimized device to transfer the SAP export files to AWS.",
          "isTranslating": false,
          "ja": "SAPソフトウェアアップデートマネージャー（SUM）データベースマイグレーションオプション（DMO）を使用して、システムの移動を行ってください。AWS Snowball Edgeストレージ最適化デバイスを使用して、SAPのエクスポートファイルをAWSに転送してください。"
        },
        {
          "en": "Migrate by using SAP HANA system replication with initialization through backup and restore. Use an AWS Snowball Edge Storage Optimized device to transfer the SAP export files to AWS.",
          "isTranslating": false,
          "ja": "SAP HANA システムレプリケーションを使用し、バックアップとリストアを介した初期化を行って移行します。AWS Snowball Edge Storage Optimized デバイスを使用して、SAP エクスポートファイルを AWS に転送します。"
        },
        {
          "en": "Migrate by using SAP Software Update Manager (SUM) Database Migration Option (DMO) with System Move. Use Amazon Elastic File System (Amazon EFS) to transfer the SAP export files to AWS.",
          "isTranslating": false,
          "ja": "SAP Software Update Manager (SUM) Database Migration Option (DMO) を使用したシステム移行によって移行します。Amazon Elastic File System (Amazon EFS) を使用して、SAP のエクスポートファイルを AWS に転送します。"
        }
      ],
      "explanation": {
        "en": [
          "https://docs.aws.amazon.com/sap/latest/sap-hana/migrating-hana-tools.html#migrating-hana-snowball"
        ],
        "isTranslating": false,
        "ja": "こちらのページは、SAP HANAをAWSクラウド上に移行する際に、AWS Snowballを利用したデータ移行方法について説明しています。移行手順に従って、スムーズな移行を実現してください。"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A financial services company is implementing SAP core banking on AWS. The company must not allow any system information to traverse the public internet. The company needs to implement secure monitoring of its SAP ERP Central Component (SAP ECC) system to check for performance issues and faults in its application. The solution must maximize security and must be supported by SAP and AWS.How should the company integrate AWS metrics with its SAP system to meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "金融サービス企業は、SAPコアバンキングをAWS上で導入しています。企業は、公共インターネットを介してシステム情報が送信されることを許可してはなりません。企業は、パフォーマンスの問題やアプリケーション上の不具合を把握するため、SAP ERP Central Component（SAP ECC）システムのセキュアな監視を実施する必要があります。このソリューションは、SAPとAWSの両方でサポートされ、セキュリティを最大限に確保する必要があります。企業は、これらの要件を満たすために、どのようにAWSメトリックスをSAPシステムと統合すべきでしょうか？"
      },
      "choices": [
        {
          "en": "Set up SAP Solution Manager to call Amazon CloudWatch and Amazon EC2 endpoints with REST-based calls to populate SAPOSCOL details. Use SAP transaction ST06N to monitor CPU and memory utilization on each EC2 instance.",
          "isTranslating": false,
          "ja": "SAPOSCOLの詳細を取得するために、SAP Solution Managerを設定してAmazon CloudWatchおよびAmazon EC2エンドポイントをRESTベースの呼び出しで呼び出します。各EC2インスタンスのCPUおよびメモリ利用率を監視するために、SAPトランザクションST06Nを使用します。"
        },
        {
          "en": "Install the AWS Data Provider for SAP on the Amazon EC2 instances that host SAP. Allow access to the Amazon CloudWatch and EC2 endpoints through a NAT gateway. Create an IAM policy that allows the ec2:DescribeInstances action, the cloudwatch:GetMetricStatistics action, and the ec2:DescribeVolumes action for all EC2 resources.",
          "isTranslating": false,
          "ja": "SAPをホストするAmazon EC2インスタンスにAWS Data Provider for SAPをインストールし、NATゲートウェイを介してAmazon CloudWatchおよびEC2エンドポイントにアクセスできるようにしてください。また、すべてのEC2リソースに対するec2:DescribeInstancesアクション、cloudwatch:GetMetricStatisticsアクション、およびec2:DescribeVolumesアクションを許可するIAMポリシーを作成してください。"
        },
        {
          "en": "Install the AWS Data Provider for SAP on the Amazon EC2 instances that host SAP. Create VPC endpoints for Amazon CloudWatch and Amazon EC2. Allow access through these endpoints. Create an IAM policy that allows the ec2:DescribeInstances action, the cloudwatch:GetMetricStatistics action, and the ec2:DescribeVolumes action for all EC2 resources.",
          "isTranslating": false,
          "ja": "SAPをホストするAmazon EC2インスタンスにAWS Data Provider for SAPをインストールします。Amazon CloudWatchおよびAmazon EC2用のVPCエンドポイントを作成します。これらのエンドポイントを介してアクセスを許可します。すべてのEC2リソースに対して、ec2:DescribeInstancesアクション、cloudwatch:GetMetricStatisticsアクション、およびec2:DescribeVolumesアクションを許可するIAMポリシーを作成します。"
        },
        {
          "en": "Install the AWS Data Provider for SAP on the Amazon EC2 instances that host SAP. Create VPC endpoints for Amazon CloudWatch and Amazon EC2. Allow access through these endpoints. Create an IAM policy that allows all actions for all EC2 resources.",
          "isTranslating": false,
          "ja": "SAP をホストしている Amazon EC2 インスタンスに AWS Data Provider for SAP をインストールします。Amazon CloudWatch と Amazon EC2 に対する VPC エンドポイントを作成します。これらのエンドポイントを使用してアクセスを許可します。すべての EC2 リソースに対するすべてのアクションを許可する IAM ポリシーを作成します。"
        }
      ],
      "explanation": {
        "en": [
          "The financial services company should install the AWS Data Provider for SAP on the Amazon EC2 instances that host SAP. They should then create VPC endpoints for Amazon CloudWatch and Amazon EC2 and allow access through these endpoints. Finally, they should create an IAM policy that allows actions for all EC2 resources.\n\nThis approach provides a secure and supported solution for integrating AWS metrics with the SAP system. By creating VPC endpoints, all data transfer between the SAP system and AWS metrics services is kept within the Amazon VPC, avoiding any system information from traversing the public internet. The IAM policy provides the necessary permissions to access the CloudWatch and EC2 endpoints, allowing the SAP system to securely access AWS metrics data."
        ],
        "isTranslating": false,
        "ja": "金融サービス会社は、SAPをホストするAmazon EC2インスタンスにAWS Data Provider for SAPをインストールすべきです。「Amazon CloudWatch」と「Amazon EC2」向けにVPCエンドポイントを作成し、これらのエンドポイントを介してアクセスを許可する必要があります。最後に、全てのEC2リソースのアクションを許可するIAMポリシーを作成する必要があります。\n\nこのアプローチは、SAPシステムとAWSメトリクスサービスを統合するための安全でサポートされたソリューションを提供します。VPCエンドポイントを作成することで、SAPシステムとAWSメトリクスサービス間のすべてのデータ転送はAmazon VPC内で保持され、公共インターネットを通過してシステム情報が移動することを避けることができます。IAMポリシーは、CloudWatchおよびEC2エンドポイントにアクセスするための必要な権限を提供し、SAPシステムがAWSメトリクスデータに安全にアクセスできるようにします。"
      },
      "corrects": [3],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company hosts an SAP HANA database on an Amazon EC2 instance in the us-east-1 Region. The company needs to implement a disaster recovery (DR) site in the us-west-1 Region. The company needs a cost-optimized solution that offers a guaranteed capacity reservation, an RPO of less than 30 minutes, and an RTO of less than 30 minutes.Which solution will meet these requirements?"
        ],
        "isTranslating": false,
        "ja": "会社は、SAP HANAデータベースを米国東部1リージョンのAmazon EC2インスタンスでホストしています。会社は、米国西部1リージョンに災害復旧(DR)サイトを実装する必要があります。会社は、保証された容量予約、RPOが30分未満、RTOが30分未満のコスト最適化されたソリューションが必要です。これらの要件を満たす解決策はどれですか？"
      },
      "choices": [
        {
          "en": "Deploy a single EC2 instance to support the secondary database in us-west-1 with additional storage. Use this secondary database instance to support QA and production. Configure the primary SAP HANA database in us-east-1 to constantly replicate the data to the secondary SAP HANA database in us-west-1 by using SAP HANA system replication with preload off. During DR, shut down the QA SAP HANA instance and restart the production services at the secondary site.",
          "isTranslating": false,
          "ja": "米国西部の副データベースをサポートするため、追加のストレージを備えた単一のEC2インスタンスをデプロイしてください。この副データベースインスタンスを使用して、QAとプロダクションをサポートします。米国東部の主要なSAP HANAデータベースを設定し、SAP HANAシステムレプリケーションを使用してデータを米国西部のセカンダリSAP HANAデータベースに定期的にレプリケーションしてください。この際、データを事前読み込みしないようにしてください。災害発生時には、QA SAP HANAインスタンスをシャットダウンし、セカンダリサイトでプロダクションサービスを再起動してください。"
        },
        {
          "en": "Deploy a secondary staging server on an EC2 instance in us-west-1. Use CloudEndure Disaster Recovery to replicate changes at the database level from us-east-1 to the secondary staging server on an ongoing basis. During DR, initiate cutover, increase the size of the secondary EC2 instance to match the primary EC2 instance, and start the secondary EC2 instance.",
          "isTranslating": false,
          "ja": "米国西部のEC2インスタンス上に2次ステージングサーバーを展開します。CloudEndure Disaster Recoveryを使用して、常にus-east-1から2次ステージングサーバーにデータベースレベルの変更をレプリケートします。DR中には、カットオーバーを開始し、2次EC2インスタンスのサイズをプライマリEC2インスタンスに合わせて拡張し、2次EC2インスタンスを起動します。"
        },
        {
          "en": "Set up the primary SAP HANA database in us-east-1 to constantly replicate the data to a secondary SAP HANA database in us-west-1 by using SAP HANA system replication with preload on. Keep the secondary SAP HANA instance as a hot standby that is ready to take over in case of failure.",
          "isTranslating": false,
          "ja": "米国東部リージョンの主要なSAP HANAデータベースをセットアップし、SAP HANAシステムレプリケーションを用いて、常に米国西部リージョンの二次SAP HANAデータベースにデータを複製するように設定してください。前置きを使用してSAP HANA システムレプリケーションを行います。二次SAP HANAインスタンスをホットスタンバイとして維持し、障害時にすぐに引き継ぐことができるようにしてください。"
        },
        {
          "en": "Create an SAP HANA database AMI by using Amazon Elastic Block Store (Amazon EBS) snapshots. Replicate the database and log backup files from a primary Amazon S3 bucket in us-east-1 to a secondary S3 bucket in us-west-1. During DR, launch the EC2 instance in us-west-1 based on AMIs that are replicated. Update host information. Download database and log backups from the secondary S3 bucket. Perform a point-in-time recovery.",
          "isTranslating": false,
          "ja": "Amazon Elastic Block Store (Amazon EBS) スナップショットを使用して SAP HANA データベース AMI を作成します。プライマリの Amazon S3 バケットにあるデータベースとログのバックアップファイルを、us-west-1 のセカンダリ S3 バケットに複製します。災害復旧時には、複製された AMI を基に us-west-1 で EC2 インスタンスを起動します。ホスト情報を更新し、セカンダリ S3 バケットからデータベースとログのバックアップをダウンロードし、ポイントインタイムリカバリを実行します。"
        }
      ],
      "explanation": {
        "en": [
          "Option A is the correct solution that meets the given requirements. (Apply QA on DR site will satisfy the cost-optimized solution.)",
          "In this solution, a single EC2 instance is deployed in the us-west-1 Region to support the secondary database. This instance is configured with additional storage to ensure that it can accommodate the data that is replicated from the primary SAP HANA database in us-east-1. The primary database is configured to constantly replicate the data to the secondary database using SAP HANA system replication with preload off. During DR, the QA SAP HANA instance is shut down, and the production services are restarted at the secondary site.",
          "Option B is not a suitable solution because it involves setting up a secondary staging server in us-west-1 and using CloudEndure Disaster Recovery to replicate changes at the database level. While this solution can offer a low RPO and RTO, it does not provide a guaranteed capacity reservation.",
          "Option C is not a suitable solution because it involves setting up the secondary SAP HANA instance as a hot standby that is ready to take over in case of failure. While this solution can offer a low RPO and RTO, it does not provide a guaranteed capacity reservation.",
          "Option D is not a suitable solution because it involves creating an SAP HANA database AMI using Amazon Elastic Block Store (Amazon EBS) snapshots and replicating database and log backup files from a primary Amazon S3 bucket in us-east-1 to a secondary S3 bucket in us-west-1. While this solution can provide a guaranteed capacity reservation, it does not offer an RPO and RTO of less than 30 minutes.",
          "Therefore, option A is the correct solution that meets all the given requirements."
        ],
        "isTranslating": false,
        "ja": "ERROR"
      },
      "corrects": [1],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "An SAP solutions architect is leading the SAP basis team for a company. The company’s SAP landscape includes SAP HANA database instances for the following systems: sandbox, development, quality assurance test (QAT), system performance test (SPT), and production. The sandbox, development, and QAT systems are running on Amazon EC2 On-Demand Instances. The SPT and production systems are running on EC2 Reserved instances. All the EC2 instances are using Provisioned IOPS SSO (io2) Amazon Elastic Block Store (Amazon EBS) volumes.The entire development team is in the same time zone and works from 8 AM to 6 PM. The sandbox system is for research and testing that are not critical. The SPT and production systems are business critical. The company runs load-testing jobs and stress-testing jobs on the QAT systems overnight to reduce testing duration. The company wants to optimize infrastructure cost for the existing AWS resources.How can the SAP solutions architect meet these requirements with the LEAST amount of administrative effort?"
        ],
        "isTranslating": false,
        "ja": "ある会社のSAPシステム担当者が、同社のSAP全般を担当しています。同社のSAPシステムには、以下のシステム用にSAP HANA データベースインスタンスがあります。それらは、サンドボックス、開発環境、品質保証テスト(QAT)、システムパフォーマンステスト(SPT)、そして本番環境です。サンドボックス、開発環境、QATシステムは、Amazon EC2オンデマンドインスタンス上で実行されています。SPTおよび本番システムは、EC2リザーブドインスタンス上で実行されています。すべてのEC2インスタンスは、Provisioned IOPS SSO（io2）Amazon Elastic Block Store（Amazon EBS）ボリュームを使用しています。全ての開発チームメンバーが同じ時間帯であり、8時から18時まで働いています。サンドボックスシステムは、重要性の低い研究やテストに使用されます。SPTおよび本番システムは、ビジネス上の重要なものです。同社は、QATシステムで負荷テストジョブやストレステストジョブを夜間に実行して、テスト期間を短縮しています。同社は、既存のAWSリソースのインフラストラクチャコストを最適化したいと考えています。SAPソリューションアーキテクトは、どのようにして、最小限の管理労力でこれらの要件を満たすことができますか？"
      },
      "choices": [
        {
          "en": "Use a Spot Fleet instead of the Reserved Instances and On-Demand Instances.",
          "isTranslating": false,
          "ja": "予約済みインスタンスやオンデマンドインスタンスの代わりに、スポットフリートを使用してください。"
        },
        {
          "en": "Use Amazon EventBridge (Amazon CloudWatch Events) and Amazon CloudWatch alarms to stop the development and sandbox EC2 instances from 7 PM every night to 7 AM the next day.",
          "isTranslating": false,
          "ja": "Amazon EventBridgeとAmazon CloudWatchアラームを使用して、毎晩7時から翌日の午前7時まで開発およびサンドボックスEC2インスタンスを停止します。"
        },
        {
          "en": "Make the SAP basis team available 24 hours a day, 7 days a week to use the AWS CLI to stop and start the development and sandbox EC2 instances manually.",
          "isTranslating": false,
          "ja": "AWS CLIによる開発およびサンドボックスEC2インスタンスの手動の停止・起動をするために、SAP基盤チームを1週間7日24時間利用可能にしてください。"
        },
        {
          "en": "Change the EBS volume type to Throughput Optimized HDD (st1) for the /hana/data and /hana/log file systems for the production and non-production SAP HANA databases.",
          "isTranslating": false,
          "ja": "プロダクションおよび非プロダクションのSAP HANAデータベースの/hana/dataと/hana/logファイルシステムに対して、EBSボリュームタイプをスループット最適化HDD(st1)に変更してください。"
        }
      ],
      "explanation": {
        "en": [
          "Option B is the best solution as it allows the SAP solutions architect to automatically stop the development and sandbox EC2 instances during non-working hours without any manual intervention. This will help to save costs on On-Demand Instances.",
          "Option A, using a Spot Fleet, is not recommended for the SPT and production systems as they are business critical and require guaranteed capacity.",
          "Option C, making the SAP basis team available 24/7 to manually stop and start instances, is not a scalable solution and can lead to errors and increased administrative effort.",
          "Option D, changing the EBS volume type to Throughput Optimized HDD, may not be the best solution as it can affect the performance of the SAP HANA database. Additionally, this solution does not address the need to optimize infrastructure costs."
        ],
        "isTranslating": false,
        "ja": "最良の解決策はオプションBです。SAPソリューションアーキテクトは、非稼働時間中に開発およびサンドボックスEC2インスタンスを手動介入なしで自動的に停止できます。これによりオンデマンドインスタンスのコストを節約することができます。\nSpot Fleetを使用するオプションAは、SPTおよびプロダクションシステムには推奨されません。それらには保証された容量が必要であり、ビジネスに重要です。\nオプションC、SAP基盤チームを24時間365日稼働状態にして手動でインスタンスを停止および開始することは拡張可能な解決策ではなく、間違いや管理オーバーヘッドの増加を引き起こす可能性があります。\nオプションD、EBSボリュームタイプをスループット最適化HDDに変更することは、SAP HANAデータベースのパフォーマンスに影響する可能性があり、最適な解決策とは限りません。さらに、この解決策はインフラストラクチャコストを最適化する必要性に対処していません。"
      },
      "corrects": [2],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is hosting an SAP HANA database on AWS. The company is automating operational tasks, including backup and system refreshes. The company wants to use SAP HANA Studio to perform data backup of an SAP HANA tenant database to a backint interface. The SAP HANA database is running in multi-tenant database container (MDC) mode. The company receives the following error message during an attempt to perform the backup:",
          "",
          "",
          "",
          "What should an SAP solutions architect do to resolve this issue?"
        ],
        "isTranslating": false,
        "ja": "ある企業は、SAP HANAデータベースをAWS上にホスティングしています。バックアップやシステムのリフレッシュなどの運用タスクを自動化しています。会社は、SAP HANA Studioを使用して、SAP HANAテナントデータベースをバックインターフェースにバックアップすることを望んでいます。SAP HANAデータベースは、マルチテナントデータベースコンテナ（MDC）モードで実行されています。バックアップを実行しようとしたとき、会社は以下のエラーメッセージを受け取りました。\n\nこの問題を解決するために、SAPソリューションアーキテクトは何をすべきでしょうか？"
      },
      "choices": [
        {
          "en": "Set the execute permission for AWS Backint agent binary aws-backint-agent and for the launcher script aws-backint-agent-launcher.sh in the installation directory.",
          "isTranslating": false,
          "ja": "AWS Backintエージェントバイナリaws-backint-agentおよびインストールディレクトリ内のランチャースクリプトaws-backint-agent-launcher.shに実行権限を設定してください。"
        },
        {
          "en": "Verify the installation steps. Create symbolic links (symlinks).",
          "isTranslating": false,
          "ja": "インストール手順を確認し、シンボリックリンクを作成します。"
        },
        {
          "en": "Ensure that the catalog_backup_using_backint SAP HANA parameter is set to true. Ensure that the data_backup_parameter_file and log_backup_parameter_file parameters have the correct path location in the global.ini file.",
          "isTranslating": false,
          "ja": "catalog_backup_using_backintというSAP HANAパラメータがtrueに設定されていることを確認してください。また、global.iniファイル内のdata_backup_parameter_fileおよびlog_backup_parameter_fileパラメータが正しいパスに設定されていることを確認してください。"
        },
        {
          "en": "Add the SAP HANA system to SAP HANA Studio. Select multiple container mode, and then try to initiate the backup again.",
          "isTranslating": false,
          "ja": "SAP HANAシステムをSAP HANA Studioに追加します。複数のコンテナモードを選択し、バックアップを再開してみてください。"
        }
      ],
      "explanation": {
        "en": [
          "Reference: ",
          "https://me.sap.com/notes/0002512397  See ”Problem: The following error is displayed when initiating a backup from the SAP HANA console:” section following URL. https://docs.aws.amazon.com/ja_jp/sap/latest/sap-hana/aws-backint-agent-troubleshooting.html",
          "The error message indicates that the SAP HANA Studio is unable to connect to the tenant database for backup, and this is likely due to an incorrect connection. Option D suggests that an SAP solutions architect should add the SAP HANA system to SAP HANA Studio, select multi-container mode, and then initiate the backup again. This is a plausible solution as it addresses the issue of the incorrect connection. Therefore, D is the correct answer.",
          "Options A, B, and C are incorrect because they do not address the root cause of the issue, which is the incorrect connection to the tenant database. Option A suggests setting execute permissions for the AWS Backint agent, which is not relevant to the issue at hand. Option B suggests verifying installation steps and creating symbolic links, which may not resolve the issue. Option C suggests ensuring that the catalog_backup_using_backint SAP HANA parameter is set to true, and that the data_backup_parameter_file and log_backup_parameter_file parameters have the correct path location in the global.ini file, but this may not necessarily address the issue of the incorrect connection.\n"
        ],
        "isTranslating": false,
        "ja": "参照先：\nhttps://me.sap.com/notes/0002512397　上記URLの「Problem: The following error is displayed when initiating a backup from the SAP HANA console:」のセクションをご覧ください。\nhttps://docs.aws.amazon.com/ja_jp/sap/latest/sap-hana/aws-backint-agent-troubleshooting.html\nエラーメッセージは、SAP HANA Studioがテナントデータベースにバックアップのために接続できないことを示しており、これは接続が間違っているためです。Option Dは、SAP HANAシステムをSAP HANA Studioに追加し、マルチコンテナモードを選択してバックアップを再開するようにSAPソリューションアーキテクトがすることを示唆しており、接続が間違っている問題に対処する妥当な解決策です。したがって、Dが正しい解答です。\n\n一方、A、B、Cのオプションは、テナントデータベースへの正しい接続という根本的な問題に対処していないため、不正解です。オプションAは、問題に関係のないAWS Backintエージェントの実行許可を設定することを示唆しています。オプションBは、インストール手順の確認とシンボリックリンクの作成を示唆していますが、問題を解決しない場合があります。オプションCは、catalog_backup_using_backint SAP HANAパラメータがtrueに設定されていること、data_backup_parameter_fileとlog_backup_parameter_fileパラメータがglobal.iniファイルの正しい場所にあることを確認することを示唆していますが、接続が間違っている問題に対処する保証はありません。"
      },
      "corrects": [4],
      "selects": []
    },
    {
      "statement": {
        "en": [
          "A company is planning to migrate its on-premises SAP ERP Central Component (SAP ECC) system on SAP HANA to AWS. Each month, the system experiences two peaks in usage. The first peak is on the 21st day of the month when the company runs payroll. The second peak is on the last day of the month when the company processes and exports credit data. Both peak workloads are of high importance and cannot be rescheduled.The current SAP ECC system has six application servers, all of a similar size. During normal operation outside of peak usage, four application servers would suffice.Which purchasing option will meet the company’s requirements MOST cost-effectively on AWS?"
        ],
        "isTranslating": false,
        "ja": "ある企業が、オンプレミスのSAP ERP Central Component (SAP ECC) システムをSAP HANAからAWSに移行する計画を立てています。システムは、毎月2回のピーク使用量を経験しています。最初のピークは、会社が給与処理を実行する月の21日です。2番目のピークは、会社がクレジットデータを処理してエクスポートする月の最終日です。どちらのピークワークロードも高い重要度を持っており、スケジュール変更はできません。現在のSAP ECCシステムには6つのアプリケーションサーバーがあり、すべてのサーバーが同様のサイズです。ピーク使用量以外の通常の運用では、4つのアプリケーションサーバーが十分です。AWSのどの購入オプションが、この企業の要件を最も費用効果良く満たしますか？"
      },
      "choices": [
        {
          "en": "Four Reserved Instances and two Spot Instances",
          "isTranslating": false,
          "ja": "4つのReserved Instanceと2つのSpot Instanceを使用します。"
        },
        {
          "en": "Six On-Demand Instances",
          "isTranslating": false,
          "ja": "オンデマンドのインスタンス6つ。"
        },
        {
          "en": "Six Reserved Instances",
          "isTranslating": false,
          "ja": "6つの予約済みインスタンス"
        },
        {
          "en": "Four Reserved Instances and two On-Demand Instances",
          "isTranslating": false,
          "ja": "4つのRI(リザーブドインスタンス)と2つのオンデマンドインスタンス"
        }
      ],
      "explanation": {
        "en": [
          "Explanation from our expert 1:",
          "Option D is the best choice for the company to meet its requirements in a cost-effective way because it leverages Reserved Instances for the predictable workload and On-Demand Instances for the peak periods. This option will allow the company to take advantage of the lower cost of Reserved Instances for the majority of the time, while still having the capacity to handle the peak loads with On-Demand Instances.",
          "Option A (Four Reserved Instances and two Spot Instances) would be less effective because Spot Instances are not suitable for critical workloads that cannot be interrupted or rescheduled.",
          "Option B (Six On-Demand Instances) would be more expensive because the company would be paying the On-Demand price for all six instances, even during periods of lower workload.",
          "Option C (Six Reserved Instances) may also be less effective because the company would be paying for six instances even though it only needs four during a normal operation outside of peak usage, which could result in underutilization and increased costs.",
          "",
          "Explanation from our expert 2:",
          "For the normal operation outside of peak usage, four application servers would suffice, and the company could use Reserved Instances to reduce costs and provide a consistent performance. However, during peak usage, the company needs six application servers, which would not be covered by the four Reserved Instances. In this scenario, the company can use two additional On-Demand Instances to meet the additional capacity requirement during peak usage. This would ensure that the company has the necessary capacity during peak usage and also minimize costs as much as possible.\n\nUsing Spot Instances, as in option A, could result in unpredictable costs and performance as Spot Instances are subject to availability and bidding competition. Option B of using six On-Demand Instances would result in higher costs as compared to a mix of On-Demand and Reserved Instances. Option C of using six Reserved Instances would not be cost-effective as the company only needs six instances during peak usage and using this many instances outside of peak usage would result in unnecessary costs."
        ],
        "isTranslating": false,
        "ja": "コスト効率的な方法で企業の要件を満たすため、Option Dが最適な選択です。このオプションは、予測可能なワークロードに対してReserved Instancesを活用し、ピーク時にはOn-Demand Instancesを使用することで、ほとんどの時間でReserved Instancesの低コストを利用しながら、ピーク時の負荷対応のための容量を確保できます。\n\nOption AのSpot InstancesとReserved Instancesの組み合わせは、中断や再スケジュールができない重要なワークロードには適していないため、効果が低いでしょう。\n\nOption BのOn-Demand Instancesのみでは、低ワークロード期間でもOn-Demand価格を支払う必要があるため、より高価になります。\n\nOption CのReserved Instancesのみだと、ピーク使用時以外にも6つのインスタンス分の支払いをしなければならず、未使用分が生じ、コストが増加する可能性があります。\n\nオプションDでは、通常の運用時には4つのアプリケーションサーバーで十分であり、Reserved Instancesを使用してコストを削減し、一貫したパフォーマンスを提供できます。しかし、ピーク時には6つのアプリケーションサーバーが必要であり、4つのReserved Instancesだけではカバーできないため、ピーク時の追加容量要件を満たすために2つのOn-Demand Instancesを使用することができます。これにより、企業がピーク時に必要な容量を保有し、可能な限りコストを最小化することができます。\n\nSpot Instancesを使用する場合、依存するアベイラビリティや競売のような要因から、コストもパフォーマンスも予測不可能になる可能性があります。6つのOn-Demand Instancesを使用するOption Bは、On-DemandとReserved Instancesの組み合わせに比べて高いコストになります。6つのReserved Instancesを使用するOption Cは、ピーク時にしか必要ない場合もあるため、コスト効率が良くないです。"
      },
      "corrects": [4],
      "selects": []
    }
  ]
}
